---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/cert/ddml_cert_partial_iv.log
  log type:  text
 opened on:  30 Aug 2024, 17:33:35

. 
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado
*! ddml v1.4.4
*! last edited: 30aug2024
*! authors: aa/ms

. mata: whichddml()
  
  Mata library for ddml and related programs,
  compiled 29 Aug 2024 under Stata 15.1 born 03 Feb 2020.
  authors AA/MS

. 
. use https://statalasso.github.io/dta/AJR.dta, clear

. 
. // necessary programs for cert; script exits with error if not installed
. findfile pystacked.ado
/Users/kahrens/Library/Application Support/Stata/ado/plus/p/pystacked.ado

. 
. set seed 123

. 
. ******************************************************************************** 
. **** Partially linear model.                                                                                 
>            ****
. ******************************************************************************** 
. 
. global Y logpgp95

. global X edes1975 temp* humid* steplow-oilres

. global D avexpr  

. global Z1 lat_abst

. global Z2 logem4

. 
. *** pystacked, no SS
. 
. *** initialise ddml and select model; 
. ddml init iv, kfolds(2) reps(2)

. ddml E[Y|X]: pystacked $Y $X , type(reg)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X , type(reg)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z1 $X , type(reg)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z2 $X , type(reg)
Learner Z2_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X] equation: logpgp95
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: avexpr
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: lat_abst
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: logem4
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate, robust


Model:                  iv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked
D equations (1):        avexpr
 avexpr learners:       D1_pystacked
Z equations (2):        lat_abst logem4
 lat_abst learners:     Z1_pystacked
 logem4 learners:       Z2_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner     Z learner
  st  1  Y1_pystacked  D1_pystacked     0.542    (0.160)  Z1_pystacked  Z2_pystacked
  st  2  Y1_pystacked  D1_pystacked     0.764    (0.290)  Z1_pystacked  Z2_pystacked

Mean/med    Y learner     D learner         b        SE      Z learner     Z learner
  st mn  Y1_pystacked  D1_pystacked     0.653    (0.233)  Z1_pystacked  Z2_pystacked
  st md  Y1_pystacked  D1_pystacked     0.653    (0.259)  Z1_pystacked  Z2_pystacked

Median over 2 stacking resamples
y-E[y|X]  = y-Y1_pystacked                         Number of obs   =        64
D-E[D|X]  = D-D1_pystacked 
Z-E[Z|X]  = Z1-Z1_pystacked Z2-Z2_pystacked 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .6532988   .2593441     2.52   0.012     .1449937    1.161604
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.6533    0.5422    0.5422    0.6533    0.7644    0.7644

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z1-Z1_pystacked_1 Z2-Z2_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .5422448   .1597716     3.39   0.001     .2290983    .8553914
       _cons |  -.0004445   .0841044    -0.01   0.996    -.1652862    .1643971
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
Cross-fitting E[y|X] equation: logpgp95
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: avexpr
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: lat_abst
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: logem4
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  iv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked
D equations (1):        avexpr
 avexpr learners:       D1_pystacked
Z equations (2):        lat_abst logem4
 lat_abst learners:     Z1_pystacked
 logem4 learners:       Z2_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner     Z learner
  st  1  Y1_pystacked  D1_pystacked     0.542    (0.168)  Z1_pystacked  Z2_pystacked
  st  2  Y1_pystacked  D1_pystacked     0.764    (0.265)  Z1_pystacked  Z2_pystacked
  st  3  Y1_pystacked  D1_pystacked     0.835    (0.318)  Z1_pystacked  Z2_pystacked

Mean/med    Y learner     D learner         b        SE      Z learner     Z learner
  st mn  Y1_pystacked  D1_pystacked     0.714    (0.275)  Z1_pystacked  Z2_pystacked
  st md  Y1_pystacked  D1_pystacked     0.764    (0.279)  Z1_pystacked  Z2_pystacked

Median over 3 stacking resamples
y-E[y|X]  = y-Y1_pystacked                         Number of obs   =        64
D-E[D|X]  = D-D1_pystacked 
Z-E[Z|X]  = Z1-Z1_pystacked Z2-Z2_pystacked 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .7643528   .2785749     2.74   0.006     .2183559     1.31035
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.7139    0.5422    0.5422    0.7644    0.8352    0.8352

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z1-Z1_pystacked_1 Z2-Z2_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .5422448    .168143     3.22   0.001     .2126906    .8717991
       _cons |  -.0004445   .0893707    -0.00   0.996    -.1756079    .1747189
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z1-Z1_pystacked_2 Z2-Z2_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .7643528   .2646476     2.89   0.004      .245653    1.283052
       _cons |  -.1052605   .1161123    -0.91   0.365    -.3328365    .1223155
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples
y-E[y|X]  = y-Y1_pystacked                         Number of obs   =        64
D-E[D|X]  = D-D1_pystacked 
Z-E[Z|X]  = Z1-Z1_pystacked Z2-Z2_pystacked 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .7139234   .2747715     2.60   0.009     .1753811    1.252466
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.7139    0.5422    0.5422    0.7644    0.8352    0.8352

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples
y-E[y|X]  = y-Y1_pystacked                         Number of obs   =        64
D-E[D|X]  = D-D1_pystacked 
Z-E[Z|X]  = Z1-Z1_pystacked Z2-Z2_pystacked 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .7643528   .2785749     2.74   0.006     .2183559     1.31035
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.7139    0.5422    0.5422    0.7644    0.8352    0.8352

. 
. *** pystacked, SS
. 
. *** initialise ddml and select model; 
. ddml init iv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: pystacked $Y $X , type(reg)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X , type(reg)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z1 $X , type(reg)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z2 $X , type(reg)
Learner Z2_pystacked added successfully.

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: logpgp95
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: avexpr
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: lat_abst
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: logem4
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. *** estimation of parameter of interest
. ddml estimate, robust


Model:                  iv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked
D equations (1):        avexpr
 avexpr learners:       D1_pystacked
Z equations (2):        lat_abst logem4
 lat_abst learners:     Z1_pystacked
 logem4 learners:       Z2_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner     Z learner
  st  1  Y1_pystacked  D1_pystacked     1.237    (2.243)  Z1_pystacked  Z2_pystacked
  ss  1  [shortstack]          [ss]     0.904    (0.300)          [ss]          [ss]
  ps  1   [poolstack]          [ps]     1.623    (1.601)          [ps]          [ps]
  st  2  Y1_pystacked  D1_pystacked     1.405    (0.656)  Z1_pystacked  Z2_pystacked
  ss  2  [shortstack]          [ss]     0.972    (0.370)          [ss]          [ss]
  ps  2   [poolstack]          [ps]     1.229    (0.530)          [ps]          [ps]

Mean/med    Y learner     D learner         b        SE      Z learner     Z learner
  st mn  Y1_pystacked  D1_pystacked     1.321    (0.897)  Z1_pystacked  Z2_pystacked
  ss mn  [shortstack]          [ss]     0.938    (0.331)          [ss]          [ss]
  ps mn   [poolstack]          [ps]     1.426    (0.754)          [ps]          [ps]
  st md  Y1_pystacked  D1_pystacked     1.321    (1.654)  Z1_pystacked  Z2_pystacked
  ss md  [shortstack]          [ss]     0.938    (0.338)          [ss]          [ss]
  ps md   [poolstack]          [ps]     1.426    (1.208)          [ps]          [ps]

Shortstack DDML model (median over 2 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z1-Z_lat_abst_ss Z2-Z_logem4_ss 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .9378335   .3382972     2.77   0.006     .2747833    1.600884
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.9378    0.9041    0.9041    0.9378    0.9716    0.9716

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z1-Z1_pystacked_1 Z2-Z2_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.236878   2.242629     0.55   0.581    -3.158594    5.632351
       _cons |   .5026012   1.194926     0.42   0.674    -1.839412    2.844614
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ss_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_1 
Z-E[Z|X]  = Z1-Z_lat_abst_ss_1 Z2-Z_logem4_ss_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .904058   .2996632     3.02   0.003     .3167288    1.491387
       _cons |   .0193415   .1367867     0.14   0.888    -.2487555    .2874384
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ps_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ps_1 
Z-E[Z|X]  = Z1-Z_lat_abst_ps_1 Z2-Z_logem4_ps_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    1.62292    1.60052     1.01   0.311    -1.514042    4.759882
       _cons |   .6021065   1.056769     0.57   0.569    -1.469122    2.673335
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X] equation: logpgp95
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: avexpr
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: lat_abst
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: logem4
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  iv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked
D equations (1):        avexpr
 avexpr learners:       D1_pystacked
Z equations (2):        lat_abst logem4
 lat_abst learners:     Z1_pystacked
 logem4 learners:       Z2_pystacked

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner     Z learner
  st  1  Y1_pystacked  D1_pystacked     1.237    (1.148)  Z1_pystacked  Z2_pystacked
  ss  1  [shortstack]          [ss]     0.904    (0.289)          [ss]          [ss]
  ps  1   [poolstack]          [ps]     1.623    (1.585)          [ps]          [ps]
  st  2  Y1_pystacked  D1_pystacked     1.405    (0.589)  Z1_pystacked  Z2_pystacked
  ss  2  [shortstack]          [ss]     0.972    (0.321)          [ss]          [ss]
  ps  2   [poolstack]          [ps]     1.229    (0.434)          [ps]          [ps]
  st  3  Y1_pystacked  D1_pystacked     0.796    (0.197)  Z1_pystacked  Z2_pystacked
  ss  3  [shortstack]          [ss]     0.867    (0.240)          [ss]          [ss]
  ps  3   [poolstack]          [ps]     0.645    (0.139)          [ps]          [ps]

Mean/med    Y learner     D learner         b        SE      Z learner     Z learner
  st mn  Y1_pystacked  D1_pystacked     1.146    (0.566)  Z1_pystacked  Z2_pystacked
  ss mn  [shortstack]          [ss]     0.914    (0.281)          [ss]          [ss]
  ps mn   [poolstack]          [ps]     1.166    (0.577)          [ps]          [ps]
  st md  Y1_pystacked  D1_pystacked     1.237    (0.613)  Z1_pystacked  Z2_pystacked
  ss md  [shortstack]          [ss]     0.904    (0.289)          [ss]          [ss]
  ps md   [poolstack]          [ps]     1.229    (0.600)          [ps]          [ps]

Shortstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z1-Z_lat_abst_ss Z2-Z_logem4_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .904058   .2891078     3.13   0.002     .3374171    1.470699
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.9143    0.8671    0.8671    0.9041    0.9716    0.9716

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z1-Z1_pystacked_1 Z2-Z2_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.236878   1.148349     1.08   0.281    -1.013844    3.487601
       _cons |   .5026012   .6411473     0.78   0.433    -.7540244    1.759227
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z1-Z1_pystacked_2 Z2-Z2_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.405208   .5892462     2.38   0.017     .2503072     2.56011
       _cons |   .1292861   .2243012     0.58   0.564    -.3103362    .5689084
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples
y-E[y|X]  = y-Y1_pystacked                         Number of obs   =        64
D-E[D|X]  = D-D1_pystacked 
Z-E[Z|X]  = Z1-Z1_pystacked Z2-Z2_pystacked 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.146187    .565807     2.03   0.043     .0372257    2.255148
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      1.1462    0.7965    0.7965    1.2369    1.4052    1.4052

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples
y-E[y|X]  = y-Y1_pystacked                         Number of obs   =        64
D-E[D|X]  = D-D1_pystacked 
Z-E[Z|X]  = Z1-Z1_pystacked Z2-Z2_pystacked 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.236878   .6128181     2.02   0.044     .0357768     2.43798
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      1.1462    0.7965    0.7965    1.2369    1.4052    1.4052

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ss_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_1 
Z-E[Z|X]  = Z1-Z_lat_abst_ss_1 Z2-Z_logem4_ss_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .904058   .2891078     3.13   0.002     .3374171    1.470699
       _cons |   .0193415   .1393611     0.14   0.890    -.2538013    .2924843
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2)
y-E[y|X]  = y-Y_logpgp95_ss_2                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_2 
Z-E[Z|X]  = Z1-Z_lat_abst_ss_2 Z2-Z_logem4_ss_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .9716091   .3210694     3.03   0.002     .3423246    1.600894
       _cons |   .0988001   .1400825     0.71   0.481    -.1757565    .3733567
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z1-Z_lat_abst_ss Z2-Z_logem4_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .9142634   .2805845     3.26   0.001     .3643278    1.464199
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.9143    0.8671    0.8671    0.9041    0.9716    0.9716

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z1-Z_lat_abst_ss Z2-Z_logem4_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .904058   .2891078     3.13   0.002     .3374171    1.470699
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.9143    0.8671    0.8671    0.9041    0.9716    0.9716

. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ps_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ps_1 
Z-E[Z|X]  = Z1-Z_lat_abst_ps_1 Z2-Z_logem4_ps_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    1.62292     1.5852     1.02   0.306    -1.484015    4.729855
       _cons |   .6021065   .8276512     0.73   0.467     -1.02006    2.224273
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(2) replay notable

Poolstack DDML model (sample=2)
y-E[y|X]  = y-Y_logpgp95_ps_2                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ps_2 
Z-E[Z|X]  = Z1-Z_lat_abst_ps_2 Z2-Z_logem4_ps_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.228829   .4342379     2.83   0.005     .3777385     2.07992
       _cons |   .1071121   .1904861     0.56   0.574    -.2662338     .480458
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(mn) replay notable

Poolstack DDML model (mean over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ps                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ps 
Z-E[Z|X]  = Z1-Z_lat_abst_ps Z2-Z_logem4_ps 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.165619    .577209     2.02   0.043       .03431    2.296928
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      1.1656    0.6451    0.6451    1.2288    1.6229    1.6229

. ddml estimate, mname(m0) spec(ps) rep(md) replay notable

Poolstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ps                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ps 
Z-E[Z|X]  = Z1-Z_lat_abst_ps Z2-Z_logem4_ps 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   1.228829   .6001473     2.05   0.041      .052562    2.405096
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      1.1656    0.6451    0.6451    1.2288    1.6229    1.6229

. 
. *** multiple learners, no SS
. ddml init iv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: pystacked $Y $X , type(reg)
Learner Y1_pystacked added successfully.

. ddml E[Y|X]: reg $Y $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Y2_reg added successfully.

. ddml E[D|X]: pystacked $D $X , type(reg)
Learner D1_pystacked added successfully.

. ddml E[D|X]: reg $D $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner D2_reg added successfully.

. ddml E[Z|X]: pystacked $Z1 $X , type(reg)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: reg $Z1 $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Z2_reg added successfully.

. ddml crossfit
Cross-fitting E[y|X] equation: logpgp95
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: avexpr
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: lat_abst
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate, robust


Model:                  iv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
 mse  1  Y1_pystacked  D1_pystacked     0.118    (0.218)  Z1_pystacked
 mse  2  Y1_pystacked  D1_pystacked    -0.808    (2.293)  Z1_pystacked
mse = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]    -0.345    (0.707)     [min-mse]
 mse md     [min-mse]     [min-mse]    -0.345    (1.693)     [min-mse]

Median over 2 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.3451165   1.693256    -0.20   0.838    -3.663836    2.973604
------------------------------------------------------------------------------

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.3451   -0.8085   -0.8085   -0.3451    0.1182    0.1182

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242   .2176075     0.54   0.587    -.3082787    .5447271
       _cons |   .1474464   .1002559     1.47   0.141    -.0490516    .3439444
------------------------------------------------------------------------------


. *** allcombos
. ddml estimate, allcombos


Model:                  iv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
*  1  1  Y1_pystacked  D1_pystacked     0.118    (0.157)  Z1_pystacked
   2  1  Y1_pystacked  D1_pystacked     0.071    (0.154)        Z2_reg
   3  1  Y1_pystacked        D2_reg    -0.091    (0.142)  Z1_pystacked
   4  1  Y1_pystacked        D2_reg    -0.318    (1.260)        Z2_reg
   5  1        Y2_reg  D1_pystacked    -1.395    (0.568)  Z1_pystacked
   6  1        Y2_reg  D1_pystacked    -0.647    (0.464)        Z2_reg
   7  1        Y2_reg        D2_reg     1.076    (0.643)  Z1_pystacked
   8  1        Y2_reg        D2_reg     2.890    (9.055)        Z2_reg
*  1  2  Y1_pystacked  D1_pystacked    -0.808    (2.257)  Z1_pystacked
   2  2  Y1_pystacked  D1_pystacked    -0.079    (0.094)        Z2_reg
   3  2  Y1_pystacked        D2_reg    -0.038    (0.052)  Z1_pystacked
   4  2  Y1_pystacked        D2_reg    -0.006    (0.007)        Z2_reg
   5  2        Y2_reg  D1_pystacked    -0.278    (2.345)  Z1_pystacked
   6  2        Y2_reg  D1_pystacked    -0.539    (0.236)        Z2_reg
   7  2        Y2_reg        D2_reg    -0.013    (0.106)  Z1_pystacked
   8  2        Y2_reg        D2_reg    -0.043    (0.016)        Z2_reg
* = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
   1 mn  Y1_pystacked  D1_pystacked    -0.345    (0.677)  Z1_pystacked
   1 md  Y1_pystacked  D1_pystacked    -0.345    (1.666)  Z1_pystacked
   2 mn  Y1_pystacked  D1_pystacked    -0.004    (0.140)        Z2_reg
   2 md  Y1_pystacked  D1_pystacked    -0.004    (0.148)        Z2_reg
   3 mn  Y1_pystacked        D2_reg    -0.065    (0.077)  Z1_pystacked
   3 md  Y1_pystacked        D2_reg    -0.065    (0.110)  Z1_pystacked
   4 mn  Y1_pystacked        D2_reg    -0.162    (0.219)        Z2_reg
   4 md  Y1_pystacked        D2_reg    -0.162    (0.904)        Z2_reg
   5 mn        Y2_reg  D1_pystacked    -0.837    (1.069)  Z1_pystacked
   5 md        Y2_reg  D1_pystacked    -0.837    (1.795)  Z1_pystacked
   6 mn        Y2_reg  D1_pystacked    -0.593    (0.304)        Z2_reg
   6 md        Y2_reg  D1_pystacked    -0.593    (0.372)        Z2_reg
   7 mn        Y2_reg        D2_reg     0.531    (0.655)  Z1_pystacked
   7 md        Y2_reg        D2_reg     0.531    (0.713)  Z1_pystacked
   8 mn        Y2_reg        D2_reg     1.424    (2.048)        Z2_reg
   8 md        Y2_reg        D2_reg     1.424    (6.568)        Z2_reg
 mse mn     [min-mse]     [min-mse]    -0.345    (0.677)     [min-mse]
 mse md     [min-mse]     [min-mse]    -0.345    (1.666)     [min-mse]

Median over 2 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.3451165   1.665803    -0.21   0.836     -3.61003    2.919798
------------------------------------------------------------------------------

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.3451   -0.8085   -0.8085   -0.3451    0.1182    0.1182

. forvalues i=1/4 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

Min MSE DDML model, specification 1 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242   .1574458     0.75   0.453    -.1903639    .4268123
       _cons |   .1474464   .1030172     1.43   0.152    -.0544637    .3493565
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .0711012   .1541667     0.46   0.645    -.2310601    .3732624
       _cons |   .1447787   .1058836     1.37   0.172    -.0627494    .3523068
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0911744   .1417621    -0.64   0.520    -.3690231    .1866743
       _cons |   .0727555   .1597989     0.46   0.649    -.2404446    .3859556
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.3177164    1.25976    -0.25   0.801    -2.786801    2.151368
       _cons |     -.0962   .9591435    -0.10   0.920    -1.976087    1.783687
------------------------------------------------------------------------------


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
Cross-fitting E[y|X] equation: logpgp95
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: avexpr
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: lat_abst
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  iv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
 mse  1  Y1_pystacked  D1_pystacked     0.118    (0.157)  Z1_pystacked
 mse  2  Y1_pystacked  D1_pystacked    -0.808    (2.257)  Z1_pystacked
 mse  3  Y1_pystacked  D1_pystacked     1.936    (2.185)  Z1_pystacked
mse = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     0.415    (0.573)     [min-mse]
 mse md     [min-mse]     [min-mse]     0.118    (2.440)     [min-mse]

Median over 3 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242    2.44016     0.05   0.961    -4.664401    4.900849
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4152   -0.8085   -0.8085    0.1182    1.9359    1.9359

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242   .1574458     0.75   0.453    -.1903639    .4268123
       _cons |   .1474464   .1030172     1.43   0.152    -.0544637    .3493565
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.8084571   2.257353    -0.36   0.720    -5.232787    3.615873
       _cons |  -.2100593    .613319    -0.34   0.732    -1.412142    .9920238
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples
y-E[y|X]  = y-mn_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-mn_avexpr_mse 
Z-E[Z|X]  = Z-mn_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .415207    .572808     0.72   0.469     -.707476     1.53789
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4152   -0.8085   -0.8085    0.1182    1.9359    1.9359

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242    2.44016     0.05   0.961    -4.664401    4.900849
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4152   -0.8085   -0.8085    0.1182    1.9359    1.9359

. *** allcombos
. ddml estimate, allcombos


Model:                  iv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
*  1  1  Y1_pystacked  D1_pystacked     0.118    (0.157)  Z1_pystacked
   2  1  Y1_pystacked  D1_pystacked     0.071    (0.154)        Z2_reg
   3  1  Y1_pystacked        D2_reg    -0.091    (0.142)  Z1_pystacked
   4  1  Y1_pystacked        D2_reg    -0.318    (1.260)        Z2_reg
   5  1        Y2_reg  D1_pystacked    -1.395    (0.568)  Z1_pystacked
   6  1        Y2_reg  D1_pystacked    -0.647    (0.464)        Z2_reg
   7  1        Y2_reg        D2_reg     1.076    (0.643)  Z1_pystacked
   8  1        Y2_reg        D2_reg     2.890    (9.055)        Z2_reg
*  1  2  Y1_pystacked  D1_pystacked    -0.808    (2.257)  Z1_pystacked
   2  2  Y1_pystacked  D1_pystacked    -0.079    (0.094)        Z2_reg
   3  2  Y1_pystacked        D2_reg    -0.038    (0.052)  Z1_pystacked
   4  2  Y1_pystacked        D2_reg    -0.006    (0.007)        Z2_reg
   5  2        Y2_reg  D1_pystacked    -0.278    (2.345)  Z1_pystacked
   6  2        Y2_reg  D1_pystacked    -0.539    (0.236)        Z2_reg
   7  2        Y2_reg        D2_reg    -0.013    (0.106)  Z1_pystacked
   8  2        Y2_reg        D2_reg    -0.043    (0.016)        Z2_reg
*  1  3  Y1_pystacked  D1_pystacked     1.936    (2.185)  Z1_pystacked
   2  3  Y1_pystacked  D1_pystacked    -2.324    (3.889)        Z2_reg
   3  3  Y1_pystacked        D2_reg    -3.588   (30.033)  Z1_pystacked
   4  3  Y1_pystacked        D2_reg    -0.314    (0.254)        Z2_reg
   5  3        Y2_reg  D1_pystacked    10.715   (13.253)  Z1_pystacked
   6  3        Y2_reg  D1_pystacked   -18.056   (27.078)        Z2_reg
   7  3        Y2_reg        D2_reg   -19.860  (166.626)  Z1_pystacked
   8  3        Y2_reg        D2_reg    -2.440    (1.854)        Z2_reg
* = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
   1 mn  Y1_pystacked  D1_pystacked     0.415    (0.573)  Z1_pystacked
   1 md  Y1_pystacked  D1_pystacked     0.118    (2.440)  Z1_pystacked
   2 mn  Y1_pystacked  D1_pystacked    -0.777    (0.937)        Z2_reg
   2 md  Y1_pystacked  D1_pystacked    -0.079    (0.215)        Z2_reg
   3 mn  Y1_pystacked        D2_reg    -1.239    (1.443)  Z1_pystacked
   3 md  Y1_pystacked        D2_reg    -0.091    (0.142)  Z1_pystacked
   4 mn  Y1_pystacked        D2_reg    -0.213    (0.283)        Z2_reg
   4 md  Y1_pystacked        D2_reg    -0.314    (0.308)        Z2_reg
   5 mn        Y2_reg  D1_pystacked     3.014    (5.084)  Z1_pystacked
   5 md        Y2_reg  D1_pystacked    -0.278    (2.345)  Z1_pystacked
   6 mn        Y2_reg  D1_pystacked    -6.414    (7.074)        Z2_reg
   6 md        Y2_reg  D1_pystacked    -0.647    (0.464)        Z2_reg
   7 mn        Y2_reg        D2_reg    -6.266    (8.256)  Z1_pystacked
   7 md        Y2_reg        D2_reg    -0.013    (1.265)  Z1_pystacked
   8 mn        Y2_reg        D2_reg     0.136    (0.310)        Z2_reg
   8 md        Y2_reg        D2_reg    -0.043    (3.030)        Z2_reg
 mse mn     [min-mse]     [min-mse]     0.415    (0.573)     [min-mse]
 mse md     [min-mse]     [min-mse]     0.118    (2.440)     [min-mse]

Median over 3 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242    2.44016     0.05   0.961    -4.664401    4.900849
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4152   -0.8085   -0.8085    0.1182    1.9359    1.9359

. forvalues i=1/4 {
  2.         forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

Min MSE DDML model, specification 1 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242   .1574458     0.75   0.453    -.1903639    .4268123
       _cons |   .1474464   .1030172     1.43   0.152    -.0544637    .3493565
------------------------------------------------------------------------------


Min MSE DDML model, specification 1 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.8084571   2.257353    -0.36   0.720    -5.232787    3.615873
       _cons |  -.2100593    .613319    -0.34   0.732    -1.412142    .9920238
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .0711012   .1541667     0.46   0.645    -.2310601    .3732624
       _cons |   .1447787   .1058836     1.37   0.172    -.0627494    .3523068
------------------------------------------------------------------------------


DDML model, specification 2 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z2_reg_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0792394   .0942963    -0.84   0.401    -.2640568     .105578
       _cons |  -.0312699   .1182899    -0.26   0.792    -.2631139    .2005741
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0911744   .1417621    -0.64   0.520    -.3690231    .1866743
       _cons |   .0727555   .1597989     0.46   0.649    -.2404446    .3859556
------------------------------------------------------------------------------


DDML model, specification 3 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0380766   .0522927    -0.73   0.467    -.1405684    .0644152
       _cons |  -.1013222   .1788822    -0.57   0.571    -.4519249    .2492805
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.3177164    1.25976    -0.25   0.801    -2.786801    2.151368
       _cons |     -.0962   .9591435    -0.10   0.920    -1.976087    1.783687
------------------------------------------------------------------------------


DDML model, specification 4 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_2 
Z-E[Z|X]  = Z-Z2_reg_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0062492   .0068093    -0.92   0.359    -.0195951    .0070967
       _cons |  -.0265277   .1074197    -0.25   0.805    -.2370664     .184011
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples
y-E[y|X]  = y-mn_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-mn_avexpr_mse 
Z-E[Z|X]  = Z-mn_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |    .415207    .572808     0.72   0.469     -.707476     1.53789
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4152   -0.8085   -0.8085    0.1182    1.9359    1.9359

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1182242    2.44016     0.05   0.961    -4.664401    4.900849
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4152   -0.8085   -0.8085    0.1182    1.9359    1.9359

. 
. *** multiple learners, SS
. ddml init iv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X]: pystacked $Y $X , type(reg)
Learner Y1_pystacked added successfully.

. ddml E[Y|X]: reg $Y $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Y2_reg added successfully.

. ddml E[D|X]: pystacked $D $X , type(reg)
Learner D1_pystacked added successfully.

. ddml E[D|X]: reg $D $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner D2_reg added successfully.

. ddml E[Z|X]: pystacked $Z1 $X , type(reg)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: reg $Z1 $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Z2_reg added successfully.

. ddml crossfit, shortstack
Cross-fitting E[y|X] equation: logpgp95
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: avexpr
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: lat_abst
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate, robust


Model:                  iv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
 mse  1  Y1_pystacked  D1_pystacked     0.451    (0.183)  Z1_pystacked
  ss  1  [shortstack]          [ss]     0.489    (0.268)          [ss]
 mse  2  Y1_pystacked  D1_pystacked     0.574    (0.204)  Z1_pystacked
  ss  2  [shortstack]          [ss]    -3.245   (22.071)          [ss]
mse = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     0.512    (0.202)     [min-mse]
  ss mn  [shortstack]          [ss]    -1.378    (2.658)          [ss]
 mse md     [min-mse]     [min-mse]     0.512    (0.203)     [min-mse]
  ss md  [shortstack]          [ss]    -1.378   (15.719)          [ss]

Shortstack DDML model (median over 2 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -1.377631   15.71862    -0.09   0.930    -32.18556     29.4303
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -1.3776   -3.2445   -3.2445   -1.3776    0.4893    0.4893

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .1831949     2.46   0.014     .0916823     .809793
       _cons |  -.0539559   .1041811    -0.52   0.605     -.258147    .1502352
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ss_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_1 
Z-E[Z|X]  = Z-Z_lat_abst_ss_1 
------------------------------------------------------------------------------
             |               Robust
    logpgp95 | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4892872   .2678459     1.83   0.068    -.0356811    1.014255
       _cons |  -.0519119   .1039891    -0.50   0.618    -.2557269     .151903
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** allcombos
. ddml estimate, allcombos


Model:                  iv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
*  1  1  Y1_pystacked  D1_pystacked     0.451    (0.163)  Z1_pystacked
   2  1  Y1_pystacked  D1_pystacked     0.112    (0.174)        Z2_reg
   3  1  Y1_pystacked        D2_reg    -0.051    (0.025)  Z1_pystacked
   4  1  Y1_pystacked        D2_reg    -0.007    (0.012)        Z2_reg
   5  1        Y2_reg  D1_pystacked   -11.453    (4.258)  Z1_pystacked
   6  1        Y2_reg  D1_pystacked   -20.161    (6.375)        Z2_reg
   7  1        Y2_reg        D2_reg     1.296    (0.081)  Z1_pystacked
   8  1        Y2_reg        D2_reg     1.243    (0.042)        Z2_reg
  ss  1  [shortstack]          [ss]     0.489    (0.242)          [ss]
*  1  2  Y1_pystacked  D1_pystacked     0.574    (0.212)  Z1_pystacked
   2  2  Y1_pystacked  D1_pystacked     0.191    (0.164)        Z2_reg
   3  2  Y1_pystacked        D2_reg    -0.025    (0.010)  Z1_pystacked
   4  2  Y1_pystacked        D2_reg    -0.016    (0.016)        Z2_reg
   5  2        Y2_reg  D1_pystacked    -7.532    (3.103)  Z1_pystacked
   6  2        Y2_reg  D1_pystacked    -6.388    (2.296)        Z2_reg
   7  2        Y2_reg        D2_reg     0.332    (0.023)  Z1_pystacked
   8  2        Y2_reg        D2_reg     0.528    (0.057)        Z2_reg
  ss  2  [shortstack]          [ss]    -3.245   (17.902)          [ss]
* = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
   1 mn  Y1_pystacked  D1_pystacked     0.512    (0.194)  Z1_pystacked
   1 md  Y1_pystacked  D1_pystacked     0.512    (0.199)  Z1_pystacked
   2 mn  Y1_pystacked  D1_pystacked     0.152    (0.174)        Z2_reg
   2 md  Y1_pystacked  D1_pystacked     0.152    (0.174)        Z2_reg
   3 mn  Y1_pystacked        D2_reg    -0.038    (0.020)  Z1_pystacked
   3 md  Y1_pystacked        D2_reg    -0.038    (0.023)  Z1_pystacked
   4 mn  Y1_pystacked        D2_reg    -0.011    (0.014)        Z2_reg
   4 md  Y1_pystacked        D2_reg    -0.011    (0.015)        Z2_reg
   5 mn        Y2_reg  D1_pystacked    -9.492    (4.087)  Z1_pystacked
   5 md        Y2_reg  D1_pystacked    -9.492    (4.210)  Z1_pystacked
   6 mn        Y2_reg  D1_pystacked   -13.274    (8.120)        Z2_reg
   6 md        Y2_reg  D1_pystacked   -13.274    (8.389)        Z2_reg
   7 mn        Y2_reg        D2_reg     0.814    (0.486)  Z1_pystacked
   7 md        Y2_reg        D2_reg     0.814    (0.486)  Z1_pystacked
   8 mn        Y2_reg        D2_reg     0.885    (0.361)        Z2_reg
   8 md        Y2_reg        D2_reg     0.885    (0.361)        Z2_reg
 mse mn     [min-mse]     [min-mse]     0.512    (0.194)     [min-mse]
  ss mn  [shortstack]          [ss]    -1.378    (2.648)          [ss]
 mse md     [min-mse]     [min-mse]     0.512    (0.199)     [min-mse]
  ss md  [shortstack]          [ss]    -1.378   (12.797)          [ss]

Shortstack DDML model (median over 2 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -1.377631   12.79665    -0.11   0.914     -26.4586    23.70334
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -1.3776   -3.2445   -3.2445   -1.3776    0.4893    0.4893

. forvalues i=1/4 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

Min MSE DDML model, specification 1 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .1634692     2.76   0.006      .130344    .7711313
       _cons |  -.0539559    .102096    -0.53   0.597    -.2540603    .1461485
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1123314   .1741892     0.64   0.519    -.2290732    .4537359
       _cons |  -.0330037   .1065723    -0.31   0.757    -.2418815    .1758741
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0510024   .0253691    -2.01   0.044    -.1007249     -.00128
       _cons |  -.1321553   .1489977    -0.89   0.375    -.4241854    .1598747
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0069247   .0116313    -0.60   0.552    -.0297216    .0158721
       _cons |  -.0404551   .1173669    -0.34   0.730      -.27049    .1895798
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ss_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_1 
Z-E[Z|X]  = Z-Z_lat_abst_ss_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4892872   .2423957     2.02   0.044     .0142003     .964374
       _cons |  -.0519119   .1042676    -0.50   0.619    -.2562727    .1524488
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack
Cross-fitting E[y|X] equation: logpgp95
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: avexpr
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: lat_abst
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  iv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
 mse  1  Y1_pystacked  D1_pystacked     0.451    (0.163)  Z1_pystacked
  ss  1  [shortstack]          [ss]     0.489    (0.242)          [ss]
 mse  2  Y1_pystacked  D1_pystacked     0.574    (0.212)  Z1_pystacked
  ss  2  [shortstack]          [ss]    -3.245   (17.902)          [ss]
 mse  3  Y1_pystacked  D1_pystacked     0.440    (0.302)  Z1_pystacked
  ss  3  [shortstack]          [ss]     0.440    (0.302)          [ss]
mse = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     0.488    (0.214)     [min-mse]
  ss mn  [shortstack]          [ss]    -0.772    (1.549)          [ss]
 mse md     [min-mse]     [min-mse]     0.451    (0.245)     [min-mse]
  ss md  [shortstack]          [ss]     0.440    (0.302)          [ss]

Shortstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4395253   .3022015     1.45   0.146    -.1527788    1.031829
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.7719   -3.2445   -3.2445    0.4395    0.4893    0.4893

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .1634692     2.76   0.006      .130344    .7711313
       _cons |  -.0539559    .102096    -0.53   0.597    -.2540603    .1461485
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .5737179   .2118459     2.71   0.007     .1585075    .9889283
       _cons |  -.0700025   .0955015    -0.73   0.464    -.2571819     .117177
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples
y-E[y|X]  = y-mn_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-mn_avexpr_mse 
Z-E[Z|X]  = Z-mn_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4879936   .2141821     2.28   0.023     .0682045    .9077827
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4880    0.4395    0.4395    0.4507    0.5737    0.5737

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .2449547     1.84   0.066    -.0293648    .9308401
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4880    0.4395    0.4395    0.4507    0.5737    0.5737

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ss_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_1 
Z-E[Z|X]  = Z-Z_lat_abst_ss_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4892872   .2423957     2.02   0.044     .0142003     .964374
       _cons |  -.0519119   .1042676    -0.50   0.619    -.2562727    .1524488
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2)
y-E[y|X]  = y-Y_logpgp95_ss_2                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_2 
Z-E[Z|X]  = Z-Z_lat_abst_ss_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -3.244549   17.90192    -0.18   0.856    -38.33167    31.84258
       _cons |  -.4831065   2.096404    -0.23   0.818    -4.591983     3.62577
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.7719123   1.548682    -0.50   0.618    -3.807273    2.263449
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.7719   -3.2445   -3.2445    0.4395    0.4893    0.4893

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4395253   .3022015     1.45   0.146    -.1527788    1.031829
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.7719   -3.2445   -3.2445    0.4395    0.4893    0.4893

. *** allcombos
. ddml estimate, allcombos


Model:                  iv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): logpgp95
 logpgp95 learners:     Y1_pystacked Y2_reg
D equations (1):        avexpr
 avexpr learners:       D1_pystacked D2_reg
Z equations (1):        lat_abst
 lat_abst learners:     Z1_pystacked Z2_reg

DDML estimation results:
spec  r     Y learner     D learner         b        SE      Z learner
*  1  1  Y1_pystacked  D1_pystacked     0.451    (0.163)  Z1_pystacked
   2  1  Y1_pystacked  D1_pystacked     0.112    (0.174)        Z2_reg
   3  1  Y1_pystacked        D2_reg    -0.051    (0.025)  Z1_pystacked
   4  1  Y1_pystacked        D2_reg    -0.007    (0.012)        Z2_reg
   5  1        Y2_reg  D1_pystacked   -11.453    (4.258)  Z1_pystacked
   6  1        Y2_reg  D1_pystacked   -20.161    (6.375)        Z2_reg
   7  1        Y2_reg        D2_reg     1.296    (0.081)  Z1_pystacked
   8  1        Y2_reg        D2_reg     1.243    (0.042)        Z2_reg
  ss  1  [shortstack]          [ss]     0.489    (0.242)          [ss]
*  1  2  Y1_pystacked  D1_pystacked     0.574    (0.212)  Z1_pystacked
   2  2  Y1_pystacked  D1_pystacked     0.191    (0.164)        Z2_reg
   3  2  Y1_pystacked        D2_reg    -0.025    (0.010)  Z1_pystacked
   4  2  Y1_pystacked        D2_reg    -0.016    (0.016)        Z2_reg
   5  2        Y2_reg  D1_pystacked    -7.532    (3.103)  Z1_pystacked
   6  2        Y2_reg  D1_pystacked    -6.388    (2.296)        Z2_reg
   7  2        Y2_reg        D2_reg     0.332    (0.023)  Z1_pystacked
   8  2        Y2_reg        D2_reg     0.528    (0.057)        Z2_reg
  ss  2  [shortstack]          [ss]    -3.245   (17.902)          [ss]
*  1  3  Y1_pystacked  D1_pystacked     0.440    (0.302)  Z1_pystacked
   2  3  Y1_pystacked  D1_pystacked    -0.106    (0.502)        Z2_reg
   3  3  Y1_pystacked        D2_reg    -0.212    (0.521)  Z1_pystacked
   4  3  Y1_pystacked        D2_reg    -0.003    (0.013)        Z2_reg
   5  3        Y2_reg  D1_pystacked    -1.197    (3.131)  Z1_pystacked
   6  3        Y2_reg  D1_pystacked    18.883   (17.130)        Z2_reg
   7  3        Y2_reg        D2_reg     0.576    (0.325)  Z1_pystacked
   8  3        Y2_reg        D2_reg     0.566    (0.026)        Z2_reg
  ss  3  [shortstack]          [ss]     0.440    (0.302)          [ss]
* = minimum MSE specification for that resample.

Mean/med    Y learner     D learner         b        SE      Z learner
   1 mn  Y1_pystacked  D1_pystacked     0.488    (0.214)  Z1_pystacked
   1 md  Y1_pystacked  D1_pystacked     0.451    (0.245)  Z1_pystacked
   2 mn  Y1_pystacked  D1_pystacked     0.066    (0.228)        Z2_reg
   2 md  Y1_pystacked  D1_pystacked     0.112    (0.182)        Z2_reg
   3 mn  Y1_pystacked        D2_reg    -0.096    (0.072)  Z1_pystacked
   3 md  Y1_pystacked        D2_reg    -0.051    (0.028)  Z1_pystacked
   4 mn  Y1_pystacked        D2_reg    -0.009    (0.014)        Z2_reg
   4 md  Y1_pystacked        D2_reg    -0.007    (0.014)        Z2_reg
   5 mn        Y2_reg  D1_pystacked    -6.727    (4.520)  Z1_pystacked
   5 md        Y2_reg  D1_pystacked    -7.532    (5.789)  Z1_pystacked
   6 mn        Y2_reg  D1_pystacked    -2.555    (7.434)        Z2_reg
   6 md        Y2_reg  D1_pystacked    -6.388   (15.176)        Z2_reg
   7 mn        Y2_reg        D2_reg     0.735    (0.421)  Z1_pystacked
   7 md        Y2_reg        D2_reg     0.576    (0.325)  Z1_pystacked
   8 mn        Y2_reg        D2_reg     0.779    (0.269)        Z2_reg
   8 md        Y2_reg        D2_reg     0.566    (0.068)        Z2_reg
 mse mn     [min-mse]     [min-mse]     0.488    (0.214)     [min-mse]
  ss mn  [shortstack]          [ss]    -0.772    (1.549)          [ss]
 mse md     [min-mse]     [min-mse]     0.451    (0.245)     [min-mse]
  ss md  [shortstack]          [ss]     0.440    (0.302)          [ss]

Shortstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4395253   .3022015     1.45   0.146    -.1527788    1.031829
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.7719   -3.2445   -3.2445    0.4395    0.4893    0.4893

. forvalues i=1/4 {
  2.     forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

Min MSE DDML model, specification 1 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .1634692     2.76   0.006      .130344    .7711313
       _cons |  -.0539559    .102096    -0.53   0.597    -.2540603    .1461485
------------------------------------------------------------------------------


Min MSE DDML model, specification 1 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .5737179   .2118459     2.71   0.007     .1585075    .9889283
       _cons |  -.0700025   .0955015    -0.73   0.464    -.2571819     .117177
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1123314   .1741892     0.64   0.519    -.2290732    .4537359
       _cons |  -.0330037   .1065723    -0.31   0.757    -.2418815    .1758741
------------------------------------------------------------------------------


DDML model, specification 2 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z2_reg_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .1913713   .1643428     1.16   0.244    -.1307347    .5134772
       _cons |   -.076061   .0861383    -0.88   0.377     -.244889     .092767
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0510024   .0253691    -2.01   0.044    -.1007249     -.00128
       _cons |  -.1321553   .1489977    -0.89   0.375    -.4241854    .1598747
------------------------------------------------------------------------------


DDML model, specification 3 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0252674   .0099972    -2.53   0.011    -.0448616   -.0056732
       _cons |  -.1501613   .1060631    -1.42   0.157    -.3580412    .0577186
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_1 
Z-E[Z|X]  = Z-Z2_reg_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0069247   .0116313    -0.60   0.552    -.0297216    .0158721
       _cons |  -.0404551   .1173669    -0.34   0.730      -.27049    .1895798
------------------------------------------------------------------------------


DDML model, specification 4 (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D2_reg_2 
Z-E[Z|X]  = Z-Z2_reg_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.0158175   .0158756    -1.00   0.319    -.0469331    .0152981
       _cons |  -.1235824   .1100893    -1.12   0.262    -.3393534    .0921886
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1)
y-E[y|X]  = y-Y1_pystacked_1                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_1 
Z-E[Z|X]  = Z-Z1_pystacked_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .1634692     2.76   0.006      .130344    .7711313
       _cons |  -.0539559    .102096    -0.53   0.597    -.2540603    .1461485
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2)
y-E[y|X]  = y-Y1_pystacked_2                       Number of obs   =        64
D-E[D|X]  = D-D1_pystacked_2 
Z-E[Z|X]  = Z-Z1_pystacked_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .5737179   .2118459     2.71   0.007     .1585075    .9889283
       _cons |  -.0700025   .0955015    -0.73   0.464    -.2571819     .117177
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples
y-E[y|X]  = y-mn_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-mn_avexpr_mse 
Z-E[Z|X]  = Z-mn_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4879936   .2141821     2.28   0.023     .0682045    .9077827
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4880    0.4395    0.4395    0.4507    0.5737    0.5737

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples
y-E[y|X]  = y-md_logpgp95_mse                      Number of obs   =        64
D-E[D|X]  = D-md_avexpr_mse 
Z-E[Z|X]  = Z-md_lat_abst_mse 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4507377   .2449547     1.84   0.066    -.0293648    .9308401
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr      0.4880    0.4395    0.4395    0.4507    0.5737    0.5737

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1)
y-E[y|X]  = y-Y_logpgp95_ss_1                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_1 
Z-E[Z|X]  = Z-Z_lat_abst_ss_1 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4892872   .2423957     2.02   0.044     .0142003     .964374
       _cons |  -.0519119   .1042676    -0.50   0.619    -.2562727    .1524488
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2)
y-E[y|X]  = y-Y_logpgp95_ss_2                      Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss_2 
Z-E[Z|X]  = Z-Z_lat_abst_ss_2 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -3.244549   17.90192    -0.18   0.856    -38.33167    31.84258
       _cons |  -.4831065   2.096404    -0.23   0.818    -4.591983     3.62577
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |  -.7719123   1.548682    -0.50   0.618    -3.807273    2.263449
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.7719   -3.2445   -3.2445    0.4395    0.4893    0.4893

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples)
y-E[y|X]  = y-Y_logpgp95_ss                        Number of obs   =        64
D-E[D|X]  = D-D_avexpr_ss 
Z-E[Z|X]  = Z-Z_lat_abst_ss 
------------------------------------------------------------------------------
    logpgp95 | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
      avexpr |   .4395253   .3022015     1.45   0.146    -.1527788    1.031829
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
      avexpr     -0.7719   -3.2445   -3.2445    0.4395    0.4893    0.4893

. 
. log close
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/cert/ddml_cert_partial_iv.log
  log type:  text
 closed on:  30 Aug 2024, 17:35:21
---------------------------------------------------------------------------------------------------------------
