---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/cert/ddml_cert_interactive.log
  log type:  text
 opened on:  30 Aug 2024, 17:24:22

. 
. which ddml, all

/Users/kahrens/MyProjects/ddml/ddml.ado
*! ddml v1.4.4
*! last edited: 30aug2024
*! authors: aa/ms

. mata: whichddml()
  
  Mata library for ddml and related programs,
  compiled 29 Aug 2024 under Stata 15.1 born 03 Feb 2020.
  authors AA/MS

. which pystacked, all

/Users/kahrens/Library/Application Support/Stata/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

/Users/kahrens/MyProjects/pystacked/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. webuse cattaneo2, clear
(Excerpt from Cattaneo (2010) Journal of Econometrics 155: 138â€“154)

. keep in 1/1000
(3,642 observations deleted)

. 
. gen double mage_sq = mage^2

. 
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado
*! ddml v1.4.4
*! last edited: 30aug2024
*! authors: aa/ms

. 
. set seed 123

. 
. ********************************************************************************
. **** Interactive model                                                                                       
>                    ****
. ********************************************************************************
. 
. global Y bweight

. global D mbsmoke

. global X c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu)

. 
. *** pystacked, no SS
. 
. *** initialise ddml and select model; 
. ddml init interactive, kfolds(2) reps(2)

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -555.571  (328.270)
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -267.907  (102.202)

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  -411.739  (223.871)
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  -411.739  (282.473)

Median over 2 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -411.7389   282.4728    -1.46   0.145    -965.3755    141.8976
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -411.7389 -555.5708 -555.5708 -411.7389 -267.9070 -267.9070

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -555.5708   328.2703    -1.69   0.091    -1198.969     87.8272
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 44 propensity scores trimmed to lower limit .01.


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -555.571  (328.270)
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -267.907  (102.202)
  st  3  Y1_pystacked  Y1_pystacked  D1_pystacked  -129.517  (313.034)

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  -317.665  (181.594)
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  -267.907  (342.260)

Median over 3 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -267.907   342.2604    -0.78   0.434    -938.7251     402.911
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -317.6649 -555.5708 -555.5708 -267.9070 -129.5168 -129.5168

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -555.5708   328.2703    -1.69   0.091    -1198.969     87.8272
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 44 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -267.907   102.2016    -2.62   0.009    -468.2185   -67.59555
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 24 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -317.6649   181.5939    -1.75   0.080    -673.5824    38.25262
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -317.6649 -555.5708 -555.5708 -267.9070 -129.5168 -129.5168

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -267.907   342.2604    -0.78   0.434    -938.7251     402.911
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -317.6649 -555.5708 -555.5708 -267.9070 -129.5168 -129.5168

. *** ddml extract
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .88270928    .86340672    .87301573     .9117054
gradboost            2            0    .11729072    .13659328    .12698427     .0882946
      ols            1            1    .43374133    .72280313    .38978831    .18863256
gradboost            2            1    .56625867    .27719687    .61021169    .81136744

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1     .7947772    .73587424    .71757694    .93088041
gradboost            2     .2052228    .26412576    .28242306    .06911959

error - short-stacked weights for bweight not available

error - short-stacked weights for mbsmoke not available

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. ddml extract, show(pystacked)

pystacked weights for Y1_pystacked (bweight)
             learner      D=0/1   resample     fold_1     fold_2
      ols          1          0          1  .95018434   .7766291
gradboost          2          0          1  .04981566   .2233709
      ols          1          0          2          1  .74603146
gradboost          2          0          2          0  .25396854
      ols          1          0          3  .96068147  .86272934
gradboost          2          0          3  .03931853  .13727066
      ols          1          1          1          1  .44560625
gradboost          2          1          1  7.178e-11  .55439375
      ols          1          1          2  .37397931  .40559731
gradboost          2          1          2  .62602069  .59440269
      ols          1          1          3  .02530072  .35196441
gradboost          2          1          3  .97469928  .64803559

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .88270928    .86340672    .87301573     .9117054
gradboost            2            0    .11729072    .13659328    .12698427     .0882946
      ols            1            1    .43374133    .72280313    .38978831    .18863256
gradboost            2            1    .56625867    .27719687    .61021169    .81136744

pystacked MSEs for Y1_pystacked (bweight)
             learner      D=0/1   resample     fold_1     fold_2
      ols          1          0          1  386043.04  301543.96
gradboost          2          0          1  456739.17  343582.31
      ols          1          0          2  268847.47  378449.77
gradboost          2          0          2  337032.91  416632.93
      ols          1          0          3  305957.34  356366.28
gradboost          2          0          3  357014.38  407122.57
      ols          1          1          1   467233.9  568604.56
gradboost          2          1          1  657643.95  535678.42
      ols          1          1          2  471701.92  645045.76
gradboost          2          1          2  410991.15  566121.58
      ols          1          1          3  1032132.6  570210.44
gradboost          2          1          3  432143.32   498098.1

mean stacking MSEs across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
             learner      D=0/1   mean_MSE      rep_1      rep_2      rep_3
      ols          1          0  332867.98   343793.5  323648.62  331161.81
gradboost          2          0  386354.05  400160.74  376832.92  382068.47
      ols          1          1  625821.53  517919.23  558373.84  801171.51
gradboost          2          1  516779.42  596661.18  488556.36  465120.71

pystacked weights for D1_pystacked (mbsmoke)
             learner   resample     fold_1     fold_2
    logit          1          1   .5909873  .88076117
gradboost          2          1   .4090127  .11923883
    logit          1          2  .72452051  .71063338
gradboost          2          2  .27547949  .28936662
    logit          1          3  .96904241  .89271842
gradboost          2          3  .03095759  .10728158

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1     .7947772    .73587424    .71757694    .93088041
gradboost            2     .2052228    .26412576    .28242306    .06911959

pystacked MSEs for D1_pystacked (mbsmoke)
             learner   resample     fold_1     fold_2
    logit          1          1  .15785885  .14620062
gradboost          2          1  .16308376   .1641863
    logit          1          2  .13978206  .14377932
gradboost          2          2  .15275917  .15375208
    logit          1          3  .14261509  .14996611
gradboost          2          3  .16180083  .16914714

mean stacking MSEs across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
             learner   mean_MSE      rep_1      rep_2      rep_3
    logit          1  .14670034  .15202974  .14178069   .1462906
gradboost          2  .16078821  .16363503  .15325563  .16547398

. 
. *** pystacked, SS and PS
. 
. *** initialise ddml and select model; 
. ddml init interactive, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -512.550  (208.910)
  ss  1  [shortstack]          [ss]          [ss]  -481.692  (195.936)
  ps  1   [poolstack]          [ps]          [ps]  -444.563  (168.104)
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -139.977  (423.160)
  ss  2  [shortstack]          [ss]          [ss]    10.945  (378.804)
  ps  2   [poolstack]          [ps]          [ps]  -147.613  (447.928)

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  -326.264  (338.625)
  ss mn  [shortstack]          [ss]          [ss]  -235.374  (365.240)
  ps mn   [poolstack]          [ps]          [ps]  -296.088  (286.476)
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  -326.264  (382.173)
  ss md  [shortstack]          [ss]          [ss]  -235.374  (389.377)
  ps md   [poolstack]          [ps]          [ps]  -296.088  (369.451)

Shortstack DDML model (median over 2 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -235.3737   389.3772    -0.60   0.546    -998.5389    527.7915
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -235.3737 -481.6920 -481.6920 -235.3737   10.9447   10.9447

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -512.5504   208.9097    -2.45   0.014     -922.006   -103.0949
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 62 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -481.692   195.9363    -2.46   0.014    -865.7202   -97.66381
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 47 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ps0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ps1
E[D|X]       = D_mbsmoke_ps_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -444.5626    168.104    -2.64   0.008    -774.0404   -115.0847
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 54 propensity scores trimmed to lower limit .01.


. *** ddml extract
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2
      ols            1            0     .8731009    .90910227    .83709954
gradboost            2            0     .1268991    .09089773    .16290046
      ols            1            1    .65988123    .57303295     .7467295
gradboost            2            1    .34011877    .42696705     .2532705

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1    .86085645    .87704051    .84467239
gradboost            2    .13914355    .12295949    .15532761

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2
      ols            1            0    .79634881    .78964693     .8030507
gradboost            2            0    .20365119    .21035307     .1969493
      ols            1            1    .65117103    .75958576    .54275629
gradboost            2            1    .34882897    .24041424    .45724371

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1    .78343151    .78692467    .77993836
gradboost            2    .21656849    .21307533    .22006164

pool-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2
      ols            1            0    .90605162    .95484097    .85726227
gradboost            2            0    .09394838    .04515903    .14273773
      ols            1            1     .6443237    .54446253    .74418487
gradboost            2            1     .3556763    .45553747    .25581513

pool-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1    .89881285    .90292567    .89470002
gradboost            2    .10118715    .09707433    .10529998

. ddml extract, show(pystacked)

pystacked weights for Y1_pystacked (bweight)
             learner      D=0/1   resample     fold_1     fold_2
      ols          1          0          1  .81820453          1
gradboost          2          0          1  .18179547          0
      ols          1          0          2  .74673507  .92746401
gradboost          2          0          2  .25326493  .07253599
      ols          1          1          1  .82010758  .32595832
gradboost          2          1          1  .17989242  .67404168
      ols          1          1          2  .63624055  .85721846
gradboost          2          1          2  .36375945  .14278154

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2
      ols            1            0     .8731009    .90910227    .83709954
gradboost            2            0     .1268991    .09089773    .16290046
      ols            1            1    .65988123    .57303295     .7467295
gradboost            2            1    .34011877    .42696705     .2532705

pystacked MSEs for Y1_pystacked (bweight)
             learner      D=0/1   resample     fold_1     fold_2
      ols          1          0          1  315651.55  342300.34
gradboost          2          0          1  355484.03  418982.69
      ols          1          0          2  326066.93  356364.43
gradboost          2          0          2  355054.68  433107.57
      ols          1          1          1  518049.64  510832.66
gradboost          2          1          1  683247.18  382753.96
      ols          1          1          2  346023.13  490797.92
gradboost          2          1          2  381234.59  590459.36

mean stacking MSEs across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
             learner      D=0/1   mean_MSE      rep_1      rep_2
      ols          1          0  335095.81  328975.94  341215.68
gradboost          2          0  390657.24  387233.36  394081.13
      ols          1          1  466425.84  514441.15  418410.52
gradboost          2          1  509423.77  533000.57  485846.97

pystacked weights for D1_pystacked (mbsmoke)
             learner   resample     fold_1     fold_2
    logit          1          1          1  .75408103
gradboost          2          1          0  .24591897
    logit          1          2  .68934478          1
gradboost          2          2  .31065522  4.163e-17

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1    .86085645    .87704051    .84467239
gradboost            2    .13914355    .12295949    .15532761

pystacked MSEs for D1_pystacked (mbsmoke)
             learner   resample     fold_1     fold_2
    logit          1          1  .13451159  .15053511
gradboost          2          1  .15851786  .16430604
    logit          1          2  .13712837  .14393273
gradboost          2          2  .14788926  .17338099

mean stacking MSEs across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
             learner   mean_MSE      rep_1      rep_2
    logit          1  .14152695  .14252335  .14053055
gradboost          2  .16102354  .16141195  .16063512

. 
. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: bweight
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: mbsmoke
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -512.550  (208.910)
  ss  1  [shortstack]          [ss]          [ss]  -481.692  (195.936)
  ps  1   [poolstack]          [ps]          [ps]  -444.563  (168.104)
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -139.977  (423.160)
  ss  2  [shortstack]          [ss]          [ss]    10.945  (378.804)
  ps  2   [poolstack]          [ps]          [ps]  -147.613  (447.928)
  st  3  Y1_pystacked  Y1_pystacked  D1_pystacked  -466.887  (271.605)
  ss  3  [shortstack]          [ss]          [ss]  -426.577  (237.372)
  ps  3   [poolstack]          [ps]          [ps]  -410.558  (228.491)

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  -373.138  (304.998)
  ss mn  [shortstack]          [ss]          [ss]  -299.108  (306.714)
  ps mn   [poolstack]          [ps]          [ps]  -334.244  (254.787)
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  -466.887  (271.605)
  ss md  [shortstack]          [ss]          [ss]  -426.577  (237.372)
  ps md   [poolstack]          [ps]          [ps]  -410.558  (228.491)

Shortstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -426.5773   237.3721    -1.80   0.072    -891.8181    38.66344
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -299.1082 -481.6920 -481.6920 -426.5773   10.9447   10.9447

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -512.5504   208.9097    -2.45   0.014     -922.006   -103.0949
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 62 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -139.9768   423.1598    -0.33   0.741    -969.3548    689.4012
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 121 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -373.1381   304.9981    -1.22   0.221    -970.9234    224.6473
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -373.1381 -512.5504 -512.5504 -466.8870 -139.9768 -139.9768

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -466.887   271.6047    -1.72   0.086    -999.2224    65.44839
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -373.1381 -512.5504 -512.5504 -466.8870 -139.9768 -139.9768

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -481.692   195.9363    -2.46   0.014    -865.7202   -97.66381
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 47 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   10.94465   378.8042     0.03   0.977     -731.498    753.3873
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 114 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -299.1082   306.7137    -0.98   0.329    -900.2561    302.0396
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -299.1082 -481.6920 -481.6920 -426.5773   10.9447   10.9447

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -426.5773   237.3721    -1.80   0.072    -891.8181    38.66344
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -299.1082 -481.6920 -481.6920 -426.5773   10.9447   10.9447

. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ps0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ps1
E[D|X]       = D_mbsmoke_ps_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -444.5626    168.104    -2.64   0.008    -774.0404   -115.0847
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 54 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ps) rep(2) replay notable

Poolstack DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y_bweight_ps0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ps1
E[D|X]       = D_mbsmoke_ps_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -147.6127    447.928    -0.33   0.742    -1025.535    730.3101
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 117 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ps) rep(mn) replay notable

Poolstack DDML model (mean over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ps0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ps1
E[D|X]       = D_mbsmoke_ps
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -334.2444   254.7867    -1.31   0.190    -833.6171    165.1284
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -334.2444 -444.5626 -444.5626 -410.5579 -147.6127 -147.6127

. ddml estimate, mname(m0) spec(ps) rep(md) replay notable

Poolstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ps0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ps1
E[D|X]       = D_mbsmoke_ps
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -410.5579   228.4911    -1.80   0.072    -858.3922    37.27645
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -334.2444 -444.5626 -444.5626 -410.5579 -147.6127 -147.6127

. *** ddml extract
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .87873001    .90910227    .83709954    .88998823
gradboost            2            0    .12126999    .09089773    .16290046    .11001177
      ols            1            1     .7164534    .57303295     .7467295    .82959774
gradboost            2            1     .2835466    .42696705     .2532705    .17040226

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .85377674    .87704051    .84467239    .83961733
gradboost            2    .14622326    .12295949    .15532761    .16038267

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .86423254    .78964693     .8030507            1
gradboost            2            0    .13576746    .21035307     .1969493            0
      ols            1            1     .7054379    .75958576    .54275629    .81397165
gradboost            2            1     .2945621    .24041424    .45724371    .18602835

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .74481432    .78692467    .77993836    .66757993
gradboost            2    .25518568    .21307533    .22006164    .33242007

pool-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .90059529    .95484097    .85726227    .88968264
gradboost            2            0    .09940471    .04515903    .14273773    .11031736
      ols            1            1    .68740641    .54446253    .74418487    .77357183
gradboost            2            1    .31259359    .45553747    .25581513    .22642817

pool-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .87815457    .90292567    .89470002    .83683803
gradboost            2    .12184543    .09707433    .10529998    .16316197

. ddml extract, show(pystacked)

pystacked weights for Y1_pystacked (bweight)
             learner      D=0/1   resample     fold_1     fold_2
      ols          1          0          1  .81820453          1
gradboost          2          0          1  .18179547          0
      ols          1          0          2  .74673507  .92746401
gradboost          2          0          2  .25326493  .07253599
      ols          1          0          3   .8872573  .89271915
gradboost          2          0          3   .1127427  .10728085
      ols          1          1          1  .82010758  .32595832
gradboost          2          1          1  .17989242  .67404168
      ols          1          1          2  .63624055  .85721846
gradboost          2          1          2  .36375945  .14278154
      ols          1          1          3          1  .65919547
gradboost          2          1          3  6.107e-13  .34080453

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .87873001    .90910227    .83709954    .88998823
gradboost            2            0    .12126999    .09089773    .16290046    .11001177
      ols            1            1     .7164534    .57303295     .7467295    .82959774
gradboost            2            1     .2835466    .42696705     .2532705    .17040226

pystacked MSEs for Y1_pystacked (bweight)
             learner      D=0/1   resample     fold_1     fold_2
      ols          1          0          1  315651.55  342300.34
gradboost          2          0          1  355484.03  418982.69
      ols          1          0          2  326066.93  356364.43
gradboost          2          0          2  355054.68  433107.57
      ols          1          0          3  381392.99  278043.52
gradboost          2          0          3  437090.48   321696.5
      ols          1          1          1  518049.64  510832.66
gradboost          2          1          1  683247.18  382753.96
      ols          1          1          2  346023.13  490797.92
gradboost          2          1          2  381234.59  590459.36
      ols          1          1          3  351754.36   599810.5
gradboost          2          1          3  467446.71  688810.86

mean stacking MSEs across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
             learner      D=0/1   mean_MSE      rep_1      rep_2      rep_3
      ols          1          0   333303.3  328975.94  341215.68  329718.26
gradboost          2          0  386902.66  387233.36  394081.13  379393.49
      ols          1          1   469544.7  514441.15  418410.52  475782.43
gradboost          2          1  532325.44  533000.57  485846.97  578128.78

pystacked weights for D1_pystacked (mbsmoke)
             learner   resample     fold_1     fold_2
    logit          1          1          1  .75408103
gradboost          2          1          0  .24591897
    logit          1          2  .68934478          1
gradboost          2          2  .31065522  4.163e-17
    logit          1          3  .81593553  .86329912
gradboost          2          3  .18406447  .13670088

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .85377674    .87704051    .84467239    .83961733
gradboost            2    .14622326    .12295949    .15532761    .16038267

pystacked MSEs for D1_pystacked (mbsmoke)
             learner   resample     fold_1     fold_2
    logit          1          1  .13451159  .15053511
gradboost          2          1  .15851786  .16430604
    logit          1          2  .13712837  .14393273
gradboost          2          2  .14788926  .17338099
    logit          1          3  .14671258   .1418481
gradboost          2          3  .16054023  .15440891

mean stacking MSEs across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
             learner   mean_MSE      rep_1      rep_2      rep_3
    logit          1  .14244475  .14252335  .14053055  .14428034
gradboost          2  .15984055  .16141195  .16063512  .15747457

. 
. *** multiple learners, no SS
. 
. *** initialise ddml and select model; 
. ddml init interactive, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,D]: reg $Y $X
Learner Y2_reg added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X]: logit $D $X
Learner D2_logit added successfully.

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
 mse  1        Y2_reg        Y2_reg      D2_logit  -521.332  (201.344)
 mse  2        Y2_reg        Y2_reg      D2_logit   -95.353  (189.537)
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
 mse mn     [min-mse]     [min-mse]     [min-mse]  -308.342  (289.020)
 mse md     [min-mse]     [min-mse]     [min-mse]  -308.342  (289.130)

Median over 2 min-mse resamples (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -308.3423   289.1305    -1.07   0.286    -875.0275     258.343
------------------------------------------------------------------------------
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -308.3423 -521.3316 -521.3316 -308.3423  -95.3529  -95.3529

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -521.3316   201.3444    -2.59   0.010    -915.9595   -126.7038
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


. *** allcombos
. ddml estimate, allcombos


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -313.213  (190.625)
   2  1  Y1_pystacked  Y1_pystacked      D2_logit  -334.768  (159.210)
   3  1  Y1_pystacked        Y2_reg  D1_pystacked  -384.648  (128.607)
   4  1  Y1_pystacked        Y2_reg      D2_logit  -520.434  (201.385)
   5  1        Y2_reg  Y1_pystacked  D1_pystacked  -313.732  (190.901)
   6  1        Y2_reg  Y1_pystacked      D2_logit  -335.665  (159.156)
   7  1        Y2_reg        Y2_reg  D1_pystacked  -385.166  (128.720)
*  8  1        Y2_reg        Y2_reg      D2_logit  -521.332  (201.344)
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked   -57.376  (253.729)
   2  2  Y1_pystacked  Y1_pystacked      D2_logit   -16.481  (250.999)
   3  2  Y1_pystacked        Y2_reg  D1_pystacked  -101.710  (219.746)
   4  2  Y1_pystacked        Y2_reg      D2_logit   -95.037  (189.559)
   5  2        Y2_reg  Y1_pystacked  D1_pystacked   -46.104  (254.303)
   6  2        Y2_reg  Y1_pystacked      D2_logit   -16.797  (251.066)
   7  2        Y2_reg        Y2_reg  D1_pystacked   -90.438  (220.273)
*  8  2        Y2_reg        Y2_reg      D2_logit   -95.353  (189.537)
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
   1 mn Y1_pystacked0 Y1_pystacked1  D1_pystacked  -185.295  (252.538)
   1 md Y1_pystacked0 Y1_pystacked1  D1_pystacked  -185.295  (258.305)
   2 mn Y1_pystacked0 Y1_pystacked1      D2_logit  -175.624  (253.773)
   2 md Y1_pystacked0 Y1_pystacked1      D2_logit  -175.624  (263.630)
   3 mn Y1_pystacked0       Y2_reg1  D1_pystacked  -243.179  (218.223)
   3 md Y1_pystacked0       Y2_reg1  D1_pystacked  -243.179  (228.971)
   4 mn Y1_pystacked0       Y2_reg1      D2_logit  -307.735  (288.827)
   4 md Y1_pystacked0       Y2_reg1      D2_logit  -307.735  (288.937)
   5 mn       Y2_reg0 Y1_pystacked1  D1_pystacked  -179.918  (256.034)
   5 md       Y2_reg0 Y1_pystacked1  D1_pystacked  -179.918  (261.654)
   6 mn       Y2_reg0 Y1_pystacked1      D2_logit  -176.231  (253.960)
   6 md       Y2_reg0 Y1_pystacked1      D2_logit  -176.231  (263.821)
   7 mn       Y2_reg0       Y2_reg1  D1_pystacked  -237.802  (222.614)
   7 md       Y2_reg0       Y2_reg1  D1_pystacked  -237.802  (232.939)
   8 mn       Y2_reg0       Y2_reg1      D2_logit  -308.342  (289.020)
   8 md       Y2_reg0       Y2_reg1      D2_logit  -308.342  (289.130)
 mse mn     [min-mse]     [min-mse]     [min-mse]  -308.342  (289.020)
 mse md     [min-mse]     [min-mse]     [min-mse]  -308.342  (289.130)

Median over 2 min-mse specifications (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -308.3423   289.1305    -1.07   0.286    -875.0275     258.343
------------------------------------------------------------------------------
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -308.3423 -521.3316 -521.3316 -308.3423  -95.3529  -95.3529

. forvalues i=1/8 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

DDML model, specification 1 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -313.2134   190.6253    -1.64   0.100    -686.8321    60.40532
------------------------------------------------------------------------------
Warning: 15 propensity scores trimmed to lower limit .01.


DDML model, specification 2 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -334.7677   159.2096    -2.10   0.035    -646.8127   -22.72264
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


DDML model, specification 3 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -384.6477    128.607    -2.99   0.003    -636.7129   -132.5825
------------------------------------------------------------------------------
Warning: 15 propensity scores trimmed to lower limit .01.


DDML model, specification 4 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -520.434   201.3846    -2.58   0.010    -915.1405   -125.7275
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


DDML model, specification 5 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -313.7321   190.9015    -1.64   0.100    -687.8922    60.42808
------------------------------------------------------------------------------
Warning: 15 propensity scores trimmed to lower limit .01.


DDML model, specification 6 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -335.6653   159.1563    -2.11   0.035     -647.606   -23.72459
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


DDML model, specification 7 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -385.1664   128.7198    -2.99   0.003    -637.4527   -132.8801
------------------------------------------------------------------------------
Warning: 15 propensity scores trimmed to lower limit .01.


Min MSE DDML model, specification 8 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -521.3316   201.3444    -2.59   0.010    -915.9595   -126.7038
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
 mse  1        Y2_reg        Y2_reg      D2_logit  -521.332  (201.344)
 mse  2        Y2_reg        Y2_reg      D2_logit   -95.353  (189.537)
 mse  3        Y2_reg        Y2_reg      D2_logit  -209.792  (137.848)
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
 mse mn     [min-mse]     [min-mse]     [min-mse]  -275.492  (210.955)
 mse md     [min-mse]     [min-mse]     [min-mse]  -209.792  (221.406)

Median over 3 min-mse resamples (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -209.7921   221.4061    -0.95   0.343      -643.74    224.1559
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -275.4922 -521.3316 -521.3316 -209.7921  -95.3529  -95.3529

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -521.3316   201.3444    -2.59   0.010    -915.9595   -126.7038
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -95.35293   189.5372    -0.50   0.615    -466.8389    276.1331
------------------------------------------------------------------------------
Warning: 50 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples (ATE)
E[y|X,D=0]   = mn_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = mn_1_mse
E[D|X]       = mn_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -275.4922    210.955    -1.31   0.192    -688.9563    137.9719
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -275.4922 -521.3316 -521.3316 -209.7921  -95.3529  -95.3529

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -209.7921   221.4061    -0.95   0.343      -643.74    224.1559
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -275.4922 -521.3316 -521.3316 -209.7921  -95.3529  -95.3529

. *** allcombos
. ddml estimate, allcombos


Model:                  interactive, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -313.213  (190.625)
   2  1  Y1_pystacked  Y1_pystacked      D2_logit  -334.768  (159.210)
   3  1  Y1_pystacked        Y2_reg  D1_pystacked  -384.648  (128.607)
   4  1  Y1_pystacked        Y2_reg      D2_logit  -520.434  (201.385)
   5  1        Y2_reg  Y1_pystacked  D1_pystacked  -313.732  (190.901)
   6  1        Y2_reg  Y1_pystacked      D2_logit  -335.665  (159.156)
   7  1        Y2_reg        Y2_reg  D1_pystacked  -385.166  (128.720)
*  8  1        Y2_reg        Y2_reg      D2_logit  -521.332  (201.344)
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked   -57.376  (253.729)
   2  2  Y1_pystacked  Y1_pystacked      D2_logit   -16.481  (250.999)
   3  2  Y1_pystacked        Y2_reg  D1_pystacked  -101.710  (219.746)
   4  2  Y1_pystacked        Y2_reg      D2_logit   -95.037  (189.559)
   5  2        Y2_reg  Y1_pystacked  D1_pystacked   -46.104  (254.303)
   6  2        Y2_reg  Y1_pystacked      D2_logit   -16.797  (251.066)
   7  2        Y2_reg        Y2_reg  D1_pystacked   -90.438  (220.273)
*  8  2        Y2_reg        Y2_reg      D2_logit   -95.353  (189.537)
   1  3  Y1_pystacked  Y1_pystacked  D1_pystacked  -136.391  (237.828)
   2  3  Y1_pystacked  Y1_pystacked      D2_logit  -135.740  (185.339)
   3  3  Y1_pystacked        Y2_reg  D1_pystacked  -368.603  (319.957)
   4  3  Y1_pystacked        Y2_reg      D2_logit  -205.362  (137.777)
   5  3        Y2_reg  Y1_pystacked  D1_pystacked  -149.201  (237.799)
   6  3        Y2_reg  Y1_pystacked      D2_logit  -140.171  (185.413)
   7  3        Y2_reg        Y2_reg  D1_pystacked  -381.413  (320.008)
*  8  3        Y2_reg        Y2_reg      D2_logit  -209.792  (137.848)
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
   1 mn Y1_pystacked0 Y1_pystacked1  D1_pystacked  -168.993  (250.340)
   1 md Y1_pystacked0 Y1_pystacked1  D1_pystacked  -136.391  (260.008)
   2 mn Y1_pystacked0 Y1_pystacked1      D2_logit  -162.330  (226.367)
   2 md Y1_pystacked0 Y1_pystacked1      D2_logit  -135.740  (254.872)
   3 mn Y1_pystacked0       Y2_reg1  D1_pystacked  -284.987  (225.241)
   3 md Y1_pystacked0       Y2_reg1  D1_pystacked  -368.603  (319.958)
   4 mn Y1_pystacked0       Y2_reg1      D2_logit  -273.611  (211.762)
   4 md Y1_pystacked0       Y2_reg1      D2_logit  -205.362  (219.326)
   5 mn       Y2_reg0 Y1_pystacked1  D1_pystacked  -169.679  (251.187)
   5 md       Y2_reg0 Y1_pystacked1  D1_pystacked  -149.201  (252.020)
   6 mn       Y2_reg0 Y1_pystacked1      D2_logit  -164.211  (226.113)
   6 md       Y2_reg0 Y1_pystacked1      D2_logit  -140.171  (252.089)
   7 mn       Y2_reg0       Y2_reg1  D1_pystacked  -285.672  (226.869)
   7 md       Y2_reg0       Y2_reg1  D1_pystacked  -381.413  (320.008)
   8 mn       Y2_reg0       Y2_reg1      D2_logit  -275.492  (210.955)
   8 md       Y2_reg0       Y2_reg1      D2_logit  -209.792  (221.406)
 mse mn     [min-mse]     [min-mse]     [min-mse]  -275.492  (210.955)
 mse md     [min-mse]     [min-mse]     [min-mse]  -209.792  (221.406)

Median over 3 min-mse specifications (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -209.7921   221.4061    -0.95   0.343      -643.74    224.1559
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -275.4922 -521.3316 -521.3316 -209.7921  -95.3529  -95.3529

. forvalues i=1/4 {
  2.         forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

DDML model, specification 1 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -313.2134   190.6253    -1.64   0.100    -686.8321    60.40532
------------------------------------------------------------------------------
Warning: 15 propensity scores trimmed to lower limit .01.


DDML model, specification 1 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -57.37592    253.729    -0.23   0.821    -554.6756    439.9238
------------------------------------------------------------------------------
Warning: 19 propensity scores trimmed to lower limit .01.


DDML model, specification 2 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -334.7677   159.2096    -2.10   0.035    -646.8127   -22.72264
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


DDML model, specification 2 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -16.48119   250.9991    -0.07   0.948    -508.4304     475.468
------------------------------------------------------------------------------
Warning: 50 propensity scores trimmed to lower limit .01.


DDML model, specification 3 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -384.6477    128.607    -2.99   0.003    -636.7129   -132.5825
------------------------------------------------------------------------------
Warning: 15 propensity scores trimmed to lower limit .01.


DDML model, specification 3 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -101.7097   219.7462    -0.46   0.643    -532.4043     328.985
------------------------------------------------------------------------------
Warning: 19 propensity scores trimmed to lower limit .01.


DDML model, specification 4 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -520.434   201.3846    -2.58   0.010    -915.1405   -125.7275
------------------------------------------------------------------------------
Warning: 48 propensity scores trimmed to lower limit .01.


DDML model, specification 4 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -95.0368   189.5587    -0.50   0.616     -466.565    276.4914
------------------------------------------------------------------------------
Warning: 50 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse specifications (ATE)
E[y|X,D=0]   = mn_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = mn_1_mse
E[D|X]       = mn_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -275.4922    210.955    -1.31   0.192    -688.9563    137.9719
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -275.4922 -521.3316 -521.3316 -209.7921  -95.3529  -95.3529

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse specifications (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -209.7921   221.4061    -0.95   0.343      -643.74    224.1559
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -275.4922 -521.3316 -521.3316 -209.7921  -95.3529  -95.3529

. 
. *** multiple learners, SS
. 
. *** initialise ddml and select model; 
. ddml init interactive, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,D]: reg $Y $X
Learner Y2_reg added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X]: logit $D $X
Learner D2_logit added successfully.

. ddml crossfit, shortstack
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
 mse  1        Y2_reg        Y2_reg      D2_logit  -525.185  (248.647)
  ss  1  [shortstack]          [ss]          [ss]  -362.916  (152.008)
 mse  2        Y2_reg        Y2_reg      D2_logit  -160.408  (139.237)
  ss  2  [shortstack]          [ss]          [ss]  -187.074  (140.949)
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
 mse mn     [min-mse]     [min-mse]     [min-mse]  -342.797  (260.339)
  ss mn  [shortstack]          [ss]          [ss]  -274.995  (170.666)
 mse md     [min-mse]     [min-mse]     [min-mse]  -342.797  (271.793)
  ss md  [shortstack]          [ss]          [ss]  -274.995  (170.929)

Shortstack DDML model (median over 2 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -274.9952   170.9285    -1.61   0.108     -610.009    60.01846
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -274.9952 -362.9163 -362.9163 -274.9952 -187.0742 -187.0742

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -525.1852   248.6465    -2.11   0.035    -1012.524   -37.84696
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -362.9163   152.0075    -2.39   0.017    -660.8456   -64.98701
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 36 propensity scores trimmed to lower limit .01.


. *** allcombos
. ddml estimate, allcombos


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -271.286  (237.513)
   2  1  Y1_pystacked  Y1_pystacked      D2_logit  -288.903  (183.790)
   3  1  Y1_pystacked        Y2_reg  D1_pystacked  -266.166  (177.359)
   4  1  Y1_pystacked        Y2_reg      D2_logit  -521.350  (249.016)
   5  1        Y2_reg  Y1_pystacked  D1_pystacked  -279.207  (237.609)
   6  1        Y2_reg  Y1_pystacked      D2_logit  -292.738  (183.724)
   7  1        Y2_reg        Y2_reg  D1_pystacked  -274.087  (177.123)
*  8  1        Y2_reg        Y2_reg      D2_logit  -525.185  (248.647)
  ss  1  [shortstack]          [ss]          [ss]  -362.916  (152.008)
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -374.532  (289.620)
   2  2  Y1_pystacked  Y1_pystacked      D2_logit  -185.351  (168.608)
   3  2  Y1_pystacked        Y2_reg  D1_pystacked  -299.070  (295.296)
   4  2  Y1_pystacked        Y2_reg      D2_logit  -163.061  (139.001)
   5  2        Y2_reg  Y1_pystacked  D1_pystacked  -369.525  (289.668)
   6  2        Y2_reg  Y1_pystacked      D2_logit  -182.697  (168.698)
   7  2        Y2_reg        Y2_reg  D1_pystacked  -294.062  (295.447)
*  8  2        Y2_reg        Y2_reg      D2_logit  -160.408  (139.237)
  ss  2  [shortstack]          [ss]          [ss]  -187.074  (140.949)
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
   1 mn Y1_pystacked0 Y1_pystacked1  D1_pystacked  -322.909  (264.992)
   1 md Y1_pystacked0 Y1_pystacked1  D1_pystacked  -322.909  (269.835)
   2 mn Y1_pystacked0 Y1_pystacked1      D2_logit  -237.127  (183.229)
   2 md Y1_pystacked0 Y1_pystacked1      D2_logit  -237.127  (183.806)
   3 mn Y1_pystacked0       Y2_reg1  D1_pystacked  -282.618  (215.787)
   3 md Y1_pystacked0       Y2_reg1  D1_pystacked  -282.618  (244.128)
   4 mn Y1_pystacked0       Y2_reg1      D2_logit  -342.206  (257.869)
   4 md Y1_pystacked0       Y2_reg1      D2_logit  -342.206  (269.736)
   5 mn       Y2_reg0 Y1_pystacked1  D1_pystacked  -324.366  (263.845)
   5 md       Y2_reg0 Y1_pystacked1  D1_pystacked  -324.366  (268.742)
   6 mn       Y2_reg0 Y1_pystacked1      D2_logit  -237.718  (184.197)
   6 md       Y2_reg0 Y1_pystacked1      D2_logit  -237.718  (184.754)
   7 mn       Y2_reg0       Y2_reg1  D1_pystacked  -284.075  (215.123)
   7 md       Y2_reg0       Y2_reg1  D1_pystacked  -284.075  (243.784)
   8 mn       Y2_reg0       Y2_reg1      D2_logit  -342.797  (260.339)
   8 md       Y2_reg0       Y2_reg1      D2_logit  -342.797  (271.793)
 mse mn     [min-mse]     [min-mse]     [min-mse]  -342.797  (260.339)
  ss mn  [shortstack]          [ss]          [ss]  -274.995  (170.666)
 mse md     [min-mse]     [min-mse]     [min-mse]  -342.797  (271.793)
  ss md  [shortstack]          [ss]          [ss]  -274.995  (170.929)

Shortstack DDML model (median over 2 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -274.9952   170.9285    -1.61   0.108     -610.009    60.01846
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -274.9952 -362.9163 -362.9163 -274.9952 -187.0742 -187.0742

. forvalues i=1/8 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

DDML model, specification 1 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -271.2861    237.513    -1.14   0.253     -736.803    194.2308
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 2 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -288.9032   183.7902    -1.57   0.116    -649.1254    71.31889
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


DDML model, specification 3 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -266.1664   177.3592    -1.50   0.133    -613.7839    81.45118
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 4 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -521.3503   249.0157    -2.09   0.036    -1009.412   -33.28854
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


DDML model, specification 5 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -279.2069   237.6091    -1.18   0.240    -744.9122    186.4985
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 6 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -292.7382   183.7235    -1.59   0.111    -652.8297     67.3532
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


DDML model, specification 7 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -274.0871   177.1226    -1.55   0.122    -621.2411    73.06685
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


Min MSE DDML model, specification 8 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -525.1852   248.6465    -2.11   0.035    -1012.524   -37.84696
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -362.9163   152.0075    -2.39   0.017    -660.8456   -64.98701
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 36 propensity scores trimmed to lower limit .01.


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack
Cross-fitting E[y|X,D] equation: bweight
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: mbsmoke
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
 mse  1        Y2_reg        Y2_reg      D2_logit  -525.185  (248.647)
  ss  1  [shortstack]          [ss]          [ss]  -362.916  (152.008)
 mse  2        Y2_reg        Y2_reg      D2_logit  -160.408  (139.237)
  ss  2  [shortstack]          [ss]          [ss]  -187.074  (140.949)
 mse  3        Y2_reg        Y2_reg      D2_logit  -440.660  (194.606)
  ss  3  [shortstack]          [ss]          [ss]  -329.269  (131.717)
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
 mse mn     [min-mse]     [min-mse]     [min-mse]  -375.418  (242.903)
  ss mn  [shortstack]          [ss]          [ss]  -293.086  (157.148)
 mse md     [min-mse]     [min-mse]     [min-mse]  -440.660  (262.621)
  ss md  [shortstack]          [ss]          [ss]  -329.269  (155.687)

Shortstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -329.2687   155.6871    -2.11   0.034    -634.4097   -24.12764
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -293.0864 -362.9163 -362.9163 -329.2686 -187.0742 -187.0742

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -525.1852   248.6465    -2.11   0.035    -1012.524   -37.84696
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -160.4078   139.2366    -1.15   0.249    -433.3065    112.4909
------------------------------------------------------------------------------
Warning: 76 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples (ATE)
E[y|X,D=0]   = mn_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = mn_1_mse
E[D|X]       = mn_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -375.4176   242.9028    -1.55   0.122    -851.4985    100.6632
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -375.4176 -525.1852 -525.1852 -440.6599 -160.4078 -160.4078

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -440.6599   262.6207    -1.68   0.093     -955.387    74.06728
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -375.4176 -525.1852 -525.1852 -440.6599 -160.4078 -160.4078

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -362.9163   152.0075    -2.39   0.017    -660.8456   -64.98701
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 36 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -187.0742   140.9489    -1.33   0.184    -463.3289    89.18053
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 66 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -293.0864   157.1477    -1.87   0.062    -601.0903    14.91754
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -293.0864 -362.9163 -362.9163 -329.2686 -187.0742 -187.0742

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -329.2687   155.6871    -2.11   0.034    -634.4097   -24.12764
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -293.0864 -362.9163 -362.9163 -329.2686 -187.0742 -187.0742

. *** allcombos
. ddml estimate, allcombos


Model:                  interactive, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -271.286  (237.513)
   2  1  Y1_pystacked  Y1_pystacked      D2_logit  -288.903  (183.790)
   3  1  Y1_pystacked        Y2_reg  D1_pystacked  -266.166  (177.359)
   4  1  Y1_pystacked        Y2_reg      D2_logit  -521.350  (249.016)
   5  1        Y2_reg  Y1_pystacked  D1_pystacked  -279.207  (237.609)
   6  1        Y2_reg  Y1_pystacked      D2_logit  -292.738  (183.724)
   7  1        Y2_reg        Y2_reg  D1_pystacked  -274.087  (177.123)
*  8  1        Y2_reg        Y2_reg      D2_logit  -525.185  (248.647)
  ss  1  [shortstack]          [ss]          [ss]  -362.916  (152.008)
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -374.532  (289.620)
   2  2  Y1_pystacked  Y1_pystacked      D2_logit  -185.351  (168.608)
   3  2  Y1_pystacked        Y2_reg  D1_pystacked  -299.070  (295.296)
   4  2  Y1_pystacked        Y2_reg      D2_logit  -163.061  (139.001)
   5  2        Y2_reg  Y1_pystacked  D1_pystacked  -369.525  (289.668)
   6  2        Y2_reg  Y1_pystacked      D2_logit  -182.697  (168.698)
   7  2        Y2_reg        Y2_reg  D1_pystacked  -294.062  (295.447)
*  8  2        Y2_reg        Y2_reg      D2_logit  -160.408  (139.237)
  ss  2  [shortstack]          [ss]          [ss]  -187.074  (140.949)
   1  3  Y1_pystacked  Y1_pystacked  D1_pystacked  -153.955  (276.084)
   2  3  Y1_pystacked  Y1_pystacked      D2_logit  -222.506  (212.076)
   3  3  Y1_pystacked        Y2_reg  D1_pystacked  -289.840  (163.828)
   4  3  Y1_pystacked        Y2_reg      D2_logit  -446.516  (194.687)
   5  3        Y2_reg  Y1_pystacked  D1_pystacked  -134.429  (276.127)
   6  3        Y2_reg  Y1_pystacked      D2_logit  -216.650  (212.216)
   7  3        Y2_reg        Y2_reg  D1_pystacked  -270.314  (163.697)
*  8  3        Y2_reg        Y2_reg      D2_logit  -440.660  (194.606)
  ss  3  [shortstack]          [ss]          [ss]  -329.269  (131.717)
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
   1 mn Y1_pystacked0 Y1_pystacked1  D1_pystacked  -266.591  (275.817)
   1 md Y1_pystacked0 Y1_pystacked1  D1_pystacked  -271.286  (299.982)
   2 mn Y1_pystacked0 Y1_pystacked1      D2_logit  -232.253  (191.422)
   2 md Y1_pystacked0 Y1_pystacked1      D2_logit  -222.506  (195.416)
   3 mn Y1_pystacked0       Y2_reg1  D1_pystacked  -285.025  (193.524)
   3 md Y1_pystacked0       Y2_reg1  D1_pystacked  -289.840  (178.932)
   4 mn Y1_pystacked0       Y2_reg1      D2_logit  -376.976  (242.934)
   4 md Y1_pystacked0       Y2_reg1      D2_logit  -446.516  (260.017)
   5 mn       Y2_reg0 Y1_pystacked1  D1_pystacked  -261.054  (277.713)
   5 md       Y2_reg0 Y1_pystacked1  D1_pystacked  -279.207  (303.422)
   6 mn       Y2_reg0 Y1_pystacked1      D2_logit  -230.695  (192.204)
   6 md       Y2_reg0 Y1_pystacked1      D2_logit  -216.650  (198.856)
   7 mn       Y2_reg0       Y2_reg1  D1_pystacked  -279.488  (193.077)
   7 md       Y2_reg0       Y2_reg1  D1_pystacked  -274.087  (177.123)
   8 mn       Y2_reg0       Y2_reg1      D2_logit  -375.418  (242.903)
   8 md       Y2_reg0       Y2_reg1      D2_logit  -440.660  (262.621)
 mse mn     [min-mse]     [min-mse]     [min-mse]  -375.418  (242.903)
  ss mn  [shortstack]          [ss]          [ss]  -293.086  (157.148)
 mse md     [min-mse]     [min-mse]     [min-mse]  -440.660  (262.621)
  ss md  [shortstack]          [ss]          [ss]  -329.269  (155.687)

Shortstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -329.2687   155.6871    -2.11   0.034    -634.4097   -24.12764
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -293.0864 -362.9163 -362.9163 -329.2686 -187.0742 -187.0742

. forvalues i=1/8 {
  2.     forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

DDML model, specification 1 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -271.2861    237.513    -1.14   0.253     -736.803    194.2308
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 1 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -374.5322   289.6196    -1.29   0.196    -942.1763    193.1118
------------------------------------------------------------------------------
Warning: 35 propensity scores trimmed to lower limit .01.


DDML model, specification 2 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -288.9032   183.7902    -1.57   0.116    -649.1254    71.31889
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


DDML model, specification 2 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -185.3505   168.6081    -1.10   0.272    -515.8163    145.1154
------------------------------------------------------------------------------
Warning: 76 propensity scores trimmed to lower limit .01.


DDML model, specification 3 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -266.1664   177.3592    -1.50   0.133    -613.7839    81.45118
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 3 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -299.0695   295.2958    -1.01   0.311    -877.8386    279.6997
------------------------------------------------------------------------------
Warning: 35 propensity scores trimmed to lower limit .01.


DDML model, specification 4 (sample=1) (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -521.3503   249.0157    -2.09   0.036    -1009.412   -33.28854
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


DDML model, specification 4 (sample=2) (ATE)
E[y|X,D=0]   = Y1_pystacked0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -163.0613   139.0006    -1.17   0.241    -435.4974    109.3748
------------------------------------------------------------------------------
Warning: 76 propensity scores trimmed to lower limit .01.


DDML model, specification 5 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -279.2069   237.6091    -1.18   0.240    -744.9122    186.4985
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 5 (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -369.5247    289.668    -1.28   0.202    -937.2635    198.2141
------------------------------------------------------------------------------
Warning: 35 propensity scores trimmed to lower limit .01.


DDML model, specification 6 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -292.7382   183.7235    -1.59   0.111    -652.8297     67.3532
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


DDML model, specification 6 (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |   -182.697    168.698    -1.08   0.279     -513.339     147.945
------------------------------------------------------------------------------
Warning: 76 propensity scores trimmed to lower limit .01.


DDML model, specification 7 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -274.0871   177.1226    -1.55   0.122    -621.2411    73.06685
------------------------------------------------------------------------------
Warning: 33 propensity scores trimmed to lower limit .01.


DDML model, specification 7 (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -294.0619   295.4473    -1.00   0.320     -873.128    285.0041
------------------------------------------------------------------------------
Warning: 35 propensity scores trimmed to lower limit .01.


Min MSE DDML model, specification 8 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -525.1852   248.6465    -2.11   0.035    -1012.524   -37.84696
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


Min MSE DDML model, specification 8 (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -160.4078   139.2366    -1.15   0.249    -433.3065    112.4909
------------------------------------------------------------------------------
Warning: 76 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model, specification 8 (sample=1) (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -525.1852   248.6465    -2.11   0.035    -1012.524   -37.84696
------------------------------------------------------------------------------
Warning: 58 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model, specification 8 (sample=2) (ATE)
E[y|X,D=0]   = Y2_reg0_2                           Number of obs   =      1000
E[y|X,D=1]   = Y2_reg1
E[D|X]       = D2_logit_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -160.4078   139.2366    -1.15   0.249    -433.3065    112.4909
------------------------------------------------------------------------------
Warning: 76 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse specifications (ATE)
E[y|X,D=0]   = mn_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = mn_1_mse
E[D|X]       = mn_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -375.4176   242.9028    -1.55   0.122    -851.4985    100.6632
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -375.4176 -525.1852 -525.1852 -440.6599 -160.4078 -160.4078

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse specifications (ATE)
E[y|X,D=0]   = md_0_mse                            Number of obs   =      1000
E[y|X,D=1]   = md_1_mse
E[D|X]       = md_mbsmoke_mse
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -440.6599   262.6207    -1.68   0.093     -955.387    74.06728
------------------------------------------------------------------------------
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -375.4176 -525.1852 -525.1852 -440.6599 -160.4078 -160.4078

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -362.9163   152.0075    -2.39   0.017    -660.8456   -64.98701
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 36 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (ATE)
E[y|X,D=0]   = Y_bweight_ss0_2                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_2
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -187.0742   140.9489    -1.33   0.184    -463.3289    89.18053
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 66 propensity scores trimmed to lower limit .01.


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -293.0864   157.1477    -1.87   0.062    -601.0903    14.91754
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -293.0864 -362.9163 -362.9163 -329.2686 -187.0742 -187.0742

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (ATE)
E[y|X,D=0]   = Y_bweight_ss0                       Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -329.2687   155.6871    -2.11   0.034    -634.4097   -24.12764
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 3 resamples had propensity scores trimmed to lower limit .01.

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -293.0864 -362.9163 -362.9163 -329.2686 -187.0742 -187.0742

. 
. *** ddml overlap
. ddml init interactive, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -393.780  (355.378)
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  -143.808  (197.009)

Mean/med Y(0) learner  Y(1) learner     D learner         b        SE 
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  -268.794  (280.511)
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  -268.794  (313.328)

Median over 2 stacking resamples (ATE)
E[y|X,D=0]   = Y1_pystacked0                       Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -268.7942    313.328    -0.86   0.391    -882.9057    345.3174
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 2 resamples had propensity scores trimmed to lower limit .01.

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
     mbsmoke   -268.7942 -393.7805 -393.7805 -268.7942 -143.8078 -143.8078

. ddml overlap

. ddml overlap, replist(1)

. ddml overlap, pslist(D1_pystacked_L1 D1_pystacked_L2)

. ddml overlap, name(triangle, replace)                                                   ///
>         title("Propensity score: triangle kernel")

. ddml overlap, kernel(epanechnikov) name(epanechnikov, replace)  ///
>         title("Propensity score: epanechnikov kernel")

. 
. ******************************************************************************** 
. **** Restacking with ddml estimate                                                                           
>            ****
. ******************************************************************************** 
. 
. set seed 123

. ddml init interactive, kfolds(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. 
. // initial = std stack, shortstack, poolstack
. set seed 123

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -423.340  (168.617)
  ps  1   [poolstack]          [ps]          [ps]  -448.440  (189.600)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -423.3399   168.6169    -2.51   0.012     -753.823   -92.85689
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 51 propensity scores trimmed to lower limit .01.


. // save for later comparison
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1    .39219119    .39219119
gradboost            2            1    .60780881    .60780881

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .94756031    .94756031
gradboost            2    .05243969    .05243969

pool-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .87556134    .87556134
gradboost            2            0    .12443866    .12443866
      ols            1            1    .48466097    .48466097
gradboost            2            1    .51533903    .51533903

pool-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .82328011    .82328011
gradboost            2    .17671989    .17671989

. mat ssw_nnls1 = r(Y_bweight_ss)

. mat psw_nnls1 = r(Y_bweight_ps)

. mat stsw_nnls1 = r(Y1_pystacked_w_mn)

. // restack shortstack
. ddml estimate, shortstack ssfinalest(singlebest)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -323.547  (135.305)
  ps  1   [poolstack]          [ps]          [ps]  -448.440  (189.600)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -323.5471   135.3046    -2.39   0.017    -588.7392    -58.3549
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 52 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

short-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

pool-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .87556134    .87556134
gradboost            2            0    .12443866    .12443866
      ols            1            1    .48466097    .48466097
gradboost            2            1    .51533903    .51533903

pool-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .82328011    .82328011
gradboost            2    .17671989    .17671989

. mat ssw = r(Y_bweight_ss)

. assert el(ssw,1,3)==1

. assert el(ssw,2,3)==0

. assert el(ssw,3,3)==0

. assert el(ssw,4,3)==1

. mat psw = r(Y_bweight_ps)

. assert el(psw,1,3)~=1

. mat stsw = r(Y1_pystacked_w_mn)

. assert el(stsw,1,3)~=1

. // restack poolstack
. ddml estimate, poolstack psfinalest(singlebest)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -323.547  (135.305)
  ps  1   [poolstack]          [ps]          [ps]  -323.547  (135.305)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -323.5471   135.3046    -2.39   0.017    -588.7392    -58.3549
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 52 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

short-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

pool-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

pool-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

. mat psw = r(Y_bweight_ps)

. assert el(psw,1,3)==1

. assert el(psw,2,3)==0

. assert el(psw,3,3)==0

. assert el(psw,4,3)==1

. mat stsw = r(Y1_pystacked_w_mn)

. assert el(stsw,1,3)~=1

. // restack standard stack
. ddml estimate, stdstack stdfinalest(singlebest)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -555.392  (323.421)
  ss  1  [shortstack]          [ss]          [ss]  -323.547  (135.305)
  ps  1   [poolstack]          [ps]          [ps]  -323.547  (135.305)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -323.5471   135.3046    -2.39   0.017    -588.7392    -58.3549
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 52 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1           .5           .5
gradboost            2            1           .5           .5

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

short-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

short-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

pool-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

pool-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

. mat stsw = r(Y1_pystacked_w_mn)

. assert el(stsw,1,3)==1

. assert el(stsw,2,3)==0

. assert el(stsw,3,3)==0.5

. assert el(stsw,4,3)==0.5

. // all restacked to nnls1
. ddml estimate, finalest(nnls1)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -423.340  (168.617)
  ps  1   [poolstack]          [ps]          [ps]  -448.440  (189.600)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -423.3399   168.6169    -2.51   0.012     -753.823   -92.85689
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 51 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0     .8198601     .8198601
gradboost            2            0     .1801399     .1801399
      ols            1            1    .56775192    .56775192
gradboost            2            1    .43224808    .43224808

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1     .8317415     .8317415
gradboost            2     .1682585     .1682585

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1    .39219119    .39219119
gradboost            2            1    .60780881    .60780881

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .94756031    .94756031
gradboost            2    .05243969    .05243969

pool-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .87556134    .87556134
gradboost            2            0    .12443866    .12443866
      ols            1            1    .48466097    .48466097
gradboost            2            1    .51533903    .51533903

pool-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .82328011    .82328011
gradboost            2    .17671989    .17671989

. mat ssw = r(Y_bweight_ss)

. mat psw = r(Y_bweight_ps)

. mat stsw = r(Y1_pystacked_w_mn)

. assert mreldif(ssw,ssw_nnls1) < 10e-10

. assert mreldif(psw,psw_nnls1) < 10e-10

. // slight differences, possible float/double issue
. assert mreldif(stsw,stsw_nnls1) < 10e-6

. 
. // initial = std stack, shortstack, poolstack
. set seed 123

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -423.340  (168.617)
  ps  1   [poolstack]          [ps]          [ps]  -448.440  (189.600)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -423.3399   168.6169    -2.51   0.012     -753.823   -92.85689
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 51 propensity scores trimmed to lower limit .01.


. // restack shortstack + poolstack
. ddml estimate, shortstack ssfinalest(singlebest) poolstack psfinalest(singlebest)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -323.547  (135.305)
  ps  1   [poolstack]          [ps]          [ps]  -323.547  (135.305)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -323.5471   135.3046    -2.39   0.017    -588.7392    -58.3549
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 52 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

short-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

pool-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

pool-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

. mat ssw = r(Y_bweight_ss)

. assert el(ssw,1,3)==1

. assert el(ssw,2,3)==0

. assert el(ssw,3,3)==0

. assert el(ssw,4,3)==1

. mat psw = r(Y_bweight_ps)

. assert el(psw,1,3)==1

. assert el(psw,2,3)==0

. assert el(psw,3,3)==0

. assert el(psw,4,3)==1

. 
. // initial = std stack only
. set seed 123

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)

Stacking DDML model (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -511.5869   257.7504    -1.98   0.047    -1016.768   -6.405323
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 46 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

error - short-stacked weights for bweight not available

error - short-stacked weights for mbsmoke not available

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. // restack - add shortstack
. ddml estimate, shortstack


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -423.340  (168.617)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -423.3399   168.6169    -2.51   0.012     -753.823   -92.85689
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 51 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1    .39219119    .39219119
gradboost            2            1    .60780881    .60780881

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .94756031    .94756031
gradboost            2    .05243969    .05243969

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. 
. // initial = std stack only
. set seed 123

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)

Stacking DDML model (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -511.5869   257.7504    -1.98   0.047    -1016.768   -6.405323
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 46 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

error - short-stacked weights for bweight not available

error - short-stacked weights for mbsmoke not available

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. // restack - add shortstack
. ddml estimate, shortstack


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -423.340  (168.617)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -423.3399   168.6169    -2.51   0.012     -753.823   -92.85689
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 51 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1    .39219119    .39219119
gradboost            2            1    .60780881    .60780881

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .94756031    .94756031
gradboost            2    .05243969    .05243969

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. 
. // initial = std stack only
. set seed 123

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)

Stacking DDML model (ATE)
E[y|X,D=0]   = Y1_pystacked0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -511.5869   257.7504    -1.98   0.047    -1016.768   -6.405323
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 46 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

error - short-stacked weights for bweight not available

error - short-stacked weights for mbsmoke not available

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. // restack - add shortstack with singlebest
. ddml estimate, shortstack ssfinalest(singlebest)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
  ss  1  [shortstack]          [ss]          [ss]  -323.547  (135.305)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -323.5471   135.3046    -2.39   0.017    -588.7392    -58.3549
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 52 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

mean stacking weights across folds/resamples for Y1_pystacked (bweight)
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0    .81986012    .81986012
gradboost            2            0    .18013988    .18013988
      ols            1            1    .56775216    .56775216
gradboost            2            1    .43224784    .43224784

mean stacking weights across folds/resamples for D1_pystacked (mbsmoke)
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .83174139    .83174139
gradboost            2    .16825861    .16825861

short-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

short-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. mat ssw = r(Y_bweight_ss)

. assert el(ssw,1,3)==1

. assert el(ssw,2,3)==0

. assert el(ssw,3,3)==0

. assert el(ssw,4,3)==1

. 
. // initial = shortstack, no standard stack
. set seed 123

. ddml crossfit, shortstack nostdstack
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  [shortstack]          [ss]          [ss]  -423.340  (168.617)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -423.3399   168.6169    -2.51   0.012     -753.823   -92.85689
------------------------------------------------------------------------------
Stacking final estimator: nnls1
Warning: 51 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

error - standard stack weights for bweight not available

error - standard stack weights for mbsmoke not available

short-stacked weights across resamples for bweight
final stacking estimator: nnls1
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1    .39219119    .39219119
gradboost            2            1    .60780881    .60780881

short-stacked weights across resamples for mbsmoke
final stacking estimator: nnls1
               learner  mean_weight        rep_1
    logit            1    .94756031    .94756031
gradboost            2    .05243969    .05243969

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. // restack - shortstack with singlebest
. ddml estimate, shortstack ssfinalest(singlebest)


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
  ss  1  [shortstack]          [ss]          [ss]  -323.547  (135.305)

Shortstack DDML model (ATE)
E[y|X,D=0]   = Y_bweight_ss0_1                     Number of obs   =      1000
E[y|X,D=1]   = Y_bweight_ss1
E[D|X]       = D_mbsmoke_ss_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -323.5471   135.3046    -2.39   0.017    -588.7392    -58.3549
------------------------------------------------------------------------------
Stacking final estimator: singlebest
Warning: 52 propensity scores trimmed to lower limit .01.


. ddml extract, show(weights)

error - standard stack weights for bweight not available

error - standard stack weights for mbsmoke not available

short-stacked weights across resamples for bweight
final stacking estimator: singlebest
               learner        D=0/1  mean_weight        rep_1
      ols            1            0            1            1
gradboost            2            0            0            0
      ols            1            1            0            0
gradboost            2            1            1            1

short-stacked weights across resamples for mbsmoke
final stacking estimator: singlebest
               learner  mean_weight        rep_1
    logit            1            1            1
gradboost            2            0            0

error - pool-stacked weights for bweight not available

error - pool-stacked weights for mbsmoke not available

. assert el(ssw,1,3)==1

. assert el(ssw,2,3)==0

. assert el(ssw,3,3)==0

. assert el(ssw,4,3)==1

. 
. // without pystacked: not currently supported
. 
. // setup
. set seed 123

. ddml init interactive, kfolds(2) reps(1)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,D]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,D]: reg $Y $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Y2_reg added successfully.

. ddml E[D|X]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X]: logit $D $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner D2_logit added successfully.

. 
. // no shortstack
. set seed 123

. ddml crossfit
Cross-fitting E[y|X,D] equation: bweight
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X] equation: mbsmoke
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate, allcombos


Model:                  interactive, crossfit folds k=2, resamples r=1
Mata global (mname):    m0
Dependent variable (Y): bweight
 bweight learners:      Y1_pystacked Y2_reg
D equations (1):        mbsmoke
 mbsmoke learners:      D1_pystacked D2_logit

DDML estimation results (ATE):
spec  r  Y(0) learner  Y(1) learner     D learner         b        SE 
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  -511.587  (257.750)
   2  1  Y1_pystacked  Y1_pystacked      D2_logit  -549.947  (249.767)
   3  1  Y1_pystacked        Y2_reg  D1_pystacked  -578.866  (321.920)
   4  1  Y1_pystacked        Y2_reg      D2_logit  -658.406  (323.903)
   5  1        Y2_reg  Y1_pystacked  D1_pystacked  -513.107  (257.757)
*  6  1        Y2_reg  Y1_pystacked      D2_logit  -551.280  (249.752)
   7  1        Y2_reg        Y2_reg  D1_pystacked  -580.386  (321.921)
   8  1        Y2_reg        Y2_reg      D2_logit  -659.740  (323.872)
* = minimum MSE specification for that resample.

Min MSE DDML model, specification 6 (ATE)
E[y|X,D=0]   = Y2_reg0_1                           Number of obs   =      1000
E[y|X,D=1]   = Y1_pystacked1
E[D|X]       = D2_logit_1
------------------------------------------------------------------------------
             |               Robust
     bweight | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -551.2799   249.7519    -2.21   0.027    -1040.785   -61.77528
------------------------------------------------------------------------------
Warning: 45 propensity scores trimmed to lower limit .01.


. // restack - add shortstack
. cap noi ddml estimate, shortstack
error - restacking available only if pystacked is the only learner for each conditional expectation

. assert _rc==198

. 
. log close
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/cert/ddml_cert_interactive.log
  log type:  text
 closed on:  30 Aug 2024, 17:25:41
---------------------------------------------------------------------------------------------------------------
