-----------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\LocalStore\ecomes\Documents\GitHub\ddml\cert\ddml_cert_late.log
  log type:  text
 opened on:  20 Jul 2023, 12:41:59

. 
. which ddml
C:\LocalStore\ecomes\Documents\GitHub\ddml\ddml.ado
*! ddml v1.2
*! last edited: 19 july 2023
*! authors: aa/ms

. mata: whichddml()
  
  Mata library for ddml and related programs,
  compiled 19 Jul 2023 under Stata 15.1 born 26 Aug 2019.
  authors AA/MS

. 
. use "http://fmwww.bc.edu/repec/bocode/j/jtpa.dta",clear   

. keep in 1/5000
(6,204 observations deleted)

. 
. 
. which ddml
C:\LocalStore\ecomes\Documents\GitHub\ddml\ddml.ado
*! ddml v1.2
*! last edited: 19 july 2023
*! authors: aa/ms

. which pystacked
C:\LocalStore\ecomes\Documents\GitHub\pystacked\pystacked.ado
*! pystacked v0.7.2
*! last edited: 8july2023
*! authors: aa/ms

. 
. // necessary programs for cert; script exits with error if not installed
. findfile pystacked.ado
C:\LocalStore\ecomes\Documents\GitHub\pystacked/pystacked.ado

. 
. set seed 123

. 
. ********************************************************************************
. *** LATE                                                                                                             
>                            ****
. ********************************************************************************
. 
. gen lnearnings = log(earnings) 
(596 missing values generated)

. global Y lnearnings

. global D training

. global Z assignmt 

. global X sex-age4554

. 
. *** pystacked, no SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.001)  Z1_pystacked

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked

Median over 2 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0026478   .0016169    -1.64   0.102    -.0058167    .0005212
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0026   -0.0027   -0.0027   -0.0026   -0.0026   -0.0026

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0027273   .0017776    -1.53   0.125    -.0062113    .0007568
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.001)  Z1_pystacked
  st  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.000    (0.002)  Z1_pystacked

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked

Median over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0025683   .0017847    -1.44   0.150    -.0060662    .0009297
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0027   -0.0027   -0.0026   -0.0005   -0.0005

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0027273   .0017776    -1.53   0.125    -.0062113    .0007568
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0025683   .0014338    -1.79   0.073    -.0053785     .000242
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   -.001916   .0018365    -1.04   0.297    -.0055155    .0016834
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0027   -0.0027   -0.0026   -0.0005   -0.0005

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0025683   .0017847    -1.44   0.150    -.0060662    .0009297
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0027   -0.0027   -0.0026   -0.0005   -0.0005

. 
. *** pystacked, SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
  ps  1   [poolstack]          [ps]          [ps]          [ps]    -0.002    (0.002)          [ps]
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.002)  Z1_pystacked
  ss  2  [shortstack]          [ss]          [ss]          [ss]     0.000    (0.002)          [ss]
  ps  2   [poolstack]          [ps]          [ps]          [ps]     0.000    (0.002)          [ps]

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.001    (0.002)          [ss]
  ps mn   [poolstack]          [ps]          [ps]          [ps]    -0.001    (0.002)          [ps]
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.001    (0.002)          [ss]
  ps md   [poolstack]          [ps]          [ps]          [ps]    -0.001    (0.002)          [ps]

Shortstack DDML model (median over 2 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0007456   .0020239    -0.37   0.713    -.0047123    .0032212
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0007   -0.0019   -0.0019   -0.0007    0.0004    0.0004

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019335   .0015416    -1.25   0.210     -.004955    .0010879
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019283   .0015438    -1.25   0.212     -.004954    .0010974
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1_1
E[D|X,Z=0]   = D_training_ps0_1
E[D|X,Z=1]   = D_training_ps1_1
E[Z|X]       = Z_assignmt_ps_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019673   .0015392    -1.28   0.201    -.0049841    .0010495
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. 
. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack poolstack
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
  ps  1   [poolstack]          [ps]          [ps]          [ps]    -0.002    (0.002)          [ps]
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.002)  Z1_pystacked
  ss  2  [shortstack]          [ss]          [ss]          [ss]     0.000    (0.002)          [ss]
  ps  2   [poolstack]          [ps]          [ps]          [ps]     0.000    (0.002)          [ps]
  st  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.000    (0.001)  Z1_pystacked
  ss  3  [shortstack]          [ss]          [ss]          [ss]    -0.000    (0.001)          [ss]
  ps  3   [poolstack]          [ps]          [ps]          [ps]    -0.000    (0.001)          [ps]

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.001    (0.002)          [ss]
  ps mn   [poolstack]          [ps]          [ps]          [ps]    -0.001    (0.002)          [ps]
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.000    (0.002)  Z1_pystacked
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.000    (0.002)          [ss]
  ps md   [poolstack]          [ps]          [ps]          [ps]    -0.000    (0.002)          [ps]

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0002473   .0018654    -0.13   0.895    -.0039035    .0034089
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019335   .0015416    -1.25   0.210     -.004955    .0010879
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   .0003883   .0017553     0.22   0.825     -.003052    .0038286
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0005747   .0018239    -0.32   0.753    -.0041495    .0030001
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0001787   .0018446    -0.10   0.923    -.0037941    .0034366
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019283   .0015438    -1.25   0.212     -.004954    .0010974
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_2                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_2
E[D|X,Z=0]   = D_training_ss0_2
E[D|X,Z=1]   = D_training_ss1_2
E[Z|X]       = Z_assignmt_ss_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   .0004372   .0017353     0.25   0.801    -.0029639    .0038384
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0005795   .0018146    -0.32   0.749     -.004136     .002977
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0002473   .0018654    -0.13   0.895    -.0039035    .0034089
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1_1
E[D|X,Z=0]   = D_training_ps0_1
E[D|X,Z=1]   = D_training_ps1_1
E[Z|X]       = Z_assignmt_ps_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019673   .0015392    -1.28   0.201    -.0049841    .0010495
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(2) replay notable

Poolstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0_2                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1_2
E[D|X,Z=0]   = D_training_ps0_2
E[D|X,Z=1]   = D_training_ps1_2
E[Z|X]       = Z_assignmt_ps_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   .0004096   .0017495     0.23   0.815    -.0030194    .0038385
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(mn) replay notable

Poolstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0                    Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1
E[D|X,Z=0]   = D_training_ps0
E[D|X,Z=1]   = D_training_ps1
E[Z|X]       = Z_assignmt_ps
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0005964   .0018228    -0.33   0.744    -.0041689    .0029762
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0020   -0.0020   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ps) rep(md) replay notable

Poolstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0                    Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1
E[D|X,Z=0]   = D_training_ps0
E[D|X,Z=1]   = D_training_ps1
E[Z|X]       = Z_assignmt_ps
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0002314   .0018632    -0.12   0.901    -.0038832    .0034204
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0020   -0.0020   -0.0002    0.0004    0.0004

. 
. *** multiple learners, no SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,Z]: reg $Y $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Y2_reg added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X,Z]: logit $D $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner D2_logit added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: logit $Z $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Z2_logit added successfully.

. ddml crossfit
Cross-fitting E[y|X,Z] equation: lnearnings
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)  Z1_pystacked
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]

Median over 2 min-mse resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3901
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0015631   .0018333    -0.85   0.394    -.0051563    .0020301
------------------------------------------------------------------------------

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0016   -0.0022   -0.0022   -0.0016   -0.0009   -0.0009

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022399   .0017903    -1.25   0.211    -.0057488    .0012689
------------------------------------------------------------------------------


. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
*  6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.017)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.017)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.017)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.017)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.017)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.017)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.017)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.017)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.034)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.005    (0.034)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.000    (0.034)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.005    (0.034)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.000    (0.034)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.005    (0.034)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.000    (0.034)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.005    (0.034)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.001    (0.051)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.004    (0.051)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.001    (0.051)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.004    (0.051)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.001    (0.051)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.004    (0.051)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.001    (0.051)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.004    (0.051)      Z2_logit
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.001    (0.002)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.001    (0.002)      Z2_logit
*  5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)  Z1_pystacked
   8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.014    (0.017)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.014    (0.017)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.014    (0.017)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.014    (0.017)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.017)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.017)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.017)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.017)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.036)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.036)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.003    (0.036)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.036)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.003    (0.036)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.036)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.003    (0.036)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.036)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.052)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.052)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.052)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.052)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.052)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.052)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.016    (0.052)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.016    (0.052)      Z2_logit
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]

Median over 2 min-mse specifications (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3901
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0015631   .0018333    -0.85   0.394    -.0051563    .0020301
------------------------------------------------------------------------------

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0016   -0.0022   -0.0022   -0.0016   -0.0009   -0.0009

. forvalues i=1/8 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0023107   .0017961    -1.29   0.198    -.0058309    .0012096
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022402   .0017905    -1.25   0.211    -.0057496    .0012691
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   -.002309   .0017948    -1.29   0.198    -.0058267    .0012088
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022386   .0017893    -1.25   0.211    -.0057455    .0012683
------------------------------------------------------------------------------


DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0023104   .0017958    -1.29   0.198    -.0058302    .0012094
------------------------------------------------------------------------------


Min MSE DDML model, specification 6 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022399   .0017903    -1.25   0.211    -.0057488    .0012689
------------------------------------------------------------------------------


DDML model, specification 7 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0023087   .0017946    -1.29   0.198    -.0058259    .0012086
------------------------------------------------------------------------------


DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022383    .001789    -1.25   0.211    -.0057447    .0012681
------------------------------------------------------------------------------


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)  Z1_pystacked
 mse  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]

Median over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3868
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022248   .0017903    -1.24   0.214    -.0057338    .0012842
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0022   -0.0022   -0.0022   -0.0009   -0.0009

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022399   .0017903    -1.25   0.211    -.0057488    .0012689
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3806
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0008863   .0016127    -0.55   0.583    -.0040471    .0022745
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3868
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0017837   .0018345    -0.97   0.331    -.0053793     .001812
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0022   -0.0022   -0.0022   -0.0009   -0.0009

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3868
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022248   .0017903    -1.24   0.214    -.0057338    .0012842
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0022   -0.0022   -0.0022   -0.0009   -0.0009

. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
*  6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.017)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.017)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.017)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.017)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.017)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.017)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.017)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.017)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.034)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.005    (0.034)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.000    (0.034)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.005    (0.034)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.000    (0.034)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.005    (0.034)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.000    (0.034)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.005    (0.034)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.001    (0.051)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.004    (0.051)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.001    (0.051)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.004    (0.051)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.001    (0.051)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.004    (0.051)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.001    (0.051)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.004    (0.051)      Z2_logit
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.001    (0.002)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.001    (0.002)      Z2_logit
*  5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)  Z1_pystacked
   8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.014    (0.017)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.014    (0.017)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.014    (0.017)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.014    (0.017)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.017)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.017)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.017)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.017)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.036)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.036)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.003    (0.036)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.036)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.003    (0.036)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.036)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.003    (0.036)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.036)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.052)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.052)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.052)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.052)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.052)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.052)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.016    (0.052)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.016    (0.052)      Z2_logit
   1  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
*  6  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked     0.005    (0.018)  Z1_pystacked
  10  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked     0.012    (0.018)      Z2_logit
  11  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit     0.005    (0.018)  Z1_pystacked
  12  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit     0.012    (0.018)      Z2_logit
  13  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked     0.005    (0.018)  Z1_pystacked
  14  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked     0.012    (0.018)      Z2_logit
  15  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit     0.005    (0.018)  Z1_pystacked
  16  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit     0.012    (0.018)      Z2_logit
  17  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.029    (0.036)  Z1_pystacked
  18  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.041    (0.036)      Z2_logit
  19  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.029    (0.036)  Z1_pystacked
  20  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.041    (0.036)      Z2_logit
  21  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.029    (0.036)  Z1_pystacked
  22  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.041    (0.036)      Z2_logit
  23  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.029    (0.036)  Z1_pystacked
  24  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.041    (0.036)      Z2_logit
  25  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.037    (0.052)  Z1_pystacked
  26  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.055    (0.053)      Z2_logit
  27  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.037    (0.052)  Z1_pystacked
  28  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.055    (0.053)      Z2_logit
  29  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.037    (0.052)  Z1_pystacked
  30  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.055    (0.053)      Z2_logit
  31  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.037    (0.052)  Z1_pystacked
  32  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.055    (0.053)      Z2_logit
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]

Median over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3868
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022248   .0017903    -1.24   0.214    -.0057338    .0012842
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0022   -0.0022   -0.0022   -0.0009   -0.0009

. forvalues i=1/4 {
  2.         forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0023107   .0017961    -1.29   0.198    -.0058309    .0012096
------------------------------------------------------------------------------


DDML model, specification 1 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3806
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   -.000886   .0016122    -0.55   0.583    -.0040458    .0022738
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022402   .0017905    -1.25   0.211    -.0057496    .0012691
------------------------------------------------------------------------------


DDML model, specification 2 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3806
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0008838   .0016124    -0.55   0.584    -.0040439    .0022764
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   -.002309   .0017948    -1.29   0.198    -.0058267    .0012088
------------------------------------------------------------------------------


DDML model, specification 3 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3806
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0008859   .0016121    -0.55   0.583    -.0040455    .0022737
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022386   .0017893    -1.25   0.211    -.0057455    .0012683
------------------------------------------------------------------------------


DDML model, specification 4 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3806
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0008837   .0016122    -0.55   0.584    -.0040436    .0022762
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3868
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0017837   .0018345    -0.97   0.331    -.0053793     .001812
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0022   -0.0022   -0.0022   -0.0009   -0.0009

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3868
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z2_logit
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0022248   .0017903    -1.24   0.214    -.0057338    .0012842
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0022   -0.0022   -0.0022   -0.0009   -0.0009

. 
. *** multiple learners, SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,Z]: reg $Y $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Y2_reg added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X,Z]: logit $D $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner D2_logit added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: logit $Z $X
Note: previously-added pystacked multilearner now treated as a single learner
Learner Z2_logit added successfully.

. ddml crossfit, shortstack
Cross-fitting E[y|X,Z] equation: lnearnings
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X,Z] equation: training
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: assignmt
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]

Shortstack DDML model (median over 2 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3578
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019975    .001714    -1.17   0.244    -.0053569    .0013619
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0020   -0.0021   -0.0021   -0.0020   -0.0019   -0.0019

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0017546    -1.05   0.292     -.005289     .001589
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      3792
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0017587    -1.05   0.292    -.0052986    .0015955
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
*  5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.002    (0.018)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.018)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.002    (0.018)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.018)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.002    (0.018)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.018)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.002    (0.018)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.018)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.014    (0.036)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.014    (0.036)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.014    (0.036)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.014    (0.036)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.014    (0.036)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.014    (0.036)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.014    (0.036)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.014    (0.036)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.013    (0.053)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.012    (0.052)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.013    (0.052)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.012    (0.052)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.013    (0.052)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.012    (0.052)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.013    (0.052)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.012    (0.052)      Z2_logit
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
*  5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.019)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.019)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.019)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.019)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.018)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.018)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.016    (0.018)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.016    (0.018)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.012    (0.038)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.012    (0.038)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.012    (0.038)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.012    (0.038)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.012    (0.038)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.012    (0.038)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.012    (0.038)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.012    (0.038)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.026    (0.055)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.026    (0.055)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.026    (0.055)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.026    (0.055)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.026    (0.055)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.026    (0.055)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.026    (0.055)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.026    (0.055)      Z2_logit
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]

Shortstack DDML model (median over 2 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3578
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0019975    .001714    -1.17   0.244    -.0053569    .0013619
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0020   -0.0021   -0.0021   -0.0020   -0.0019   -0.0019

. forvalues i=1/8 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018505   .0017551    -1.05   0.292    -.0052903    .0015894
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018831   .0017536    -1.07   0.283    -.0053201     .001554
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018491   .0017537    -1.05   0.292    -.0052863    .0015881
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018817   .0017523    -1.07   0.283    -.0053162    .0015528
------------------------------------------------------------------------------


Min MSE DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0017546    -1.05   0.292     -.005289     .001589
------------------------------------------------------------------------------


DDML model, specification 6 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018826   .0017532    -1.07   0.283    -.0053188    .0015536
------------------------------------------------------------------------------


DDML model, specification 7 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018486   .0017533    -1.05   0.292     -.005285    .0015877
------------------------------------------------------------------------------


DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018812   .0017519    -1.07   0.283    -.0053148    .0015524
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      3792
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0017587    -1.05   0.292    -.0052986    .0015955
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  3  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3648
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0016808    -1.10   0.271    -.0051459    .0014428
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0017546    -1.05   0.292     -.005289     .001589
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021492   .0016555    -1.30   0.194    -.0053938    .0010955
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3648
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018904   .0016651    -1.14   0.256    -.0051539    .0013731
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3648
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0016823    -1.10   0.271    -.0051472    .0014472
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      3792
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0017587    -1.05   0.292    -.0052986    .0015955
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_2                  Number of obs   =      3363
E[y|X,Z=1]   = Y_lnearnings_ss1_2
E[D|X,Z=0]   = D_training_ss0_2
E[D|X,Z=1]   = D_training_ss1_2
E[Z|X]       = Z_assignmt_ss_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021435   .0016553    -1.29   0.195    -.0053877    .0011007
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3648
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018858   .0016709    -1.13   0.259    -.0051606    .0013891
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3648
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0016808    -1.10   0.271    -.0051459    .0014428
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
*  5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.002    (0.018)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.018)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.002    (0.018)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.018)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.002    (0.018)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.018)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.002    (0.018)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.018)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.014    (0.036)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.014    (0.036)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.014    (0.036)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.014    (0.036)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.014    (0.036)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.014    (0.036)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.014    (0.036)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.014    (0.036)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.013    (0.053)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.012    (0.052)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.013    (0.052)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.012    (0.052)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.013    (0.052)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.012    (0.052)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.013    (0.052)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.012    (0.052)      Z2_logit
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
*  5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.019)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.019)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.019)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.019)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.018)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.018)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.016    (0.018)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.016    (0.018)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.012    (0.038)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.012    (0.038)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.012    (0.038)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.012    (0.038)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.012    (0.038)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.012    (0.038)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.012    (0.038)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.012    (0.038)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.026    (0.055)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.026    (0.055)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.026    (0.055)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.026    (0.055)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.026    (0.055)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.026    (0.055)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.026    (0.055)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.026    (0.055)      Z2_logit
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
   1  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
*  5  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked     0.001    (0.018)  Z1_pystacked
  10  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked     0.001    (0.018)      Z2_logit
  11  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit     0.001    (0.018)  Z1_pystacked
  12  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit     0.001    (0.018)      Z2_logit
  13  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked     0.001    (0.018)  Z1_pystacked
  14  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked     0.001    (0.018)      Z2_logit
  15  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit     0.001    (0.018)  Z1_pystacked
  16  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit     0.001    (0.018)      Z2_logit
  17  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.001    (0.035)  Z1_pystacked
  18  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.002    (0.035)      Z2_logit
  19  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.001    (0.035)  Z1_pystacked
  20  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.002    (0.035)      Z2_logit
  21  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.001    (0.035)  Z1_pystacked
  22  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.002    (0.035)      Z2_logit
  23  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.001    (0.035)  Z1_pystacked
  24  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.002    (0.035)      Z2_logit
  25  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.003    (0.052)  Z1_pystacked
  26  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.005    (0.052)      Z2_logit
  27  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.003    (0.052)  Z1_pystacked
  28  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.005    (0.052)      Z2_logit
  29  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.003    (0.052)  Z1_pystacked
  30  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.005    (0.052)      Z2_logit
  31  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.003    (0.052)  Z1_pystacked
  32  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.005    (0.052)      Z2_logit
  ss  3  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)         [mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3648
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0016808    -1.10   0.271    -.0051459    .0014428
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. forvalues i=1/8 {
  2.     forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018505   .0017551    -1.05   0.292    -.0052903    .0015894
------------------------------------------------------------------------------


DDML model, specification 1 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021514   .0016571    -1.30   0.194    -.0053993    .0010965
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018831   .0017536    -1.07   0.283    -.0053201     .001554
------------------------------------------------------------------------------


DDML model, specification 2 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021013   .0016505    -1.27   0.203    -.0053362    .0011337
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018491   .0017537    -1.05   0.292    -.0052863    .0015881
------------------------------------------------------------------------------


DDML model, specification 3 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021521   .0016577    -1.30   0.194    -.0054012     .001097
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018817   .0017523    -1.07   0.283    -.0053162    .0015528
------------------------------------------------------------------------------


DDML model, specification 4 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021021   .0016512    -1.27   0.203    -.0053385    .0011343
------------------------------------------------------------------------------


Min MSE DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0017546    -1.05   0.292     -.005289     .001589
------------------------------------------------------------------------------


Min MSE DDML model, specification 5 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021492   .0016555    -1.30   0.194    -.0053938    .0010955
------------------------------------------------------------------------------


DDML model, specification 6 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018826   .0017532    -1.07   0.283    -.0053188    .0015536
------------------------------------------------------------------------------


DDML model, specification 6 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0020993    .001649    -1.27   0.203    -.0053314    .0011327
------------------------------------------------------------------------------


DDML model, specification 7 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018486   .0017533    -1.05   0.292     -.005285    .0015877
------------------------------------------------------------------------------


DDML model, specification 7 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021499   .0016561    -1.30   0.194    -.0053958     .001096
------------------------------------------------------------------------------


DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018812   .0017519    -1.07   0.283    -.0053148    .0015524
------------------------------------------------------------------------------


DDML model, specification 8 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021002   .0016498    -1.27   0.203    -.0053336    .0011333
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0017546    -1.05   0.292     -.005289     .001589
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model, specification 5 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021492   .0016555    -1.30   0.194    -.0053938    .0010955
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3648
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018904   .0016651    -1.14   0.256    -.0051539    .0013731
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      3648
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D2_logit0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |    -.00185   .0016823    -1.10   0.271    -.0051472    .0014472
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      3792
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0017587    -1.05   0.292    -.0052986    .0015955
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_2                  Number of obs   =      3363
E[y|X,Z=1]   = Y_lnearnings_ss1_2
E[D|X,Z=0]   = D_training_ss0_2
E[D|X,Z=1]   = D_training_ss1_2
E[Z|X]       = Z_assignmt_ss_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0021435   .0016553    -1.29   0.195    -.0053877    .0011007
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3648
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018858   .0016709    -1.13   0.259    -.0051606    .0013891
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      3648
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0018516   .0016808    -1.10   0.271    -.0051459    .0014428
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0021   -0.0021   -0.0019   -0.0017   -0.0017

. 
. *** ddml overlap
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml crossfit
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.001)  Z1_pystacked
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked

Median over 2 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |  -.0020523   .0019154    -1.07   0.284    -.0058064    .0017019
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0021   -0.0032   -0.0032   -0.0021   -0.0009   -0.0009

. ddml overlap

. ddml overlap, replist(1)

. ddml overlap, pslist(Z1_pystacked_L1 Z1_pystacked_L2)

. ddml overlap, name(triangle, replace)                                                   ///
>         title("Propensity score: triangle kernel")

. ddml overlap, kernel(epanechnikov) name(epanechnikov, replace)  ///
>         title("Propensity score: epanechnikov kernel")

. 
. log close
      name:  <unnamed>
       log:  C:\LocalStore\ecomes\Documents\GitHub\ddml\cert\ddml_cert_late.log
  log type:  text
 closed on:  20 Jul 2023, 12:47:14
-----------------------------------------------------------------------------------------------------------------------
