---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/cert/ddml_cert_interactiveiv.log
  log type:  text
 opened on:  30 Aug 2024, 17:25:41

. 
. which ddml, all

/Users/kahrens/MyProjects/ddml/ddml.ado
*! ddml v1.4.4
*! last edited: 30aug2024
*! authors: aa/ms

. mata: whichddml()
  
  Mata library for ddml and related programs,
  compiled 29 Aug 2024 under Stata 15.1 born 03 Feb 2020.
  authors AA/MS

. which pystacked, all

/Users/kahrens/Library/Application Support/Stata/ado/plus/p/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

/Users/kahrens/MyProjects/pystacked/pystacked.ado
*! pystacked v0.7.5
*! last edited: 7aug2023
*! authors: aa/ms

. 
. use "http://fmwww.bc.edu/repec/bocode/j/jtpa.dta",clear   

. keep in 1/5000
(6,204 observations deleted)

. 
. set seed 123

. 
. ********************************************************************************
. *** interactiveiv                                                                                            
>                            ****
. ********************************************************************************
. 
. gen lnearnings = log(earnings) 
(596 missing values generated)

. global Y lnearnings

. global D training

. global Z assignmt 

. global X sex-age4554

. 
. *** pystacked, no SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml crossfit
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.001)  Z1_pystacked

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked

Median over 2 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0026479   .0016168    -1.64   0.101    -.0058169    .0005211
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0026   -0.0027   -0.0027   -0.0026   -0.0026   -0.0026

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0027276   .0017776    -1.53   0.125    -.0062116    .0007565
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.001)  Z1_pystacked
  st  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.000    (0.002)  Z1_pystacked

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.002)  Z1_pystacked

Median over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0025682   .0017847    -1.44   0.150    -.0060662    .0009298
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0027   -0.0027   -0.0026   -0.0005   -0.0005

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0027276   .0017776    -1.53   0.125    -.0062116    .0007565
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0025682   .0014338    -1.79   0.073    -.0053785     .000242
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019163   .0018364    -1.04   0.297    -.0055155     .001683
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0027   -0.0027   -0.0026   -0.0005   -0.0005

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0025682   .0017847    -1.44   0.150    -.0060662    .0009298
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0019   -0.0027   -0.0027   -0.0026   -0.0005   -0.0005

. *** ddml extract
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .90642253    .86425043    .99207009    .86294706
gradboost            2    .09357747    .13574957    .00792991    .13705294

mean stacking weights across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .00177774    .00228412    3.208e-17    .00304909
gradboost            2            0    .99822226    .99771588            1    .99695091
      ols            1            1    .00076729    .00182452    .00047736            0
gradboost            2            1    .99923271    .99817548    .99952264            1

mean stacking weights across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
    logit            1            0    .71795805    .74260702    .70523975    .70602738
gradboost            2            0    .28204195    .25739298    .29476025    .29397262
    logit            1            1    .50096447    .53600958    .47086787    .49601598
gradboost            2            1    .49903553    .46399042    .52913213    .50398402

error - short-stacked weights for assignmt not available

error - short-stacked weights for lnearnings not available

error - short-stacked weights for training not available

error - pool-stacked weights for assignmt not available

error - pool-stacked weights for lnearnings not available

error - pool-stacked weights for training not available

. ddml extract, show(pystacked)

pystacked weights for Z1_pystacked (assignmt)
             learner   resample     fold_1     fold_2
    logit          1          1  .93867301  .78982784
gradboost          2          1  .06132699  .21017216
    logit          1          2          1  .98414019
gradboost          2          2  4.337e-18  .01585981
    logit          1          3  .90214667  .82374745
gradboost          2          3  .09785333  .17625255

mean stacking weights across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .90642253    .86425043    .99207009    .86294706
gradboost            2    .09357747    .13574957    .00792991    .13705294

pystacked MSEs for Z1_pystacked (assignmt)
             learner   resample     fold_1     fold_2
    logit          1          1  .22269669  .22446312
gradboost          2          1  .22814806  .22891956
    logit          1          2  .22265348  .22420206
gradboost          2          2  .23059193  .23170652
    logit          1          3  .22402015  .22151725
gradboost          2          3  .22970122  .22596313

mean stacking MSEs across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
             learner   mean_MSE      rep_1      rep_2      rep_3
    logit          1  .22325879   .2235799  .22342777   .2227687
gradboost          2  .22917174  .22853381  .23114922  .22783218

pystacked weights for Y1_pystacked (lnearnings)
             learner      Z=0/1   resample     fold_1     fold_2
      ols          1          0          1  .00456824  9.699e-16
gradboost          2          0          1  .99543176          1
      ols          1          0          2          0  6.416e-17
gradboost          2          0          2          1          1
      ols          1          0          3  .00609817          0
gradboost          2          0          3  .99390183          1
      ols          1          1          1  .00154426  .00210479
gradboost          2          1          1  .99845574  .99789521
      ols          1          1          2          0  .00095472
gradboost          2          1          2          1  .99904528
      ols          1          1          3          0          0
gradboost          2          1          3          1          1

mean stacking weights across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .00177774    .00228412    3.208e-17    .00304909
gradboost            2            0    .99822226    .99771588            1    .99695091
      ols            1            1    .00076729    .00182452    .00047736            0
gradboost            2            1    .99923271    .99817548    .99952264            1

pystacked MSEs for Y1_pystacked (lnearnings)
             learner      Z=0/1   resample     fold_1     fold_2
      ols          1          0          1  .87852107  .97871021
gradboost          2          0          1  .00061042  .00205651
      ols          1          0          2  .88332599  .97745751
gradboost          2          0          2  .00157052  .00073721
      ols          1          0          3  .90207153  .94022536
gradboost          2          0          3  .00071794  .00111948
      ols          1          1          1  .89826625  1.0918523
gradboost          2          1          1  .00038102  .00223041
      ols          1          1          2  1.0183185  .99718448
gradboost          2          1          2  .00374523  .00081301
      ols          1          1          3  1.0214655  .96133133
gradboost          2          1          3  .00384266  .00044668

mean stacking MSEs across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
             learner      Z=0/1   mean_MSE      rep_1      rep_2      rep_3
      ols          1          0  .92671861  .92861564  .93039175  .92114844
gradboost          2          0  .00113535  .00133347  .00115386  .00091871
      ols          1          1  .99806972  .99505928  1.0077515  .99139841
gradboost          2          1  .00190984  .00130572  .00227912  .00214467

pystacked weights for D1_pystacked (training)
             learner      Z=0/1   resample     fold_1     fold_2
    logit          1          0          1  .81666924   .6685448
gradboost          2          0          1  .18333076   .3314552
    logit          1          0          2  .85469183  .55578768
gradboost          2          0          2  .14530817  .44421232
    logit          1          0          3  .94435309  .46770167
gradboost          2          0          3  .05564691  .53229833
    logit          1          1          1  .54728792  .52473124
gradboost          2          1          1  .45271208  .47526876
    logit          1          1          2  .58333021  .35840552
gradboost          2          1          2  .41666979  .64159448
    logit          1          1          3  .58077622  .41125573
gradboost          2          1          3  .41922378  .58874427

mean stacking weights across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
    logit            1            0    .71795805    .74260702    .70523975    .70602738
gradboost            2            0    .28204195    .25739298    .29476025    .29397262
    logit            1            1    .50096447    .53600958    .47086787    .49601598
gradboost            2            1    .49903553    .46399042    .52913213    .50398402

pystacked MSEs for D1_pystacked (training)
             learner      Z=0/1   resample     fold_1     fold_2
    logit          1          0          1  .01301123   .0204968
gradboost          2          0          1  .01530629  .02103978
    logit          1          0          2  .02000378  .01497096
gradboost          2          0          2  .02345748  .01538503
    logit          1          0          3  .01462366  .01908187
gradboost          2          0          3  .01927896  .01898525
    logit          1          1          1  .21474822   .2243913
gradboost          2          1          1  .21619289  .22514837
    logit          1          1          2  .22402158  .21808897
gradboost          2          1          2  .22626105  .21332779
    logit          1          1          3   .2218442  .21711664
gradboost          2          1          3   .2241944  .21424059

mean stacking MSEs across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
             learner      Z=0/1   mean_MSE      rep_1      rep_2      rep_3
    logit          1          0  .01703138  .01675402  .01748737  .01685276
gradboost          2          0   .0189088  .01817304  .01942126   .0191321
    logit          1          1  .22003515  .21956976  .22105528  .21948042
gradboost          2          1  .21989418  .22067063  .21979442   .2192175

. 
. *** pystacked, SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml crossfit, shortstack poolstack
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
  ps  1   [poolstack]          [ps]          [ps]          [ps]    -0.002    (0.002)          [ps]
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.002)  Z1_pystacked
  ss  2  [shortstack]          [ss]          [ss]          [ss]     0.000    (0.002)          [ss]
  ps  2   [poolstack]          [ps]          [ps]          [ps]     0.000    (0.002)          [ps]

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.001    (0.002)          [ss]
  ps mn   [poolstack]          [ps]          [ps]          [ps]    -0.001    (0.002)          [ps]
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.001    (0.002)          [ss]
  ps md   [poolstack]          [ps]          [ps]          [ps]    -0.001    (0.002)          [ps]

Shortstack DDML model (median over 2 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0007456   .0020239    -0.37   0.713    -.0047123    .0032212
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0007   -0.0019   -0.0019   -0.0007    0.0004    0.0004

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019334   .0015416    -1.25   0.210    -.0049549     .001088
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019283   .0015438    -1.25   0.212     -.004954    .0010974
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1_1
E[D|X,Z=0]   = D_training_ps0_1
E[D|X,Z=1]   = D_training_ps1_1
E[Z|X]       = Z_assignmt_ps_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019672   .0015392    -1.28   0.201     -.004984    .0010496
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** ddml extract
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1    .91935294    .87531308     .9633928
gradboost            2    .08064706    .12468692     .0366072

mean stacking weights across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
      ols            1            0    .00257646    .00253184    .00262108
gradboost            2            0    .99742354    .99746816    .99737892
      ols            1            1    .00199168    1.821e-16    .00398335
gradboost            2            1    .99800832            1    .99601665

mean stacking weights across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
    logit            1            0    .78144571    .70742327    .85546815
gradboost            2            0    .21855429    .29257673    .14453185
    logit            1            1    .64033199    .67503045    .60563353
gradboost            2            1    .35966801    .32496955    .39436647

short-stacked weights across resamples for assignmt
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1     .9962138            1     .9924276
gradboost            2     .0037862    8.674e-19     .0075724

short-stacked weights across resamples for lnearnings
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
      ols            1            0    .00110693    .00221386            0
gradboost            2            0    .99889307    .99778614            1
      ols            1            1    .00079194    .00158388            0
gradboost            2            1    .99920806    .99841612            1

short-stacked weights across resamples for training
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
    logit            1            0     .7702926    .76091122    .77967398
gradboost            2            0     .2297074    .23908878    .22032602
    logit            1            1    .53385596    .54365957    .52405236
gradboost            2            1    .46614404    .45634043    .47594764

pool-stacked weights across resamples for assignmt
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1     .9372262    .87624594    .99820645
gradboost            2     .0627738    .12375406    .00179355

pool-stacked weights across resamples for lnearnings
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
      ols            1            0    .00221252    .00257597    .00184907
gradboost            2            0    .99778748    .99742403    .99815093
      ols            1            1      .001979            0    .00395799
gradboost            2            1      .998021            1    .99604201

pool-stacked weights across resamples for training
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
    logit            1            0    .78830611    .71136663    .86524559
gradboost            2            0    .21169389    .28863337    .13475441
    logit            1            1    .63566079    .67716236    .59415921
gradboost            2            1    .36433921    .32283764    .40584079

. ddml extract, show(pystacked)

pystacked weights for Z1_pystacked (assignmt)
             learner   resample     fold_1     fold_2
    logit          1          1  .99034705  .76027911
gradboost          2          1  .00965295  .23972089
    logit          1          2          1   .9267856
gradboost          2          2          0   .0732144

mean stacking weights across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2
    logit            1    .91935294    .87531308     .9633928
gradboost            2    .08064706    .12468692     .0366072

pystacked MSEs for Z1_pystacked (assignmt)
             learner   resample     fold_1     fold_2
    logit          1          1  .22300665  .22201711
gradboost          2          1  .23057944  .22598501
    logit          1          2   .2236796  .22442762
gradboost          2          2  .23224081   .2311261

mean stacking MSEs across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
             learner   mean_MSE      rep_1      rep_2
    logit          1  .22328275  .22251188  .22405361
gradboost          2  .22998284  .22828222  .23168345

pystacked weights for Y1_pystacked (lnearnings)
             learner      Z=0/1   resample     fold_1     fold_2
      ols          1          0          1   .0010158  .00404788
gradboost          2          0          1   .9989842  .99595212
      ols          1          0          2  4.241e-17  .00524216
gradboost          2          0          2          1  .99475784
      ols          1          1          1  3.642e-16          0
gradboost          2          1          1          1          1
      ols          1          1          2  .00344285  .00452385
gradboost          2          1          2  .99655715  .99547615

mean stacking weights across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
      ols            1            0    .00257646    .00253184    .00262108
gradboost            2            0    .99742354    .99746816    .99737892
      ols            1            1    .00199168    1.821e-16    .00398335
gradboost            2            1    .99800832            1    .99601665

pystacked MSEs for Y1_pystacked (lnearnings)
             learner      Z=0/1   resample     fold_1     fold_2
      ols          1          0          1  .89383683  .99241212
gradboost          2          0          1  .00108256  .00070156
      ols          1          0          2  1.0297618  .81948947
gradboost          2          0          2  .00110604  .00098528
      ols          1          1          1  .91522841  1.0568325
gradboost          2          1          1  .00366804  .00102781
      ols          1          1          2  1.0163523  .97910314
gradboost          2          1          2  .00048727  .00220856

mean stacking MSEs across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
             learner      Z=0/1   mean_MSE      rep_1      rep_2
      ols          1          0  .93387506  .94312447  .92462566
gradboost          2          0  .00096886  .00089206  .00104566
      ols          1          1  .99187909  .98603047  .99772771
gradboost          2          1  .00184792  .00234793  .00134792

pystacked weights for D1_pystacked (training)
             learner      Z=0/1   resample     fold_1     fold_2
    logit          1          0          1  .66044465  .75440189
gradboost          2          0          1  .33955535  .24559811
    logit          1          0          2   .8247462  .88619009
gradboost          2          0          2   .1752538  .11380991
    logit          1          1          1  .71503825  .63502266
gradboost          2          1          1  .28496175  .36497734
    logit          1          1          2   .7173815  .49388556
gradboost          2          1          2   .2826185  .50611444

mean stacking weights across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2
    logit            1            0    .78144571    .70742327    .85546815
gradboost            2            0    .21855429    .29257673    .14453185
    logit            1            1    .64033199    .67503045    .60563353
gradboost            2            1    .35966801    .32496955    .39436647

pystacked MSEs for D1_pystacked (training)
             learner      Z=0/1   resample     fold_1     fold_2
    logit          1          0          1  .01853639  .01594501
gradboost          2          0          1  .01954996  .01786293
    logit          1          0          2  .01402761   .0203014
gradboost          2          0          2  .01593187  .02458424
    logit          1          1          1  .21775286  .22147936
gradboost          2          1          1  .22429745  .22524705
    logit          1          1          2  .21869803  .21791376
gradboost          2          1          2  .22443866    .217714

mean stacking MSEs across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
             learner      Z=0/1   mean_MSE      rep_1      rep_2
    logit          1          0   .0172026   .0172407  .01716451
gradboost          2          0  .01948225  .01870644  .02025805
    logit          1          1    .218961  .21961611  .21830589
gradboost          2          1  .22292429  .22477225  .22107633

. 
. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack poolstack
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking...completed pooled-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
  ps  1   [poolstack]          [ps]          [ps]          [ps]    -0.002    (0.002)          [ps]
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.002)  Z1_pystacked
  ss  2  [shortstack]          [ss]          [ss]          [ss]     0.000    (0.002)          [ss]
  ps  2   [poolstack]          [ps]          [ps]          [ps]     0.000    (0.002)          [ps]
  st  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.000    (0.001)  Z1_pystacked
  ss  3  [shortstack]          [ss]          [ss]          [ss]    -0.000    (0.001)          [ss]
  ps  3   [poolstack]          [ps]          [ps]          [ps]    -0.000    (0.001)          [ps]

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.001    (0.002)          [ss]
  ps mn   [poolstack]          [ps]          [ps]          [ps]    -0.001    (0.002)          [ps]
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.000    (0.002)  Z1_pystacked
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.000    (0.002)          [ss]
  ps md   [poolstack]          [ps]          [ps]          [ps]    -0.000    (0.002)          [ps]

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0002474   .0018655    -0.13   0.895    -.0039036    .0034089
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. *** replay
. ddml estimate, mname(m0) spec(st) rep(1) replay notable

Stacking DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019334   .0015416    -1.25   0.210    -.0049549     .001088
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(2) replay notable

Stacking DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0003883   .0017553     0.22   0.825     -.003052    .0038286
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(st) rep(mn) replay notable

Mean over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0005747   .0018239    -0.32   0.753    -.0041494    .0030001
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(st) rep(md) replay notable

Median over 3 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0001789   .0018447    -0.10   0.923    -.0037944    .0034366
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019283   .0015438    -1.25   0.212     -.004954    .0010974
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_2                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_2
E[D|X,Z=0]   = D_training_ss0_2
E[D|X,Z=1]   = D_training_ss1_2
E[Z|X]       = Z_assignmt_ss_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0004372   .0017353     0.25   0.801    -.0029639    .0038384
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0005795   .0018146    -0.32   0.749     -.004136     .002977
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0002474   .0018655    -0.13   0.895    -.0039036    .0034089
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0019   -0.0019   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ps) rep(1) replay notable

Poolstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1_1
E[D|X,Z=0]   = D_training_ps0_1
E[D|X,Z=1]   = D_training_ps1_1
E[Z|X]       = Z_assignmt_ps_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019672   .0015392    -1.28   0.201     -.004984    .0010496
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(2) replay notable

Poolstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0_2                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ps1_2
E[D|X,Z=0]   = D_training_ps0_2
E[D|X,Z=1]   = D_training_ps1_2
E[Z|X]       = Z_assignmt_ps_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0004096   .0017495     0.23   0.815    -.0030194    .0038385
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ps) rep(mn) replay notable

Poolstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ps1
E[D|X,Z=0]   = D_training_ps0
E[D|X,Z=1]   = D_training_ps1
E[Z|X]       = Z_assignmt_ps
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0005964   .0018227    -0.33   0.743    -.0041689     .002976
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0020   -0.0020   -0.0002    0.0004    0.0004

. ddml estimate, mname(m0) spec(ps) rep(md) replay notable

Poolstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ps0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ps1
E[D|X,Z=0]   = D_training_ps0
E[D|X,Z=1]   = D_training_ps1
E[Z|X]       = Z_assignmt_ps
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0002317   .0018633    -0.12   0.901    -.0038837    .0034203
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0006   -0.0020   -0.0020   -0.0002    0.0004    0.0004

. *** ddml extract
. ddml extract, show(weights)

mean stacking weights across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .90679134    .87531308     .9633928    .88166814
gradboost            2    .09320866    .12468692     .0366072    .11833186

mean stacking weights across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .00242068    .00253184    .00262108    .00210912
gradboost            2            0    .99757932    .99746816    .99737892    .99789088
      ols            1            1    .00173662    1.821e-16    .00398335    .00122649
gradboost            2            1    .99826338            1    .99601665    .99877351

mean stacking weights across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
    logit            1            0    .71080849    .70742327    .85546815    .56953405
gradboost            2            0    .28919151    .29257673    .14453185    .43046595
    logit            1            1    .60863003    .67503045    .60563353    .54522611
gradboost            2            1    .39136997    .32496955    .39436647    .45477389

short-stacked weights across resamples for assignmt
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .97383216            1     .9924276    .92906888
gradboost            2    .02616784    8.674e-19     .0075724    .07093112

short-stacked weights across resamples for lnearnings
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .00073795    .00221386            0            0
gradboost            2            0    .99926205    .99778614            1            1
      ols            1            1    .00052796    .00158388            0            0
gradboost            2            1    .99947204    .99841612            1            1

short-stacked weights across resamples for training
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
    logit            1            0    .79939238    .76091122    .77967398    .85759193
gradboost            2            0    .20060762    .23908878    .22032602    .14240807
    logit            1            1    .53211042    .54365957    .52405236    .52861932
gradboost            2            1    .46788958    .45634043    .47594764    .47138068

pool-stacked weights across resamples for assignmt
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .91870594    .87624594    .99820645    .88166542
gradboost            2    .08129406    .12375406    .00179355    .11833458

pool-stacked weights across resamples for lnearnings
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .00147501    .00257597    .00184907            0
gradboost            2            0    .99852499    .99742403    .99815093            1
      ols            1            1    .00131933            0    .00395799            0
gradboost            2            1    .99868067            1    .99604201            1

pool-stacked weights across resamples for training
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
    logit            1            0    .73246634    .71136663    .86524559    .62078681
gradboost            2            0    .26753366    .28863337    .13475441    .37921319
    logit            1            1    .60486179    .67716236    .59415921    .54326379
gradboost            2            1    .39513821    .32283764    .40584079    .45673621

. ddml extract, show(pystacked)

pystacked weights for Z1_pystacked (assignmt)
             learner   resample     fold_1     fold_2
    logit          1          1  .99034705  .76027911
gradboost          2          1  .00965295  .23972089
    logit          1          2          1   .9267856
gradboost          2          2          0   .0732144
    logit          1          3  .89362281  .86971347
gradboost          2          3  .10637719  .13028653

mean stacking weights across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
               learner  mean_weight        rep_1        rep_2        rep_3
    logit            1    .90679134    .87531308     .9633928    .88166814
gradboost            2    .09320866    .12468692     .0366072    .11833186

pystacked MSEs for Z1_pystacked (assignmt)
             learner   resample     fold_1     fold_2
    logit          1          1  .22300665  .22201711
gradboost          2          1  .23057944  .22598501
    logit          1          2   .2236796  .22442762
gradboost          2          2  .23224081   .2311261
    logit          1          3  .22245979  .22316447
gradboost          2          3  .22823919  .22879914

mean stacking MSEs across folds/resamples for Z1_pystacked (assignmt)
final stacking estimator: nnls1
             learner   mean_MSE      rep_1      rep_2      rep_3
    logit          1  .22312587  .22251188  .22405361  .22281213
gradboost          2  .22949495  .22828222  .23168345  .22851917

pystacked weights for Y1_pystacked (lnearnings)
             learner      Z=0/1   resample     fold_1     fold_2
      ols          1          0          1   .0010158  .00404788
gradboost          2          0          1   .9989842  .99595212
      ols          1          0          2  4.241e-17  .00524216
gradboost          2          0          2          1  .99475784
      ols          1          0          3  .00421824  3.547e-16
gradboost          2          0          3  .99578176          1
      ols          1          1          1  3.642e-16          0
gradboost          2          1          1          1          1
      ols          1          1          2  .00344285  .00452385
gradboost          2          1          2  .99655715  .99547615
      ols          1          1          3          0  .00245299
gradboost          2          1          3          1  .99754701

mean stacking weights across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
      ols            1            0    .00242068    .00253184    .00262108    .00210912
gradboost            2            0    .99757932    .99746816    .99737892    .99789088
      ols            1            1    .00173662    1.821e-16    .00398335    .00122649
gradboost            2            1    .99826338            1    .99601665    .99877351

pystacked MSEs for Y1_pystacked (lnearnings)
             learner      Z=0/1   resample     fold_1     fold_2
      ols          1          0          1  .89383683  .99241212
gradboost          2          0          1  .00108256  .00070156
      ols          1          0          2  1.0297618  .81948947
gradboost          2          0          2  .00110604  .00098528
      ols          1          0          3  .91189597   .9811706
gradboost          2          0          3  .00054469  .00111062
      ols          1          1          1  .91522841  1.0568325
gradboost          2          1          1  .00366804  .00102781
      ols          1          1          2  1.0163523  .97910314
gradboost          2          1          2  .00048727  .00220856
      ols          1          1          3  .97464176  1.0219551
gradboost          2          1          3  .00467866  .00060227

mean stacking MSEs across folds/resamples for Y1_pystacked (lnearnings)
final stacking estimator: nnls1
             learner      Z=0/1   mean_MSE      rep_1      rep_2      rep_3
      ols          1          0  .93809447  .94312447  .92462566  .94653328
gradboost          2          0  .00092179  .00089206  .00104566  .00082766
      ols          1          1  .99401887  .98603047  .99772771  .99829843
gradboost          2          1   .0021121  .00234793  .00134792  .00264047

pystacked weights for D1_pystacked (training)
             learner      Z=0/1   resample     fold_1     fold_2
    logit          1          0          1  .66044465  .75440189
gradboost          2          0          1  .33955535  .24559811
    logit          1          0          2   .8247462  .88619009
gradboost          2          0          2   .1752538  .11380991
    logit          1          0          3  .77220808  .36686002
gradboost          2          0          3  .22779192  .63313998
    logit          1          1          1  .71503825  .63502266
gradboost          2          1          1  .28496175  .36497734
    logit          1          1          2   .7173815  .49388556
gradboost          2          1          2   .2826185  .50611444
    logit          1          1          3  .60962707  .48082516
gradboost          2          1          3  .39037293  .51917484

mean stacking weights across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
               learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
    logit            1            0    .71080849    .70742327    .85546815    .56953405
gradboost            2            0    .28919151    .29257673    .14453185    .43046595
    logit            1            1    .60863003    .67503045    .60563353    .54522611
gradboost            2            1    .39136997    .32496955    .39436647    .45477389

pystacked MSEs for D1_pystacked (training)
             learner      Z=0/1   resample     fold_1     fold_2
    logit          1          0          1  .01853639  .01594501
gradboost          2          0          1  .01954996  .01786293
    logit          1          0          2  .01402761   .0203014
gradboost          2          0          2  .01593187  .02458424
    logit          1          0          3    .012824  .02177417
gradboost          2          0          3  .01454064   .0212771
    logit          1          1          1  .21775286  .22147936
gradboost          2          1          1  .22429745  .22524705
    logit          1          1          2  .21869803  .21791376
gradboost          2          1          2  .22443866    .217714
    logit          1          1          3  .22151778   .2194017
gradboost          2          1          3  .22469328  .21881998

mean stacking MSEs across folds/resamples for D1_pystacked (training)
final stacking estimator: nnls1
             learner      Z=0/1   mean_MSE      rep_1      rep_2      rep_3
    logit          1          0  .01723476   .0172407  .01716451  .01729908
gradboost          2          0  .01895779  .01870644  .02025805  .01790887
    logit          1          1  .21946058  .21961611  .21830589  .22045974
gradboost          2          1  .22253507  .22477225  .22107633  .22175663

. 
. *** multiple learners, no SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,Z]: reg $Y $X
Learner Y2_reg added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X,Z]: logit $D $X
Learner D2_logit added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(gradboost)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: logit $Z $X
Learner Z2_logit added successfully.

. ddml crossfit
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)      Z2_logit
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.001    (0.002)     [min-mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.001    (0.002)     [min-mse]

Median over 2 min-mse resamples (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0014792   .0018684    -0.79   0.429    -.0051412    .0021827
------------------------------------------------------------------------------

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0015   -0.0023   -0.0023   -0.0015   -0.0007   -0.0007

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022789   .0017846    -1.28   0.202    -.0057766    .0012189
------------------------------------------------------------------------------


. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
*  6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.017    (0.019)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked     0.000    (0.016)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.017    (0.019)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit     0.000    (0.016)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.021    (0.019)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.017)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.021    (0.019)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.017)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.006    (0.037)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.007    (0.033)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.006    (0.037)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.007    (0.033)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.011    (0.038)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.005    (0.034)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.011    (0.038)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.005    (0.034)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.021    (0.053)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.009    (0.049)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.021    (0.053)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.009    (0.049)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.030    (0.055)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.004    (0.051)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.030    (0.055)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.004    (0.051)      Z2_logit
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.001)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.002)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit     0.000    (0.001)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit     0.000    (0.002)      Z2_logit
   5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)  Z1_pystacked
*  8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.012    (0.017)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.010    (0.016)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.012    (0.017)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.010    (0.016)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.018)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.017)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.018)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.017)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.028    (0.035)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.004    (0.033)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.028    (0.035)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.004    (0.033)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.029    (0.037)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.036)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.029    (0.037)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.036)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.040    (0.051)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.006    (0.049)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.040    (0.051)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.006    (0.049)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.043    (0.053)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.052)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.043    (0.054)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.016    (0.052)      Z2_logit
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.001    (0.002)  Z1_pystacked
   1 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.001    (0.002)  Z1_pystacked
   2 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.001    (0.002)      Z2_logit
   2 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.001    (0.002)      Z2_logit
   3 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.001    (0.002)  Z1_pystacked
   3 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.001    (0.002)  Z1_pystacked
   4 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.001    (0.002)      Z2_logit
   4 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.001    (0.002)      Z2_logit
   5 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.001    (0.002)  Z1_pystacked
   5 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.001    (0.002)  Z1_pystacked
   6 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.001    (0.002)      Z2_logit
   6 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.001    (0.002)      Z2_logit
   7 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.001    (0.002)  Z1_pystacked
   7 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.001    (0.002)  Z1_pystacked
   8 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.001    (0.002)      Z2_logit
   8 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.001    (0.002)      Z2_logit
   9 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.015    (0.018)  Z1_pystacked
   9 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.015    (0.018)  Z1_pystacked
  10 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.005    (0.017)      Z2_logit
  10 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.005    (0.017)      Z2_logit
  11 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.015    (0.018)  Z1_pystacked
  11 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.015    (0.018)  Z1_pystacked
  12 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.005    (0.017)      Z2_logit
  12 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.005    (0.017)      Z2_logit
  13 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.018    (0.019)  Z1_pystacked
  13 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.018    (0.019)  Z1_pystacked
  14 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.008    (0.018)      Z2_logit
  14 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.008    (0.018)      Z2_logit
  15 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.018    (0.019)  Z1_pystacked
  15 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.018    (0.019)  Z1_pystacked
  16 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.008    (0.018)      Z2_logit
  16 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.008    (0.018)      Z2_logit
  17 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.017    (0.037)  Z1_pystacked
  17 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.017    (0.038)  Z1_pystacked
  18 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.005    (0.033)      Z2_logit
  18 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.005    (0.033)      Z2_logit
  19 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.017    (0.037)  Z1_pystacked
  19 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.017    (0.038)  Z1_pystacked
  20 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.005    (0.033)      Z2_logit
  20 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.005    (0.033)      Z2_logit
  21 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.020    (0.039)  Z1_pystacked
  21 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.020    (0.039)  Z1_pystacked
  22 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.001    (0.035)      Z2_logit
  22 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.001    (0.035)      Z2_logit
  23 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1    -0.020    (0.039)  Z1_pystacked
  23 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1    -0.020    (0.039)  Z1_pystacked
  24 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.001    (0.035)      Z2_logit
  24 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.001    (0.035)      Z2_logit
  25 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.031    (0.053)  Z1_pystacked
  25 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.031    (0.053)  Z1_pystacked
  26 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1     0.001    (0.050)      Z2_logit
  26 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1     0.001    (0.050)      Z2_logit
  27 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.031    (0.053)  Z1_pystacked
  27 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.031    (0.053)  Z1_pystacked
  28 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1     0.001    (0.050)      Z2_logit
  28 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1     0.001    (0.050)      Z2_logit
  29 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.036    (0.055)  Z1_pystacked
  29 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.036    (0.055)  Z1_pystacked
  30 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.006    (0.052)      Z2_logit
  30 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.006    (0.052)      Z2_logit
  31 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.036    (0.055)  Z1_pystacked
  31 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.036    (0.055)  Z1_pystacked
  32 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.006    (0.052)      Z2_logit
  32 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.006    (0.052)      Z2_logit
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.001    (0.002)     [min-mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.001    (0.002)     [min-mse]

Median over 2 min-mse specifications (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0014792   .0018684    -0.79   0.429    -.0051412    .0021827
------------------------------------------------------------------------------

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0015   -0.0023   -0.0023   -0.0015   -0.0007   -0.0007

. forvalues i=1/8 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001912   .0017382    -1.10   0.271    -.0053187    .0014947
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019034   .0016538    -1.15   0.250    -.0051449     .001338
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019098   .0017361    -1.10   0.271    -.0053126     .001493
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019014    .001652    -1.15   0.250    -.0051392    .0013365
------------------------------------------------------------------------------


DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0023612    .001868    -1.26   0.206    -.0060225       .0013
------------------------------------------------------------------------------


Min MSE DDML model, specification 6 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022789   .0017846    -1.28   0.202    -.0057766    .0012189
------------------------------------------------------------------------------


DDML model, specification 7 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0023587    .001866    -1.26   0.206    -.0060159    .0012985
------------------------------------------------------------------------------


DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022752   .0017818    -1.28   0.202    -.0057675     .001217
------------------------------------------------------------------------------


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)      Z2_logit
 mse  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]

Median over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022603   .0017847    -1.27   0.205    -.0057582    .0012377
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0023   -0.0023   -0.0023   -0.0007   -0.0007

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3995
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022789   .0017846    -1.28   0.202    -.0057766    .0012189
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3806
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0006796   .0015868    -0.43   0.668    -.0037897    .0024305
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = mn_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = mn_1_mse
E[D|X,Z=0]   = mn_training0_mse
E[D|X,Z=1]   = mn_training1_mse
E[Z|X]       = mn__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0017396   .0018668    -0.93   0.351    -.0053984    .0019193
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0023   -0.0023   -0.0023   -0.0007   -0.0007

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022603   .0017847    -1.27   0.205    -.0057582    .0012377
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0023   -0.0023   -0.0023   -0.0007   -0.0007

. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
*  6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
   8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.017    (0.019)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked     0.000    (0.016)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.017    (0.019)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit     0.000    (0.016)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.021    (0.019)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.017)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.021    (0.019)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.017)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.006    (0.037)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.007    (0.033)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.006    (0.037)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.007    (0.033)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.011    (0.038)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.005    (0.034)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.011    (0.038)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.005    (0.034)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.021    (0.053)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.009    (0.049)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.021    (0.053)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.009    (0.049)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.030    (0.055)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.004    (0.051)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.030    (0.055)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.004    (0.051)      Z2_logit
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.001)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked     0.000    (0.002)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit     0.000    (0.001)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit     0.000    (0.002)      Z2_logit
   5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.001    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)  Z1_pystacked
*  8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.001    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.012    (0.017)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.010    (0.016)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.012    (0.017)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.010    (0.016)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.018)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.014    (0.017)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.018)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.014    (0.017)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.028    (0.035)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.004    (0.033)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.028    (0.035)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.004    (0.033)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.029    (0.037)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.036)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.029    (0.037)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.036)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.040    (0.051)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.006    (0.049)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.040    (0.051)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.006    (0.049)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.043    (0.053)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.052)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.043    (0.054)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.016    (0.052)      Z2_logit
   1  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.003)  Z1_pystacked
   6  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.003)  Z1_pystacked
*  8  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.031    (0.019)  Z1_pystacked
  10  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.016)      Z2_logit
  11  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.031    (0.019)  Z1_pystacked
  12  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.016)      Z2_logit
  13  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.006    (0.020)  Z1_pystacked
  14  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked     0.012    (0.018)      Z2_logit
  15  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.006    (0.020)  Z1_pystacked
  16  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit     0.012    (0.018)      Z2_logit
  17  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.028    (0.043)  Z1_pystacked
  18  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.009    (0.033)      Z2_logit
  19  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.028    (0.043)  Z1_pystacked
  20  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.009    (0.033)      Z2_logit
  21  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.079    (0.048)  Z1_pystacked
  22  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.040    (0.036)      Z2_logit
  23  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.079    (0.048)  Z1_pystacked
  24  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.041    (0.036)      Z2_logit
  25  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.001    (0.059)  Z1_pystacked
  26  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.008    (0.049)      Z2_logit
  27  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.001    (0.059)  Z1_pystacked
  28  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.008    (0.049)      Z2_logit
  29  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.074    (0.064)  Z1_pystacked
  30  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.055    (0.053)      Z2_logit
  31  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.074    (0.064)  Z1_pystacked
  32  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.055    (0.053)      Z2_logit
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.001    (0.002)  Z1_pystacked
   1 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   2 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.001    (0.002)      Z2_logit
   2 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   3 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.001    (0.002)  Z1_pystacked
   3 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   4 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.001    (0.002)      Z2_logit
   4 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.002)      Z2_logit
   5 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   5 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   6 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   6 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   7 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   7 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   8 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)      Z2_logit
   8 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)      Z2_logit
   9 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.020    (0.020)  Z1_pystacked
   9 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.017    (0.019)  Z1_pystacked
  10 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.004    (0.017)      Z2_logit
  10 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.003    (0.017)      Z2_logit
  11 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.020    (0.020)  Z1_pystacked
  11 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.017    (0.019)  Z1_pystacked
  12 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.004    (0.017)      Z2_logit
  12 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.003    (0.017)      Z2_logit
  13 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.014    (0.020)  Z1_pystacked
  13 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.014    (0.021)  Z1_pystacked
  14 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.002    (0.020)      Z2_logit
  14 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.003    (0.021)      Z2_logit
  15 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.014    (0.020)  Z1_pystacked
  15 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.014    (0.021)  Z1_pystacked
  16 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.002    (0.020)      Z2_logit
  16 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.003    (0.021)      Z2_logit
  17 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.043)  Z1_pystacked
  17 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.006    (0.041)  Z1_pystacked
  18 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.006    (0.033)      Z2_logit
  18 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.007    (0.033)      Z2_logit
  19 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.043)  Z1_pystacked
  19 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.006    (0.041)  Z1_pystacked
  20 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.006    (0.033)      Z2_logit
  20 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.007    (0.033)      Z2_logit
  21 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.013    (0.056)  Z1_pystacked
  21 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.011    (0.041)  Z1_pystacked
  22 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.014    (0.039)      Z2_logit
  22 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.005    (0.036)      Z2_logit
  23 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.013    (0.056)  Z1_pystacked
  23 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1    -0.011    (0.041)  Z1_pystacked
  24 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.014    (0.039)      Z2_logit
  24 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.005    (0.036)      Z2_logit
  25 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.021    (0.056)  Z1_pystacked
  25 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.021    (0.054)  Z1_pystacked
  26 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1     0.003    (0.049)      Z2_logit
  26 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1     0.008    (0.049)      Z2_logit
  27 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.021    (0.056)  Z1_pystacked
  27 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.021    (0.054)  Z1_pystacked
  28 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1     0.003    (0.049)      Z2_logit
  28 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1     0.008    (0.049)      Z2_logit
  29 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.001    (0.073)  Z1_pystacked
  29 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.030    (0.055)  Z1_pystacked
  30 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.014    (0.058)      Z2_logit
  30 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.004    (0.056)      Z2_logit
  31 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.001    (0.073)  Z1_pystacked
  31 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.030    (0.055)  Z1_pystacked
  32 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.014    (0.058)      Z2_logit
  32 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.004    (0.056)      Z2_logit
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]

Median over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022603   .0017847    -1.27   0.205    -.0057582    .0012377
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0023   -0.0023   -0.0023   -0.0007   -0.0007

. forvalues i=1/4 {
  2.         forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001912   .0017382    -1.10   0.271    -.0053187    .0014947
------------------------------------------------------------------------------


DDML model, specification 1 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0003703   .0014858     0.25   0.803    -.0025418    .0032824
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019034   .0016538    -1.15   0.250    -.0051449     .001338
------------------------------------------------------------------------------


DDML model, specification 2 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0003801    .001506     0.25   0.801    -.0025717    .0033319
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019098   .0017361    -1.10   0.271    -.0053126     .001493
------------------------------------------------------------------------------


DDML model, specification 3 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0003707   .0014875     0.25   0.803    -.0025448    .0032862
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019014    .001652    -1.15   0.250    -.0051392    .0013365
------------------------------------------------------------------------------


DDML model, specification 4 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   .0003803   .0015067     0.25   0.801    -.0025728    .0033334
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = mn_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = mn_1_mse
E[D|X,Z=0]   = mn_training0_mse
E[D|X,Z=1]   = mn_training1_mse
E[Z|X]       = mn__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0017396   .0018668    -0.93   0.351    -.0053984    .0019193
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0023   -0.0023   -0.0023   -0.0007   -0.0007

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022603   .0017847    -1.27   0.205    -.0057582    .0012377
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0023   -0.0023   -0.0023   -0.0007   -0.0007

. 
. *** multiple learners, SS
. 
. *** initialise ddml and select model; 
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(gradboost)
Learner Y1_pystacked added successfully.

. ddml E[Y|X,Z]: reg $Y $X
Learner Y2_reg added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(gradboost)
Learner D1_pystacked added successfully.

. ddml E[D|X,Z]: logit $D $X
Learner D2_logit added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(gradboost)
Learner Z1_pystacked added successfully.

. ddml E[Z|X]: logit $Z $X
Learner Z2_logit added successfully.

. ddml crossfit, shortstack
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]

Shortstack DDML model (median over 2 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0017877   .0014551    -1.23   0.219    -.0046396    .0010642
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0020   -0.0020   -0.0018   -0.0016   -0.0016

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839   .0017479    -1.05   0.293    -.0052648    .0015869
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0015485    -1.03   0.303    -.0046301    .0014399
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
*  8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.010    (0.017)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.006    (0.016)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.010    (0.017)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.006    (0.016)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.010    (0.019)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.018)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.010    (0.019)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.018)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.039)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.006    (0.033)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.039)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.006    (0.033)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.020    (0.043)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.014    (0.036)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.020    (0.042)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.014    (0.036)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.011    (0.054)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.010    (0.049)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.011    (0.054)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.010    (0.049)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.012    (0.059)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.012    (0.053)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.012    (0.058)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.012    (0.052)      Z2_logit
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.001)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.001)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.001)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.001)      Z2_logit
   5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.003    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.003    (0.002)  Z1_pystacked
*  8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.020    (0.018)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.005    (0.016)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.020    (0.018)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.005    (0.016)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.025    (0.020)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.018)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.025    (0.020)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.016    (0.018)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.023    (0.039)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.011    (0.034)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.023    (0.039)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.011    (0.034)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.013    (0.045)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.012    (0.038)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.013    (0.045)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.012    (0.038)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.005    (0.055)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.008    (0.049)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.005    (0.055)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.008    (0.049)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.009    (0.062)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.026    (0.055)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.009    (0.062)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.026    (0.055)      Z2_logit
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   1 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   2 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.001)      Z2_logit
   2 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.001)      Z2_logit
   3 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   3 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   4 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.001)      Z2_logit
   4 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.001)      Z2_logit
   5 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   5 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   6 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   6 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   7 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   7 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   8 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)      Z2_logit
   8 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)      Z2_logit
   9 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.015    (0.018)  Z1_pystacked
   9 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.015    (0.018)  Z1_pystacked
  10 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.006    (0.016)      Z2_logit
  10 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.006    (0.016)      Z2_logit
  11 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.015    (0.018)  Z1_pystacked
  11 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.015    (0.018)  Z1_pystacked
  12 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.006    (0.016)      Z2_logit
  12 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.006    (0.016)      Z2_logit
  13 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.017    (0.021)  Z1_pystacked
  13 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.017    (0.021)  Z1_pystacked
  14 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.010    (0.019)      Z2_logit
  14 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.010    (0.019)      Z2_logit
  15 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.017    (0.021)  Z1_pystacked
  15 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.017    (0.021)  Z1_pystacked
  16 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.010    (0.019)      Z2_logit
  16 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.010    (0.019)      Z2_logit
  17 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.010    (0.041)  Z1_pystacked
  17 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.010    (0.041)  Z1_pystacked
  18 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.003    (0.035)      Z2_logit
  18 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.003    (0.035)      Z2_logit
  19 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.010    (0.041)  Z1_pystacked
  19 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.010    (0.041)  Z1_pystacked
  20 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.003    (0.035)      Z2_logit
  20 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.003    (0.035)      Z2_logit
  21 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.017    (0.044)  Z1_pystacked
  21 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.017    (0.044)  Z1_pystacked
  22 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.001    (0.039)      Z2_logit
  22 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.001    (0.039)      Z2_logit
  23 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.017    (0.044)  Z1_pystacked
  23 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.017    (0.044)  Z1_pystacked
  24 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.001    (0.039)      Z2_logit
  24 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.001    (0.039)      Z2_logit
  25 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.003    (0.055)  Z1_pystacked
  25 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.003    (0.055)  Z1_pystacked
  26 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.001    (0.050)      Z2_logit
  26 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.001    (0.050)      Z2_logit
  27 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.003    (0.055)  Z1_pystacked
  27 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.003    (0.055)  Z1_pystacked
  28 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.001    (0.050)      Z2_logit
  28 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.001    (0.050)      Z2_logit
  29 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.002    (0.061)  Z1_pystacked
  29 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.002    (0.061)  Z1_pystacked
  30 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.007    (0.057)      Z2_logit
  30 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.007    (0.057)      Z2_logit
  31 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.002    (0.061)  Z1_pystacked
  31 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.002    (0.061)  Z1_pystacked
  32 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.007    (0.057)      Z2_logit
  32 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.007    (0.057)      Z2_logit
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]

Shortstack DDML model (median over 2 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0017877   .0014551    -1.23   0.219    -.0046396    .0010642
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0018   -0.0020   -0.0020   -0.0018   -0.0016   -0.0016

. forvalues i=1/8 {
  2.     ddml estimate, mname(m0) spec(`i') rep(1) replay notable
  3. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0018613   .0016412    -1.13   0.257    -.0050779    .0013554
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0016183   .0015461    -1.05   0.295    -.0046486    .0014119
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0018602   .0016401    -1.13   0.257    -.0050747    .0013544
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0016178   .0015456    -1.05   0.295    -.0046471    .0014114
------------------------------------------------------------------------------


DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019953     .00186    -1.07   0.283    -.0056408    .0016502
------------------------------------------------------------------------------


DDML model, specification 6 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0018417   .0017506    -1.05   0.293    -.0052729    .0015894
------------------------------------------------------------------------------


DDML model, specification 7 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019918   .0018566    -1.07   0.283    -.0056308    .0016471
------------------------------------------------------------------------------


Min MSE DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839   .0017479    -1.05   0.293    -.0052648    .0015869
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0015485    -1.03   0.303    -.0046301    .0014399
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. *** append, estimate, replay
. ddml sample, append(1)

. ddml crossfit, shortstack
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[D|X,Z] equation: training
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking
Cross-fitting E[Z|X]: assignmt
Resample 3...
Cross-fitting fold 1 2 ...completed cross-fitting...completed short-stacking

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
 mse  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
 mse  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
  ss  3  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
mse = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0013823    -1.15   0.249    -.0043044    .0011142
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0020   -0.0020   -0.0016   -0.0015   -0.0015

. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839   .0017479    -1.05   0.293    -.0052648    .0015869
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022564   .0016501    -1.37   0.171    -.0054905    .0009776
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = mn_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = mn_1_mse
E[D|X,Z=0]   = mn_training0_mse
E[D|X,Z=1]   = mn_training1_mse
E[Z|X]       = mn__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019762   .0016469    -1.20   0.230    -.0052041    .0012516
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0020   -0.0023   -0.0023   -0.0018   -0.0018   -0.0018

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse resamples (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839    .001702    -1.08   0.280    -.0051749     .001497
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0020   -0.0023   -0.0023   -0.0018   -0.0018   -0.0018

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0015485    -1.03   0.303    -.0046301    .0014399
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_2                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_2
E[D|X,Z=0]   = D_training_ss0_2
E[D|X,Z=1]   = D_training_ss1_2
E[Z|X]       = Z_assignmt_ss_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019803   .0013276    -1.49   0.136    -.0045823    .0006217
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0016952   .0014159    -1.20   0.231    -.0044703      .00108
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0020   -0.0020   -0.0016   -0.0015   -0.0015

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0013823    -1.15   0.249    -.0043044    .0011142
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0020   -0.0020   -0.0016   -0.0015   -0.0015

. *** allcombos
. ddml estimate, allcombos


Model:                  interactiveiv, crossfit folds k=2, resamples r=3
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked Y2_reg
D equations (1):        training
 training learners:     D1_pystacked D2_logit
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked Z2_logit

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   2  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)      Z2_logit
   3  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)  Z1_pystacked
   4  1  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.002)      Z2_logit
   5  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  1  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
*  8  1  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.010    (0.017)  Z1_pystacked
  10  1  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.006    (0.016)      Z2_logit
  11  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.010    (0.017)  Z1_pystacked
  12  1  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.006    (0.016)      Z2_logit
  13  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.010    (0.019)  Z1_pystacked
  14  1  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.003    (0.018)      Z2_logit
  15  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.010    (0.019)  Z1_pystacked
  16  1  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.003    (0.018)      Z2_logit
  17  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.039)  Z1_pystacked
  18  1        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.006    (0.033)      Z2_logit
  19  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.039)  Z1_pystacked
  20  1        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.006    (0.033)      Z2_logit
  21  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.020    (0.043)  Z1_pystacked
  22  1        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.014    (0.036)      Z2_logit
  23  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.020    (0.042)  Z1_pystacked
  24  1        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.014    (0.036)      Z2_logit
  25  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.011    (0.054)  Z1_pystacked
  26  1        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.010    (0.049)      Z2_logit
  27  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.011    (0.054)  Z1_pystacked
  28  1        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.010    (0.049)      Z2_logit
  29  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.012    (0.059)  Z1_pystacked
  30  1        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.012    (0.053)      Z2_logit
  31  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.012    (0.058)  Z1_pystacked
  32  1        Y2_reg        Y2_reg      D2_logit      D2_logit     0.012    (0.052)      Z2_logit
  ss  1  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.002)          [ss]
   1  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.001)  Z1_pystacked
   2  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.001)      Z2_logit
   3  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.001)  Z1_pystacked
   4  2  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.001)      Z2_logit
   5  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.003    (0.002)  Z1_pystacked
   6  2  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.003    (0.002)  Z1_pystacked
*  8  2  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.020    (0.018)  Z1_pystacked
  10  2  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.005    (0.016)      Z2_logit
  11  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.020    (0.018)  Z1_pystacked
  12  2  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.005    (0.016)      Z2_logit
  13  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.025    (0.020)  Z1_pystacked
  14  2  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.016    (0.018)      Z2_logit
  15  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.025    (0.020)  Z1_pystacked
  16  2  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.016    (0.018)      Z2_logit
  17  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.023    (0.039)  Z1_pystacked
  18  2        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked     0.011    (0.034)      Z2_logit
  19  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.023    (0.039)  Z1_pystacked
  20  2        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit     0.011    (0.034)      Z2_logit
  21  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.013    (0.045)  Z1_pystacked
  22  2        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked    -0.012    (0.038)      Z2_logit
  23  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.013    (0.045)  Z1_pystacked
  24  2        Y2_reg  Y1_pystacked      D2_logit      D2_logit    -0.012    (0.038)      Z2_logit
  25  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.005    (0.055)  Z1_pystacked
  26  2        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked     0.008    (0.049)      Z2_logit
  27  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.005    (0.055)  Z1_pystacked
  28  2        Y2_reg        Y2_reg  D1_pystacked      D2_logit     0.008    (0.049)      Z2_logit
  29  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.009    (0.062)  Z1_pystacked
  30  2        Y2_reg        Y2_reg      D2_logit  D1_pystacked    -0.026    (0.055)      Z2_logit
  31  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.009    (0.062)  Z1_pystacked
  32  2        Y2_reg        Y2_reg      D2_logit      D2_logit    -0.026    (0.055)      Z2_logit
  ss  2  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
   1  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.001)  Z1_pystacked
   2  3  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.001)      Z2_logit
   3  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.002    (0.001)  Z1_pystacked
   4  3  Y1_pystacked  Y1_pystacked  D1_pystacked      D2_logit    -0.001    (0.001)      Z2_logit
   5  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)  Z1_pystacked
   6  3  Y1_pystacked  Y1_pystacked      D2_logit  D1_pystacked    -0.002    (0.002)      Z2_logit
   7  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)  Z1_pystacked
*  8  3  Y1_pystacked  Y1_pystacked      D2_logit      D2_logit    -0.002    (0.002)      Z2_logit
   9  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.009    (0.017)  Z1_pystacked
  10  3  Y1_pystacked        Y2_reg  D1_pystacked  D1_pystacked    -0.003    (0.016)      Z2_logit
  11  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.009    (0.017)  Z1_pystacked
  12  3  Y1_pystacked        Y2_reg  D1_pystacked      D2_logit    -0.003    (0.016)      Z2_logit
  13  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked    -0.005    (0.018)  Z1_pystacked
  14  3  Y1_pystacked        Y2_reg      D2_logit  D1_pystacked     0.001    (0.018)      Z2_logit
  15  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit    -0.005    (0.018)  Z1_pystacked
  16  3  Y1_pystacked        Y2_reg      D2_logit      D2_logit     0.001    (0.018)      Z2_logit
  17  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.012    (0.041)  Z1_pystacked
  18  3        Y2_reg  Y1_pystacked  D1_pystacked  D1_pystacked    -0.014    (0.033)      Z2_logit
  19  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.012    (0.041)  Z1_pystacked
  20  3        Y2_reg  Y1_pystacked  D1_pystacked      D2_logit    -0.014    (0.033)      Z2_logit
  21  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.005    (0.045)  Z1_pystacked
  22  3        Y2_reg  Y1_pystacked      D2_logit  D1_pystacked     0.002    (0.035)      Z2_logit
  23  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.005    (0.045)  Z1_pystacked
  24  3        Y2_reg  Y1_pystacked      D2_logit      D2_logit     0.002    (0.035)      Z2_logit
  25  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.019    (0.056)  Z1_pystacked
  26  3        Y2_reg        Y2_reg  D1_pystacked  D1_pystacked    -0.016    (0.049)      Z2_logit
  27  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.019    (0.056)  Z1_pystacked
  28  3        Y2_reg        Y2_reg  D1_pystacked      D2_logit    -0.016    (0.049)      Z2_logit
  29  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.003    (0.060)  Z1_pystacked
  30  3        Y2_reg        Y2_reg      D2_logit  D1_pystacked     0.005    (0.052)      Z2_logit
  31  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.003    (0.060)  Z1_pystacked
  32  3        Y2_reg        Y2_reg      D2_logit      D2_logit     0.005    (0.052)      Z2_logit
  ss  3  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
* = minimum MSE specification for that resample.

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
   1 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.001)  Z1_pystacked
   1 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.001)  Z1_pystacked
   2 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.001)      Z2_logit
   2 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.001)      Z2_logit
   3 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.001)  Z1_pystacked
   3 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.001)  Z1_pystacked
   4 mn Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.001)      Z2_logit
   4 md Y1_pystacked0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.001)      Z2_logit
   5 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   5 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)  Z1_pystacked
   6 mn Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   6 md Y1_pystacked0 Y1_pystacked1     D2_logit0 D1_pystacked1    -0.002    (0.002)      Z2_logit
   7 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   7 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)  Z1_pystacked
   8 mn Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)      Z2_logit
   8 md Y1_pystacked0 Y1_pystacked1     D2_logit0     D2_logit1    -0.002    (0.002)      Z2_logit
   9 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.013    (0.018)  Z1_pystacked
   9 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.010    (0.017)  Z1_pystacked
  10 mn Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.005    (0.016)      Z2_logit
  10 md Y1_pystacked0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.005    (0.016)      Z2_logit
  11 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.013    (0.018)  Z1_pystacked
  11 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.010    (0.017)  Z1_pystacked
  12 mn Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.005    (0.016)      Z2_logit
  12 md Y1_pystacked0       Y2_reg1 D1_pystacked0     D2_logit1    -0.005    (0.016)      Z2_logit
  13 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.013    (0.020)  Z1_pystacked
  13 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.010    (0.019)  Z1_pystacked
  14 mn Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.006    (0.019)      Z2_logit
  14 md Y1_pystacked0       Y2_reg1     D2_logit0 D1_pystacked1    -0.003    (0.018)      Z2_logit
  15 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.013    (0.020)  Z1_pystacked
  15 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.010    (0.019)  Z1_pystacked
  16 mn Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.006    (0.019)      Z2_logit
  16 md Y1_pystacked0       Y2_reg1     D2_logit0     D2_logit1    -0.003    (0.018)      Z2_logit
  17 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1     0.003    (0.042)  Z1_pystacked
  17 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.002    (0.042)  Z1_pystacked
  18 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.003    (0.035)      Z2_logit
  18 md       Y2_reg0 Y1_pystacked1 D1_pystacked0 D1_pystacked1    -0.006    (0.034)      Z2_logit
  19 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1     0.003    (0.042)  Z1_pystacked
  19 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.002    (0.042)  Z1_pystacked
  20 mn       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.003    (0.035)      Z2_logit
  20 md       Y2_reg0 Y1_pystacked1 D1_pystacked0     D2_logit1    -0.006    (0.034)      Z2_logit
  21 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.013    (0.045)  Z1_pystacked
  21 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.013    (0.045)  Z1_pystacked
  22 mn       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.001    (0.038)      Z2_logit
  22 md       Y2_reg0 Y1_pystacked1     D2_logit0 D1_pystacked1     0.002    (0.038)      Z2_logit
  23 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.013    (0.044)  Z1_pystacked
  23 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.013    (0.045)  Z1_pystacked
  24 mn       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.001    (0.038)      Z2_logit
  24 md       Y2_reg0 Y1_pystacked1     D2_logit0     D2_logit1     0.002    (0.038)      Z2_logit
  25 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.008    (0.056)  Z1_pystacked
  25 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.011    (0.056)  Z1_pystacked
  26 mn       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.006    (0.050)      Z2_logit
  26 md       Y2_reg0       Y2_reg1 D1_pystacked0 D1_pystacked1    -0.010    (0.049)      Z2_logit
  27 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.008    (0.056)  Z1_pystacked
  27 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.011    (0.056)  Z1_pystacked
  28 mn       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.006    (0.050)      Z2_logit
  28 md       Y2_reg0       Y2_reg1 D1_pystacked0     D2_logit1    -0.010    (0.049)      Z2_logit
  29 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.002    (0.061)  Z1_pystacked
  29 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.003    (0.060)  Z1_pystacked
  30 mn       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1    -0.003    (0.056)      Z2_logit
  30 md       Y2_reg0       Y2_reg1     D2_logit0 D1_pystacked1     0.005    (0.053)      Z2_logit
  31 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.002    (0.061)  Z1_pystacked
  31 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.003    (0.060)  Z1_pystacked
  32 mn       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1    -0.003    (0.055)      Z2_logit
  32 md       Y2_reg0       Y2_reg1     D2_logit0     D2_logit1     0.005    (0.053)      Z2_logit
 mse mn     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss mn  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]
 mse md     [min-mse]     [min-mse]     [min-mse]     [min-mse]    -0.002    (0.002)     [min-mse]
  ss md  [shortstack]          [ss]          [ss]          [ss]    -0.002    (0.001)          [ss]

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0013823    -1.15   0.249    -.0043044    .0011142
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0020   -0.0020   -0.0016   -0.0015   -0.0015

. forvalues i=1/8 {
  2.     forvalues r=1/2 {
  3.                 ddml estimate, mname(m0) spec(`i') rep(`r') replay notable
  4.         }
  5. }

DDML model, specification 1 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0018613   .0016412    -1.13   0.257    -.0050779    .0013554
------------------------------------------------------------------------------


DDML model, specification 1 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0023374   .0014069    -1.66   0.097     -.005095    .0004201
------------------------------------------------------------------------------


DDML model, specification 2 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0016183   .0015461    -1.05   0.295    -.0046486    .0014119
------------------------------------------------------------------------------


DDML model, specification 2 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019632   .0013246    -1.48   0.138    -.0045594     .000633
------------------------------------------------------------------------------


DDML model, specification 3 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0018602   .0016401    -1.13   0.257    -.0050747    .0013544
------------------------------------------------------------------------------


DDML model, specification 3 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0023349   .0014054    -1.66   0.097    -.0050895    .0004197
------------------------------------------------------------------------------


DDML model, specification 4 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D1_pystacked0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0016178   .0015456    -1.05   0.295    -.0046471    .0014114
------------------------------------------------------------------------------


DDML model, specification 4 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      4404
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D1_pystacked0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019622    .001324    -1.48   0.138    -.0045571    .0006327
------------------------------------------------------------------------------


DDML model, specification 5 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019953     .00186    -1.07   0.283    -.0056408    .0016502
------------------------------------------------------------------------------


DDML model, specification 5 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0028536    .001754    -1.63   0.104    -.0062914    .0005843
------------------------------------------------------------------------------


DDML model, specification 6 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D1_pystacked1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0018417   .0017506    -1.05   0.293    -.0052729    .0015894
------------------------------------------------------------------------------


DDML model, specification 6 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D1_pystacked1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022568   .0016503    -1.37   0.171    -.0054913    .0009777
------------------------------------------------------------------------------


DDML model, specification 7 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z1_pystacked_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019918   .0018566    -1.07   0.283    -.0056308    .0016471
------------------------------------------------------------------------------


DDML model, specification 7 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z1_pystacked_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0028512   .0017526    -1.63   0.104    -.0062863    .0005839
------------------------------------------------------------------------------


Min MSE DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839   .0017479    -1.05   0.293    -.0052648    .0015869
------------------------------------------------------------------------------


Min MSE DDML model, specification 8 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022564   .0016501    -1.37   0.171    -.0054905    .0009776
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(1) replay notable

Min MSE DDML model, specification 8 (sample=1) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_1                     Number of obs   =      3792
E[y|X,Z=1]   = Y1_pystacked1_1
E[D|X,Z=0]   = D2_logit0_1
E[D|X,Z=1]   = D2_logit1_1
E[Z|X]       = Z2_logit_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839   .0017479    -1.05   0.293    -.0052648    .0015869
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(2) replay notable

Min MSE DDML model, specification 8 (sample=2) (LATE)
E[y|X,Z=0]   = Y1_pystacked0_2                     Number of obs   =      3363
E[y|X,Z=1]   = Y1_pystacked1_2
E[D|X,Z=0]   = D2_logit0_2
E[D|X,Z=1]   = D2_logit1_2
E[Z|X]       = Z2_logit_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0022564   .0016501    -1.37   0.171    -.0054905    .0009776
------------------------------------------------------------------------------


. ddml estimate, mname(m0) spec(mse) rep(mn) replay notable

Mean over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = mn_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = mn_1_mse
E[D|X,Z=0]   = mn_training0_mse
E[D|X,Z=1]   = mn_training1_mse
E[Z|X]       = mn__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019762   .0016469    -1.20   0.230    -.0052041    .0012516
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0020   -0.0023   -0.0023   -0.0018   -0.0018   -0.0018

. ddml estimate, mname(m0) spec(mse) rep(md) replay notable

Median over 3 min-mse specifications (LATE)
E[y|X,Z=0]   = md_0_mse                            Number of obs   =      5000
E[y|X,Z=1]   = md_1_mse
E[D|X,Z=0]   = md_training0_mse
E[D|X,Z=1]   = md_training1_mse
E[Z|X]       = md__mse
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |   -.001839    .001702    -1.08   0.280    -.0051749     .001497
------------------------------------------------------------------------------

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0020   -0.0023   -0.0023   -0.0018   -0.0018   -0.0018

. ddml estimate, mname(m0) spec(ss) rep(1) replay notable

Shortstack DDML model (sample=1) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_1                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_1
E[D|X,Z=0]   = D_training_ss0_1
E[D|X,Z=1]   = D_training_ss1_1
E[Z|X]       = Z_assignmt_ss_1
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0015485    -1.03   0.303    -.0046301    .0014399
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(2) replay notable

Shortstack DDML model (sample=2) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0_2                  Number of obs   =      4404
E[y|X,Z=1]   = Y_lnearnings_ss1_2
E[D|X,Z=0]   = D_training_ss0_2
E[D|X,Z=1]   = D_training_ss1_2
E[Z|X]       = Z_assignmt_ss_2
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0019803   .0013276    -1.49   0.136    -.0045823    .0006217
------------------------------------------------------------------------------
Stacking final estimator: nnls1


. ddml estimate, mname(m0) spec(ss) rep(mn) replay notable

Shortstack DDML model (mean over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0016952   .0014159    -1.20   0.231    -.0044703      .00108
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0020   -0.0020   -0.0016   -0.0015   -0.0015

. ddml estimate, mname(m0) spec(ss) rep(md) replay notable

Shortstack DDML model (median over 3 resamples) (LATE)
E[y|X,Z=0]   = Y_lnearnings_ss0                    Number of obs   =      5000
E[y|X,Z=1]   = Y_lnearnings_ss1
E[D|X,Z=0]   = D_training_ss0
E[D|X,Z=1]   = D_training_ss1
E[Z|X]       = Z_assignmt_ss
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0015951   .0013823    -1.15   0.249    -.0043044    .0011142
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 3 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0017   -0.0020   -0.0020   -0.0016   -0.0015   -0.0015

. *** ddml extract
. ddml extract, show(ssweights)

short-stacked weights across resamples for assignmt
final stacking estimator: nnls1
                  learner  mean_weight        rep_1        rep_2        rep_3
Z1_pystacked            1    .11907426    .19087826    .06254651      .103798
    Z2_logit            2    .88092574    .80912174    .93745349      .896202

short-stacked weights across resamples for lnearnings
final stacking estimator: nnls1
                  learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
Y1_pystacked            1            0    .99976644            1     .9997798    .99951952
      Y2_reg            2            0    .00023356            0     .0002202    .00048048
Y1_pystacked            1            1    .99825397    .99804471    .99909857    .99761862
      Y2_reg            2            1    .00174603    .00195529    .00090143    .00238138

short-stacked weights across resamples for training
final stacking estimator: nnls1
                  learner        Z=0/1  mean_weight        rep_1        rep_2        rep_3
D1_pystacked            1            0            .            .            .            .
    D2_logit            2            0            .            .            .            .
D1_pystacked            1            1     .4503017    .40461502    .45556794    .49072214
    D2_logit            2            1     .5496983    .59538498    .54443206    .50927786

. 
. *** ddml overlap
. ddml init interactiveiv, kfolds(2) reps(2)
warning - model m0 already exists
all existing model results and variables will
be dropped and model m0 will be re-initialized

. ddml E[Y|X,Z]: pystacked $Y $X, type(reg) method(ols gradboost)
Learner Y1_pystacked added successfully.

. ddml E[D|X,Z]: pystacked $D $X, type(class) method(logit gradboost)
Learner D1_pystacked added successfully.

. ddml E[Z|X]: pystacked $Z $X, type(class) method(logit gradboost)
Learner Z1_pystacked added successfully.

. ddml crossfit
note: treatment (training) = 1 in 27 cases when assignment (assignmt) = 0
Cross-fitting E[y|X,Z] equation: lnearnings
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[D|X,Z] equation: training
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting
Cross-fitting E[Z|X]: assignmt
Resample 1...
Cross-fitting fold 1 2 ...completed cross-fitting
Resample 2...
Cross-fitting fold 1 2 ...completed cross-fitting

. ddml estimate


Model:                  interactiveiv, crossfit folds k=2, resamples r=2
Mata global (mname):    m0
Dependent variable (Y): lnearnings
 lnearnings learners:   Y1_pystacked
D equations (1):        training
 training learners:     D1_pystacked
Z equations (1):        assignmt
 assignmt learners:     Z1_pystacked

DDML estimation results (LATE):
spec  r  Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st  1  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.003    (0.001)  Z1_pystacked
  st  2  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.001    (0.002)  Z1_pystacked

Mean/med Y(0) learner  Y(1) learner  D(0) learner  D(1) learner         b        SE      Z learner
  st mn  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked
  st md  Y1_pystacked  Y1_pystacked  D1_pystacked  D1_pystacked    -0.002    (0.002)  Z1_pystacked

Median over 2 stacking resamples (LATE)
E[y|X,Z=0]   = Y1_pystacked0                       Number of obs   =      5000
E[y|X,Z=1]   = Y1_pystacked1
E[D|X,Z=0]   = D1_pystacked0
E[D|X,Z=1]   = D1_pystacked1
E[Z|X]       = Z1_pystacked
------------------------------------------------------------------------------
             |               Robust
  lnearnings | Coefficient  std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
    training |  -.0020522   .0019154    -1.07   0.284    -.0058063    .0017019
------------------------------------------------------------------------------
Stacking final estimator: nnls1

Summary over 2 resamples:
       D eqn      mean       min       p25       p50       p75       max
    training     -0.0021   -0.0032   -0.0032   -0.0021   -0.0009   -0.0009

. ddml overlap

. ddml overlap, replist(1)

. ddml overlap, pslist(Z1_pystacked_L1 Z1_pystacked_L2)

. ddml overlap, name(triangle, replace)                                                   ///
>         title("Propensity score: triangle kernel")

. ddml overlap, kernel(epanechnikov) name(epanechnikov, replace)  ///
>         title("Propensity score: epanechnikov kernel")

. 
. log close
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/cert/ddml_cert_interactiveiv.log
  log type:  text
 closed on:  30 Aug 2024, 17:28:59
---------------------------------------------------------------------------------------------------------------
