--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/examples/log_BLP.txt
  log type:  text
 opened on:   9 Feb 2021, 19:39:18

.  
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado

. which pystacked 
/Users/kahrens/MyProjects/pylearn2/pystacked.ado

. 
. insheet using "https://statalasso.github.io/dta/BLP1995-prepared.csv", comma clear
(73 vars, 2,217 obs)

. 
. ********************************************************************************
. *** ddml                                                                                                          
>                                ***
. ********************************************************************************
. 
. global Y share

. global D price

. global X hpwt-spaceu_tu

. global Z z1-z28

.  
. *** initialise ddml and select model
. set seed 123

. ddml init optimaliv 

. 
. *** specify supervised machine learners for E[Y|X] ("yeq"), E[D|X] ("deq")
. *** as well as E[D|Z,X] ("zeq")
. 
. * "y"-equation:
. ddml yeq, gen(yt1) : rlasso $Y $X
rlasso share hpwt-spaceu_tu
Equation successfully added.

. ddml yeq, gen(yt2) : pystacked $Y $X, type(reg) seed(99)
pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Equation successfully added.

. ddml yeq, gen(yt3) : pyvote $Y $X, type(reg)
pyvote share hpwt-spaceu_tu , type(reg)
Equation successfully added.

. 
. * "d"-equation:
. ddml deq, gen(d1t1): rlasso $D $X
rlasso price hpwt-spaceu_tu
Equation successfully added.

. ddml deq, gen(d1t2): pystacked $D $X, type(reg)
pystacked price hpwt-spaceu_tu , type(reg)
Equation successfully added.

. ddml deq, gen(d1t3): pyvote $D $X, type(reg)
pyvote price hpwt-spaceu_tu , type(reg)
Equation successfully added.

. 
. * "dheq"-equation:
. ddml dheq, gen(d2H1): rlasso $D $X $Z
rlasso price hpwt-spaceu_tu z1-z28
Equation successfully added.

. ddml dheq, gen(d2H2): pystacked $D $X $Z, type(reg)
pystacked price hpwt-spaceu_tu z1-z28 , type(reg)
Equation successfully added.

. ddml dheq, gen(d2H3): pyvote $D $X $Z, type(reg)
pyvote price hpwt-spaceu_tu z1-z28 , type(reg)
Equation successfully added.

.  
. *** cross-fitting and display mean-squared prediction error
. ddml crossfit
Model: optimaliv
Number of Y estimating equations: 3
Number of D estimating equations: 3

Cross-fitting fold 1 2

Mean-squared error for y|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 share             yt1                 rlasso      2217     57.171980
 share             yt2                 pystacked   2217     56.732260
 share             yt3                 pyvote      2217     57.713640

Mean-squared error for D|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 price             d1t1                rlasso      2217     31.183760
 price             d1t2                pystacked   2217     16.740380
 price             d1t3                pyvote      2217     17.121120
 price             d2H1                rlasso      2217     30.418450
 price             d2H2                pystacked   2217     12.369230
 price             d2H3                pyvote      2217     11.747250

. 
. *** get an overview of "equations" and MSE
. ddml desc
Model: optimaliv
ID: m0_id
Fold ID: m0_fid
Sample indicator: m0_sample (N=2217)
Dependent variable (Y): share
Dependent variable (orthogonalized): yt1 yt2 yt3
Minimum MSE orthogonalized dep var: yt2
Causal variable(s) (D): price
Causal variable(s) (orthogonalized): d1t1 d1t2 d1t3
Minimum MSE orthogonalized causal var: d2H3

Number of Y estimating equations: 3
Estimating equation 1: N =   2217     MSE =  57.171984
  Variable: share            Orthogonalized: yt1
  Command: rlasso share hpwt-spaceu_tu
Estimating equation 2: N =   2217     MSE =  56.732256*
  Variable: share            Orthogonalized: yt2
  Command: pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Estimating equation 3: N =   2217     MSE =  57.713636
  Variable: share            Orthogonalized: yt3
  Command: pyvote share hpwt-spaceu_tu , type(reg)

Number of D estimating equations: 3
Estimating equation 4: N =   2217     MSE =  31.183759
  Variable: price            Orthogonalized: d1t1
  Command: rlasso price hpwt-spaceu_tu
Estimating equation 5: N =   2217     MSE =  16.740377
  Variable: price            Orthogonalized: d1t2
  Command: pystacked price hpwt-spaceu_tu , type(reg)
Estimating equation 6: N =   2217     MSE =  17.121124
  Variable: price            Orthogonalized: d1t3
  Command: pyvote price hpwt-spaceu_tu , type(reg)

* indicates minimum MSE estimation

. 
. *** estimation of parameter of interest
. ddml estimate 
DML with E[Y|X]=m0_yt3 and E[D|X]=m0_d1t3, E[D|X,Y]=m0_d2H3:
------------------------------------------------------------------------------
         yt2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.1369709   .0092462   -14.81   0.000    -.1550931   -.1188488
------------------------------------------------------------------------------

. 
. *** now, do the same using the one-line command (qddml) 
. *** .. which uses only pystacked
. qddml $Y ($X) ($D = $Z), model(optimaliv)  
DML with E[Y|X]=m0_y and E[D|X]=m0_d, E[D|X,Y]=m0_z:
------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.1225792   .0099523   -12.32   0.000    -.1420854   -.1030731
------------------------------------------------------------------------------

. *** use only rlasso:
. qddml $Y ($X) ($D = $Z), model(optimaliv) cmd(rlasso)
DML with E[Y|X]=m0_y and E[D|X]=m0_d, E[D|X,Y]=m0_z:
------------------------------------------------------------------------------
           y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.4255649   .0454737    -9.36   0.000    -.5146916   -.3364382
------------------------------------------------------------------------------

. 
. cap log close
