--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/examples/log_interactive.txt
  log type:  text
 opened on:  14 Feb 2021, 19:39:08

.  
. webuse cattaneo2
(Excerpt from Cattaneo (2010) Journal of Econometrics 155: 138-154)

.   
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado

. which pystacked
/Users/kahrens/MyProjects/pylearn2/pystacked.ado

.   
. ********************************************************************************
. *** interactive model                                                                                             
>                ***
. ********************************************************************************
. 
. *** initialise ddml and select model; 
. ddml init interactive

. 
. gen double mage_sq = mage^2

. 
. global Y bweight

. global D mbsmoke

. global X c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu)

. 
. *** specify supervised machine learners for E[Y|X,D=1] & E[Y|X,D=0] ("yeq") and E[D|X] ("deq")
. 
. * y-equation:
. ddml yeq, gen(lassoy): lasso2 $Y $X, lic(aicc) postres
lasso2 bweight c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , lic(aicc) postres
Equation successfully added.

. ddml yeq, gen(rlassoy): rlasso $Y $X 
rlasso bweight c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu)
Equation successfully added.

. ddml yeq, gen(pystackedy): pystacked $Y $X, type(reg) 
pystacked bweight c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , type(reg)
Equation successfully added.

. 
. * d-equation:
. ddml deq, gen(lassod): lasso2 $D $X, lic(aicc) postres
lasso2 mbsmoke c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , lic(aicc) postres
Equation successfully added.

. ddml deq, gen(rlassod): rlasso $D $X
rlasso mbsmoke c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu)
Equation successfully added.

. ddml deq, gen(pystackedd): pystacked $D $X, type(reg)
pystacked mbsmoke c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , type(reg)
Equation successfully added.

. 
. *** cross-fitting and display mean-squared prediction error
. ddml crossfit, kfolds(2) 
Model: interactive
Number of Y estimating equations: 3
Number of D estimating equations: 3

Cross-fitting fold 1 2

Mean-squared error for y|X,D=0:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 bweight           m0_lassoy           lasso2      3778     3.192e+05
 bweight           m0_rlassoy          rlasso      3778     3.197e+05
 bweight           m0_pystackedy       pystacked   3778     3.200e+05

Mean-squared error for y|X,D=1:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 bweight           m0_lassoy           lasso2       864     3.144e+05
 bweight           m0_rlassoy          rlasso       864     3.163e+05
 bweight           m0_pystackedy       pystacked    864     3.164e+05

Mean-squared error for D|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 mbsmoke           m0_lassod           lasso2      4642      0.137936
 mbsmoke           m0_rlassod          rlasso      4642      0.141400
 mbsmoke           m0_pystackedd       pystacked   4642      0.136585

. ddml desc
Model: interactive
ID: m0_id
Fold ID: m0_fid
Sample indicator: m0_sample (N=4642)
Dependent variable (Y): bweight
Dependent variable (orthogonalized): m0_lassoy m0_rlassoy m0_pystackedy
Minimum MSE orthogonalized dep var: 
Causal variable(s) (D): mbsmoke
Causal variable(s) (orthogonalized): m0_lassod m0_rlassod m0_pystackedd
Minimum MSE orthogonalized causal var: m0_pystackedd

Number of Y estimating equations: 3
Estimating equation 1: (not cross-fitted)
  Variable: bweight          Orthogonalized: m0_lassoy
  Command: lasso2 bweight c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , lic(aicc) post
> res
Estimating equation 2: (not cross-fitted)
  Variable: bweight          Orthogonalized: m0_rlassoy
  Command: rlasso bweight c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu)
Estimating equation 3: (not cross-fitted)
  Variable: bweight          Orthogonalized: m0_pystackedy
  Command: pystacked bweight c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , type(reg)

Number of D estimating equations: 3
Estimating equation 4: (not cross-fitted)
  Variable: mbsmoke          Orthogonalized: m0_lassod
  Command: lasso2 mbsmoke c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , lic(aicc) post
> res
Estimating equation 5: (not cross-fitted)
  Variable: mbsmoke          Orthogonalized: m0_rlassod
  Command: rlasso mbsmoke c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu)
Estimating equation 6: (not cross-fitted)*
  Variable: mbsmoke          Orthogonalized: m0_pystackedd
  Command: pystacked mbsmoke c.(mmarried mage mage_sq fbaby medu)#c.(mmarried mage mage_sq fbaby medu) , type(reg)

* indicates minimum MSE estimation

. 
. *** estimation of parameter of interest
. ddml estimate
DML with Y0=m0_lassoy, Y1=m0_lassoy and D=m0_pystackedd:
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -1579.953   42.51675   -37.16   0.000    -1663.284   -1496.622
------------------------------------------------------------------------------

. 
. *** now, do the same using one-line command
. qddml $Y $D ($X), model(interactive)
DML with Y0=m0_y, Y1=m0_y and D=m0_d:
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     mbsmoke |  -1579.119   42.54511   -37.12   0.000    -1662.506   -1495.732
------------------------------------------------------------------------------

. 
. cap log close
