--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/examples/log_BLP.txt
  log type:  text
 opened on:  14 Feb 2021, 15:58:14

.  
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado

. which pystacked 
/Users/kahrens/MyProjects/pylearn2/pystacked.ado

. 
. insheet using "https://statalasso.github.io/dta/BLP1995-prepared.csv", comma clear
(73 vars, 2,217 obs)

. 
. ********************************************************************************
. *** DDML-IV (*not* LIE-confirm)                                                                                  *
> **
. ********************************************************************************
. 
. global Y share

. global D price

. global X hpwt-spaceu_tu

. global Z z1-z28

.  
. *** initialise ddml and select model
. set seed 123

. ddml init optimaliv 

. 
. *** specify supervised machine learners for E[Y|X] ("yeq"), E[D|X] ("deq")
. *** as well as E[D|Z,X] ("dheq")
. 
. * "y"-equation:
. ddml yeq, gen(yt1) : rlasso $Y $X
rlasso share hpwt-spaceu_tu
Equation successfully added.

. ddml yeq, gen(yt2) : pystacked $Y $X, type(reg) seed(99)
pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Equation successfully added.

. ddml yeq, gen(yt3) : pyvote $Y $X, type(reg)
pyvote share hpwt-spaceu_tu , type(reg)
Equation successfully added.

. 
. * "d"-equation:
. ddml deq, gen(d1t1): rlasso $D $X
rlasso price hpwt-spaceu_tu
Equation successfully added.

. ddml deq, gen(d1t2): pystacked $D $X, type(reg)
pystacked price hpwt-spaceu_tu , type(reg)
Equation successfully added.

. ddml deq, gen(d1t3): pyvote $D $X, type(reg)
pyvote price hpwt-spaceu_tu , type(reg)
Equation successfully added.

. 
. * "dheq"-equation:
. ddml dheq, gen(d2H1): rlasso $D $X $Z
rlasso price hpwt-spaceu_tu z1-z28
Equation successfully added.

. ddml dheq, gen(d2H2): pystacked $D $X $Z, type(reg)
pystacked price hpwt-spaceu_tu z1-z28 , type(reg)
Equation successfully added.

. ddml dheq, gen(d2H3): pyvote $D $X $Z, type(reg)
pyvote price hpwt-spaceu_tu z1-z28 , type(reg)
Equation successfully added.

.  
. *** cross-fitting and display mean-squared prediction error
. ddml crossfit
Model: optimaliv
Number of Y estimating equations: 3
Number of D estimating equations: 3
Number of DH estimating equations: 3

Cross-fitting equation 1 2 3 4 5 6 7 8 9

Mean-squared error for y|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 share             m0_yt1              rlasso      2217     57.171980
 share             m0_yt2              pystacked   2217     56.803450
 share             m0_yt3              pyvote      2217     57.711710

Mean-squared error for D|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 price             m0_d1t1             rlasso      2217     31.183760
 price             m0_d1t2             pystacked   2217     16.751240
 price             m0_d1t3             pyvote      2217     16.952000
 price             m0_d2H1             rlasso      2217     30.418450
 price             m0_d2H2             pystacked   2217     12.470820
 price             m0_d2H3             pyvote      2217     11.776120

Mean-squared error for D|X,Z:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 price             m0_d1t1             rlasso      2217     31.183760
 price             m0_d1t2             pystacked   2217     16.751240
 price             m0_d1t3             pyvote      2217     16.952000
 price             m0_d2H1             rlasso      2217     30.418450
 price             m0_d2H2             pystacked   2217     12.470820
 price             m0_d2H3             pyvote      2217     11.776120

. 
. *** get an overview of "equations" and MSE
. ddml desc
Model: optimaliv
ID: m0_id
Fold ID: m0_fid
Sample indicator: m0_sample (N=2217)
Dependent variable (Y): share
Dependent variable (orthogonalized): m0_yt1 m0_yt2 m0_yt3
Minimum MSE orthogonalized dep var: m0_yt2
Causal variable(s) (D): price
Causal variable(s) (orthogonalized): m0_d1t1 m0_d1t2 m0_d1t3
Minimum MSE orthogonalized causal var: m0_d2H3

Number of Y estimating equations: 3
Estimating equation 1: N =   2217     MSE =  57.171984
  Variable: share            Orthogonalized: m0_yt1
  Command: rlasso share hpwt-spaceu_tu
Estimating equation 2: N =   2217     MSE =  56.803451*
  Variable: share            Orthogonalized: m0_yt2
  Command: pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Estimating equation 3: N =   2217     MSE =  57.711713
  Variable: share            Orthogonalized: m0_yt3
  Command: pyvote share hpwt-spaceu_tu , type(reg)

Number of D estimating equations: 3
Estimating equation 4: N =   2217     MSE =  31.183759
  Variable: price            Orthogonalized: m0_d1t1
  Command: rlasso price hpwt-spaceu_tu
Estimating equation 5: N =   2217     MSE =  16.751241
  Variable: price            Orthogonalized: m0_d1t2
  Command: pystacked price hpwt-spaceu_tu , type(reg)
Estimating equation 6: N =   2217     MSE =  16.952000
  Variable: price            Orthogonalized: m0_d1t3
  Command: pyvote price hpwt-spaceu_tu , type(reg)

Number of DH estimating equations: 3
Estimating equation 7: N =   2217     MSE =  30.418450
  Variable: price            Orthogonalized: m0_d2H1
  Command: rlasso price hpwt-spaceu_tu z1-z28
Estimating equation 8: N =   2217     MSE =  12.470820
  Variable: price            Orthogonalized: m0_d2H2
  Command: pystacked price hpwt-spaceu_tu z1-z28 , type(reg)
Estimating equation 9: N =   2217     MSE =  11.776122*
  Variable: price            Orthogonalized: m0_d2H3
  Command: pyvote price hpwt-spaceu_tu z1-z28 , type(reg)

* indicates minimum MSE estimation

. 
. *** estimation of parameter of interest
. ddml estimate 
DML with E[Y|X]=m0_yt3 and E[D|X]=m0_d1t3, E[D|X,Y]=m0_d2H3:
------------------------------------------------------------------------------
      m0_yt2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.1389302   .0094571   -14.69   0.000    -.1574659   -.1203946
------------------------------------------------------------------------------

. 
. *** now, do the same using the one-line command (qddml) 
. *** .. which uses only pystacked
. qddml $Y ($X) ($D = $Z), model(optimaliv) nolie 
DML with E[Y|X]=m0_y and E[D|X]=m0_d, E[D|X,Y]=m0_dh:
------------------------------------------------------------------------------
        m0_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.1268014   .0101997   -12.43   0.000    -.1467923   -.1068104
------------------------------------------------------------------------------

. *** use only rlasso:
. qddml $Y ($X) ($D = $Z), model(optimaliv) nolie cmd(rlasso)
DML with E[Y|X]=m0_y and E[D|X]=m0_d, E[D|X,Y]=m0_dh:
------------------------------------------------------------------------------
        m0_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.4255649   .0454737    -9.36   0.000    -.5146916   -.3364382
------------------------------------------------------------------------------

. 
. cap log close
