--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/examples/log_late.txt
  log type:  text
 opened on:  14 Feb 2021, 19:40:31

.  
. use "http://fmwww.bc.edu/repec/bocode/j/jtpa.dta",clear   

. 
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado

. which pystacked
/Users/kahrens/MyProjects/pylearn2/pystacked.ado

.   
. ********************************************************************************
. *** interactive model                                                                                             
>                ***
. ********************************************************************************
. 
. *** initialise ddml and select model; 
. ddml init late

. 
. gen lnearnings = log(earnings) 
(1,332 missing values generated)

. global Y lnearnings

. global D training

. global Z assignmt 

. global X sex-age4554

. 
. *** specify supervised machine learners for E[Y|X,Z=1] & E[Y|X,Z=0] ("yeq")
. *** and E[D|X,Z=0] & E[D|X,Z=1] ("deq")
. 
. * y-equation:
. ddml yeq, gen(lassoy): lasso2 $Y $X, lic(aicc) postres
lasso2 lnearnings sex-age4554 , lic(aicc) postres
Equation successfully added.

. ddml yeq, gen(rlassoy): rlasso $Y $X 
rlasso lnearnings sex-age4554
Equation successfully added.

. ddml yeq, gen(pystackedy): pystacked $Y $X, type(reg)
pystacked lnearnings sex-age4554 , type(reg)
Equation successfully added.

. 
. * d-equation:
. ddml deq, gen(lassod): lasso2 $D $X, lic(aicc) postres
lasso2 training sex-age4554 , lic(aicc) postres
Equation successfully added.

. ddml deq, gen(rlassod): rlasso $D $X
rlasso training sex-age4554
Equation successfully added.

. ddml deq, gen(pystackedd): pystacked $D $X, type(reg)
pystacked training sex-age4554 , type(reg)
Equation successfully added.

. 
. * z-equation:
. ddml zeq, gen(lassoz): lasso2 $Z $X, lic(aicc) postres
lasso2 assignmt sex-age4554 , lic(aicc) postres
Equation successfully added.

. ddml zeq, gen(rlassoz): rlasso $Z $X
rlasso assignmt sex-age4554
Equation successfully added.

. ddml zeq, gen(pystackedz): pystacked $Z $X, type(reg)
pystacked assignmt sex-age4554 , type(reg)
Equation successfully added.

. 
. *** cross-fitting and display mean-squared prediction error
. ddml crossfit, kfolds(2) tabfold
Model: late
Number of Y estimating equations: 3
Number of D estimating equations: 3
Number of Z estimating equations: 3

Overview of frequencies by fold:

     m0_fid |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,602       50.00       50.00
          2 |      5,602       50.00      100.00
------------+-----------------------------------
      Total |     11,204      100.00


Cross-fitting fold 1 2

Mean-squared error for y|X,Z=0:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 lnearnings        m0_lassoy           lasso2      3252      0.911419
 lnearnings        m0_rlassoy          rlasso      3252      0.908990
 lnearnings        m0_pystackedy       pystacked   3252      0.000164

Mean-squared error for y|X,Z=1:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 lnearnings        m0_lassoy           lasso2      6620      0.959685
 lnearnings        m0_rlassoy          rlasso      6620      0.967051
 lnearnings        m0_pystackedy       pystacked   6620      0.000404

Mean-squared error for D|X,Z=0:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 training          m0_lassod           lasso2      3717      0.014322
 training          m0_rlassod          rlasso      3717      0.014365
 training          m0_pystackedd       pystacked   3717      0.014365

Mean-squared error for D|X,Z=1:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 training          m0_lassod           lasso2      7487      0.218726
 training          m0_rlassod          rlasso      7487      0.221540
 training          m0_pystackedd       pystacked   7487      0.214510
 assignmt          m0_lassoz           lasso2     11204      0.221716
 assignmt          m0_rlassoz          rlasso     11204      0.221772
 assignmt          m0_pystackedz       pystacked  11204      0.221768

. 
. ddml desc
Model: late
ID: m0_id
Fold ID: m0_fid
Sample indicator: m0_sample (N=11204)
Dependent variable (Y): lnearnings
Dependent variable (orthogonalized): m0_lassoy m0_rlassoy m0_pystackedy
Minimum MSE orthogonalized dep var: 
Causal variable(s) (D): training
Causal variable(s) (orthogonalized): m0_lassod m0_rlassod m0_pystackedd
Minimum MSE orthogonalized causal var: 

Number of Y estimating equations: 3
Estimating equation 1: (not cross-fitted)
  Variable: lnearnings       Orthogonalized: m0_lassoy
  Command: lasso2 lnearnings sex-age4554 , lic(aicc) postres
Estimating equation 2: (not cross-fitted)
  Variable: lnearnings       Orthogonalized: m0_rlassoy
  Command: rlasso lnearnings sex-age4554
Estimating equation 3: (not cross-fitted)
  Variable: lnearnings       Orthogonalized: m0_pystackedy
  Command: pystacked lnearnings sex-age4554 , type(reg)

Number of D estimating equations: 3
Estimating equation 4: (not cross-fitted)
  Variable: training         Orthogonalized: m0_lassod
  Command: lasso2 training sex-age4554 , lic(aicc) postres
Estimating equation 5: (not cross-fitted)
  Variable: training         Orthogonalized: m0_rlassod
  Command: rlasso training sex-age4554
Estimating equation 6: (not cross-fitted)
  Variable: training         Orthogonalized: m0_pystackedd
  Command: pystacked training sex-age4554 , type(reg)

Number of Z estimating equations: 3
Estimating equation 7: (not cross-fitted)*
  Variable: assignmt         Orthogonalized: m0_lassoz
  Command: lasso2 assignmt sex-age4554 , lic(aicc) postres
Estimating equation 8: (not cross-fitted)
  Variable: assignmt         Orthogonalized: m0_rlassoz
  Command: rlasso assignmt sex-age4554
Estimating equation 9: (not cross-fitted)
  Variable: assignmt         Orthogonalized: m0_pystackedz
  Command: pystacked assignmt sex-age4554 , type(reg)

* indicates minimum MSE estimation

. 
. *** estimation of parameter of interest
. ddml estimate 
DML with Y0=m0_pystackedy, Y1=m0_pystackedy, D0=m0_lassod, D1=m0_pystackedd:
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   12.95132   .1173489   110.37   0.000     12.72132    13.18132
------------------------------------------------------------------------------

. 
. *** now, do the same using one-line command
. qddml $Y ($X) ($D=$Z), model(late)
DML with Y0=m0_y, Y1=m0_y, D0=m0_d, D1=m0_d:
------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    training |   12.92597   .1169358   110.54   0.000     12.69678    13.15516
------------------------------------------------------------------------------

.  
. cap log close
