--------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kahrens/MyProjects/ddml/examples/log_BLP_LIE.txt
  log type:  text
 opened on:  14 Feb 2021, 16:00:25

.  
. which ddml
/Users/kahrens/MyProjects/ddml/ddml.ado

. which pystacked 
/Users/kahrens/MyProjects/pylearn2/pystacked.ado

. 
. insheet using "https://statalasso.github.io/dta/BLP1995-prepared.csv", comma clear
(73 vars, 2,217 obs)

. 
. ********************************************************************************
. *** LIE-conform DDML-IV                                                                                           
>                ***
. ********************************************************************************
. 
. global Y share

. global D price

. global X hpwt-spaceu_tu

. global Z z1-z28

.  
. *** initialise ddml and select model
. set seed 123

. ddml init optimaliv 

. 
. *** specify supervised machine learners for E[Y|X] ("yeq"), E[D^|X] ("deq")
. *** as well as D^=E[D|Z,X] ("dheq")
. 
. * "y"-equation:
. ddml yeq, gen(yt1) : rlasso $Y $X
rlasso share hpwt-spaceu_tu
Equation successfully added.

. ddml yeq, gen(yt2) : pystacked $Y $X, type(reg) seed(99)
pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Equation successfully added.

. ddml yeq, gen(yt3) : pyvote $Y $X, type(reg)
pyvote share hpwt-spaceu_tu , type(reg)
Equation successfully added.

. 
. * "dheq"-equation:
. ddml dheq, gen(d2H1) noprefix: rlasso $D $X $Z
rlasso price hpwt-spaceu_tu z1-z28
Equation successfully added.

. ddml dheq, gen(d2H2) noprefix: pystacked $D $X $Z, type(reg)
pystacked price hpwt-spaceu_tu z1-z28 , type(reg)
Equation successfully added.

. ddml dheq, gen(d2H3) noprefix: pyvote $D $X $Z, type(reg)
pyvote price hpwt-spaceu_tu z1-z28 , type(reg)
Equation successfully added.

.   
. * "d"-equation:
. /* In this step, we use estimate of E[D|X,Z] from "dheq"-step as LHS variable.
>         Notes:
>                 - We need to specify variable name explicitly ($D) as it doesn't 
>                 correspond to LHS variable (d2H1 etc).
>                 - Previous step uses "noprefix" option as by default a prefix
>                 is added to all predicted values. 
>                 - Currently "dheq" needs to be added before "deq"; otherwise an error
>                 occurs. (Will be fixed.)
> */ 
. ddml deq, gen(d1t1) vname($D): rlasso d2H1 $X
rlasso d2H1 hpwt-spaceu_tu
Equation successfully added.

. ddml deq, gen(d1t2) vname($D): pystacked d2H2 $X, type(reg)
pystacked d2H2 hpwt-spaceu_tu , type(reg)
Equation successfully added.

. ddml deq, gen(d1t3) vname($D): pyvote d2H3 $X, type(reg) 
pyvote d2H3 hpwt-spaceu_tu , type(reg)
Equation successfully added.

.  
. *** cross-fitting and display mean-squared prediction error
. ddml desc
Model: optimaliv
ID: m0_id
Fold ID: m0_fid
Sample indicator: m0_sample (N=2217)
Dependent variable (Y): share
Dependent variable (orthogonalized): m0_yt1 m0_yt2 m0_yt3
Minimum MSE orthogonalized dep var: 
Causal variable(s) (D): price
Causal variable(s) (orthogonalized): m0_d1t1 m0_d1t2 m0_d1t3
Minimum MSE orthogonalized causal var: 

Number of Y estimating equations: 3
Estimating equation 1: (not cross-fitted)
  Variable: share            Orthogonalized: m0_yt1
  Command: rlasso share hpwt-spaceu_tu
Estimating equation 2: (not cross-fitted)
  Variable: share            Orthogonalized: m0_yt2
  Command: pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Estimating equation 3: (not cross-fitted)
  Variable: share            Orthogonalized: m0_yt3
  Command: pyvote share hpwt-spaceu_tu , type(reg)

Number of D estimating equations: 3
Estimating equation 7: (not cross-fitted)
  Variable: price            Orthogonalized: m0_d1t1
  Command: rlasso d2H1 hpwt-spaceu_tu
Estimating equation 8: (not cross-fitted)
  Variable: price            Orthogonalized: m0_d1t2
  Command: pystacked d2H2 hpwt-spaceu_tu , type(reg)
Estimating equation 9: (not cross-fitted)
  Variable: price            Orthogonalized: m0_d1t3
  Command: pyvote d2H3 hpwt-spaceu_tu , type(reg)

Number of DH estimating equations: 3
Estimating equation 4: (not cross-fitted)
  Variable: price            Orthogonalized: d2H1
  Command: rlasso price hpwt-spaceu_tu z1-z28
Estimating equation 5: (not cross-fitted)
  Variable: price            Orthogonalized: d2H2
  Command: pystacked price hpwt-spaceu_tu z1-z28 , type(reg)
Estimating equation 6: (not cross-fitted)
  Variable: price            Orthogonalized: d2H3
  Command: pyvote price hpwt-spaceu_tu z1-z28 , type(reg)

. ddml crossfit
Model: optimaliv
Number of Y estimating equations: 3
Number of D estimating equations: 3
Number of DH estimating equations: 3

Cross-fitting equation 1 2 3 4 5 6 7 8 9

Mean-squared error for y|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 share             m0_yt1              rlasso      2217     57.171980
 share             m0_yt2              pystacked   2217     56.720410
 share             m0_yt3              pyvote      2217     57.719700

Mean-squared error for D|X:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 price             d2H1                rlasso      2217     30.418450
 price             d2H2                pystacked   2217     12.312900
 price             d2H3                pyvote      2217     11.821200
 price             m0_d1t1             rlasso      2217     31.188800
 price             m0_d1t2             pystacked   2217     18.966850
 price             m0_d1t3             pyvote      2217     19.429820

Mean-squared error for D|X,Z:
 Name              Orthogonalized      Command       N          MSPE
---------------------------------------------------------------------------
 price             d2H1                rlasso      2217     30.418450
 price             d2H2                pystacked   2217     12.312900
 price             d2H3                pyvote      2217     11.821200
 price             m0_d1t1             rlasso      2217     31.188800
 price             m0_d1t2             pystacked   2217     18.966850
 price             m0_d1t3             pyvote      2217     19.429820

. 
. *** get an overview of "equations" and MSE
. ddml desc
Model: optimaliv
ID: m0_id
Fold ID: m0_fid
Sample indicator: m0_sample (N=2217)
Dependent variable (Y): share
Dependent variable (orthogonalized): m0_yt1 m0_yt2 m0_yt3
Minimum MSE orthogonalized dep var: m0_yt2
Causal variable(s) (D): price
Causal variable(s) (orthogonalized): m0_d1t1 m0_d1t2 m0_d1t3
Minimum MSE orthogonalized causal var: d2H3

Number of Y estimating equations: 3
Estimating equation 1: N =   2217     MSE =  57.171984
  Variable: share            Orthogonalized: m0_yt1
  Command: rlasso share hpwt-spaceu_tu
Estimating equation 2: N =   2217     MSE =  56.720409*
  Variable: share            Orthogonalized: m0_yt2
  Command: pystacked share hpwt-spaceu_tu , type(reg) seed(99)
Estimating equation 3: N =   2217     MSE =  57.719698
  Variable: share            Orthogonalized: m0_yt3
  Command: pyvote share hpwt-spaceu_tu , type(reg)

Number of D estimating equations: 3
Estimating equation 7: N =   2217     MSE =  31.188802
  Variable: price            Orthogonalized: m0_d1t1
  Command: rlasso d2H1 hpwt-spaceu_tu
Estimating equation 8: N =   2217     MSE =  18.966847
  Variable: price            Orthogonalized: m0_d1t2
  Command: pystacked d2H2 hpwt-spaceu_tu , type(reg)
Estimating equation 9: N =   2217     MSE =  19.429823
  Variable: price            Orthogonalized: m0_d1t3
  Command: pyvote d2H3 hpwt-spaceu_tu , type(reg)

Number of DH estimating equations: 3
Estimating equation 4: N =   2217     MSE =  30.418450
  Variable: price            Orthogonalized: d2H1
  Command: rlasso price hpwt-spaceu_tu z1-z28
Estimating equation 5: N =   2217     MSE =  12.312905
  Variable: price            Orthogonalized: d2H2
  Command: pystacked price hpwt-spaceu_tu z1-z28 , type(reg)
Estimating equation 6: N =   2217     MSE =  11.821205*
  Variable: price            Orthogonalized: d2H3
  Command: pyvote price hpwt-spaceu_tu z1-z28 , type(reg)

* indicates minimum MSE estimation

. 
. *** estimation of parameter of interest
. ddml estimate  
DML with E[Y|X]=m0_yt3 and E[D|X]=m0_d1t3, E[D|X,Y]=d2H3:
------------------------------------------------------------------------------
      m0_yt2 |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.1143339   .0076834   -14.88   0.000    -.1293931   -.0992747
------------------------------------------------------------------------------

. 
. *** now, do the same using the one-line command (qddml) 
. *** .. which uses only pystacked
. qddml $Y ($X) ($D = $Z), model(optimaliv)  
DML with E[Y|X]=m0_y and E[D|X]=m0_d, E[D|X,Y]=m0_dh:
------------------------------------------------------------------------------
        m0_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |   -.078261   .0083546    -9.37   0.000    -.0946357   -.0618862
------------------------------------------------------------------------------

. *** use only rlasso:
. qddml $Y ($X) ($D = $Z), model(optimaliv) cmd(rlasso)
DML with E[Y|X]=m0_y and E[D|X]=m0_d, E[D|X,Y]=m0_dh:
------------------------------------------------------------------------------
        m0_y |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       price |  -.2450723   .0333393    -7.35   0.000    -.3104161   -.1797285
------------------------------------------------------------------------------

. 
. cap log close
